{
  "111111": {
    "name": "乾",
    "pinyin": "qián",
    "summary": "天行健，乾為天，自強不息。(吉)",
    "detailed": "純陽之卦，六爻皆陽。西北之卦，節氣立冬，乾序數為六，乾卦象徵天，代表剛健、自強不息的精神。君子應效法天的運行，持續努力，奮發向上。財源滾滾，金玉滿堂。建議：得此卦者在能力上並不是問題，最大的問題在於「時機」與自己的應變力。建議凡事不要過於固執傲慢，最好要能見機行事，隨機應變，做事要有彈性。",
    "explanations": {
      "運勢": "運勢亨通，時機重要，宜積極進取，勇於接受挑戰。",
      "感情": "剛強好勝，容易產生摩擦。",
      "財運": "財運佳，適合投資與開拓新財源。",
      "工作": "工作上有突破，適合承擔重任，待良好的時機，展現領導才能。",
      "買賣": "交易順利，可積極拓展業務。",
      "考試": "考試運佳，努力準備可獲得理想成績。",
      "健康": "健康良好，保持運動與積極心態。",
      "訴訟": "訴訟有利，堅持正義可獲勝。",
      "尋人": "尋人順利，對方可能正在積極行動。",
      "尋物": "遺失物品可尋回，宜主動尋找。",
      "旅行": "旅行順利，適合探索新領域。",
      "人際": "人際關係良好，宜主動結交新朋友。",
      "卦辭": "乾，元亨利貞。\n《彖》曰：大哉乾元，萬物資始，乃統天。雲行雨施，品物流形，大明終始，六位時成，時乘六龍以御天。乾道變化，各正性命，保合大和，乃利貞。首出庶物，萬國咸寧。\n《象》曰：天行健，君子以自強不息。\n\n元亨為大美大善之匯聚。貞為正、定、貞固（堅持）等意思。「利貞」即利於正、利於貞固、宜於堅定。或者可解釋為有利之後而能夠堅定。「元亨利貞」意謂已經匯聚了美善條件，不需外求，宜於守住自己既有的美德，堅定自己的德性。或者可解釋為，具備最大之美善，能夠匯聚美善則可得利而貞定。\n\n【卦旨】乾卦又以「健」為卦名，此卦為《周易》六十四卦之首，卦體以天為象，爻辭以龍為象，揭示陽剛乃宇宙萬物之本元的重要作用及其發展變化規律；同時勉勵人們效法天的剛健精神，自強不息，奮發向上。陽為大且主動積極的卦象"
    },
    "yaoInterpretation": {
      "初九":"初九，潛龍，勿用。\n《象》曰：潛龍勿用，陽在下也。\n\n潛藏的龍，不應有所作為，養精畜銳的時候，凡事應當潛沉，靜待時機，切勿躁進。",
      "九二":"九二，見龍在田，利見大人。\n《象》曰：見龍在田，德施普也。\n\n龍已出現在田間，象徵事情已出現端倪，可以不再潛藏。這時最好能積極主動，求見有權位的大人。九二為龍離隱出藏的時候，喻君子準備入世行事，有所作為，因此開始遊走四方，拜會大人。",
      "九三":"九三，君子終日乾乾，夕惕若，厲无咎。\n《象》曰：終日乾乾，反復道也。\n\n君子整日努力不懈怠，埋頭苦幹，夜晚更要自我反省警惕，雖然艱難困苦，但不會有罪咎。九二見龍在田，君子離隱入世，開始與大人接洽。九三為君子開始做事，但凡事起頭難，因此「終日健健，夕惕若」。若能夠忍受艱難困苦，則能免於罪咎。反之，若是怠慢以對，那麼就會有罪咎。",
      "九四":"九四，或躍在淵，无咎。\n《象》曰：或躍在淵，進无咎也。\n\n或許能夠躍出深不見底的水潭，沒有罪咎。九三開始積極行事，終日忙碌不已，整日努力不懈，勞心勞力。到九四則是嘗試突破、蛻變的時候，因此說「或」，代表不確定。「躍」為突破的舉動，「或躍」就是嘗試突破現狀，因此《文言》說「或躍在淵，自試也」、「乾道乃革」。",
      "九五":"九五，飛龍在天，利見大人。\n《象》曰：飛龍在天，大人造也。\n\n飛翔的龍在天上，利於見有德位的大人。\n五為六爻中最為尊貴的位置，故有「九五之尊」的成語，言陽九居於五位，也是「天下」的君位。五為天位，故曰「在天」。喻君子以極高的才能，而身居尊位。此爻「利見大人」與九二有不一樣的意義。九二為出潛謀始之時，遊說四方。九五之利見大人，已居尊位。《繫辭》：「五多功。」五乃君子功成之時。龍亦象徵寵，\n飛龍在天亦有受到極高之榮寵的意思。",
      "上九":"上九，亢龍有悔。 \n《象》曰：亢龍有悔，盈不可久也。\n\n過高的龍，會有悔恨。亢龍，意指居高位的龍，此有高傲之意。過猶不及，五位是飛龍在天，已至尊位。上位則過高，反而有危險。《文言》「貴而无位，高而无民」，意指上九雖高貴但無權位，且無人民之擁戴，以此而動，必有悔恨。",
      "用九":"用九，見群龍无首，吉。\n《象》曰：用九，天德不可為首也。\n\n見到一整群的龍，沒有元首。吉。六爻皆變，為六龍（群龍）無首之象。乾龍為純陽之物，最忌剛上加剛，以適變、中庸為宜，若在物首則反而過亢。因此群龍而無一龍可為首，無首則吉。《文言》以「天下治」稱之，則用九乃天下太平之象。天下太平則賢人出，有如群龍飛舞而無一為首。"
    }
  },
  "000000": {
    "name": "坤",
    "pinyin": "kūn",
    "summary": "地勢坤，坤為地，厚德載物。(吉)",
    "detailed": "純陰之卦，六爻皆陰。西南之卦，節氣立秋，坤序數為二，坤卦象徵地，代表柔順、包容的特質。君子應效法地的德行，以寬廣的胸懷承載萬物。謙卑退讓者有福，過於積極主動者反而一無所成。對於立定志向想做的事，應該要持之以恒，堅持到底，則可成功，操之過急，易致失敗。利於追隨於人，不適於自己獨當一面。吉位在西南，十月之卦。",
    "explanations": {
      "運勢": "運勢平穩，宜守成待時，不宜冒進。慢慢來，可成；急切、積極進取反而不可得",
      "感情": "感情穩定，宜包容體諒，增進感情。",
      "財運": "財運平穩，適合穩健理財，避免冒險投資。",
      "工作": "工作進展順利，宜踏實努力，積累成果。",
      "買賣": "交易平穩，宜守株待兔，等待良機。",
      "考試": "考試運平穩，需勤奮努力，方能取得佳績。",
      "健康": "健康狀況良好，宜保持規律生活。",
      "訴訟": "訴訟進展平穩，宜以和為貴，尋求和解。",
      "尋人": "尋人進展順利，對方可能在固定場所。",
      "尋物": "遺失物品可尋回，宜耐心尋找。",
      "旅行": "旅行順利，適合休閒放鬆。",
      "人際": "人際關係和諧，宜廣結善緣。",
      "卦辭": "坤，元亨，利牝馬之貞。君子有攸往，先迷，後得主利。西南得朋，東北喪朋，安貞吉。\n《彖》曰：至哉坤元，萬物資生，乃順承天。坤厚載物，德合无疆，含弘光大，品物咸亨。牝馬地類，行地无疆，柔順利貞。君子攸行，先迷失道，後順得常。西南得朋，乃與類行，東北喪朋，乃終有慶。安貞之吉，應地无疆。\n《象》曰：地勢坤，君子以厚德載物。\n\n坤，匯聚了良好之條件，宜於效法母馬的堅定美德。君子要遠行，求快而走在前頭則會迷路，若跟隨於人後則可以因此得到主人指引之利。往西南方會得到錢財或志同道合的朋友，往東北則會遺失錢財或失去朋友，安定則吉。\n\n【卦旨】坤順也，此卦為《周易》六十四卦之次，卦體以地為象，厚德載物，其性質為柔順，揭示陰柔之氣與乾卦所代表的陽剛之氣既相對立、又相依存的關係；同時，強調陰柔在依順、配合陽剛，促進事物生成、發展的過程中所產生的重要作用。坤卦緊隨乾卦之後，正是體現天尊地卑、陰陽和合的意旨。陰為小，附合服從之象"
    },
    "yaoInterpretation": {
      "初六":"初六，履霜，堅冰至。\n《象》曰：履霜堅冰，陰始凝也。馴致其道，至堅冰也。\n\n腳下踩著秋霜，顯示寒冬已近，將會結成堅硬的冰。霜為秋天之象，堅冰為嚴冬之象。腳踩秋天的霜就知道寒氣已在凝聚，嚴冬即將來臨。比喻凡事順勢而為，則可長久而堅定，積久而日漸成功。另一解讀為，告戒君子要防微杜漸，見微知著。",
      "六二":"六二，直方大，不習无不利。\n《象》曰：六二之動，直以方也。不習无不利，地道光也。\n\n正直、方正，而大度能容，天生有此德，不待學習，無所不利。性情柔順，而能守中庸之道，具有正直、方正，而大度的美德。",
      "六三":"六三，含章可貞，或從王事，无成有終。\n《象》曰：含章可貞，以時發也；或從王事，知光大也。\n\n修養而具備內在美德以此安定自守，或者也可以選擇跟隨於權貴做事，雖不能有所成就但也可以有好的結局。",
      "六四":"六四，括囊，无咎无譽。\n《象》曰：括囊无咎，慎不害也。\n\n將袋口綁緊，比喻人應當謹言慎行，以求得沒有罪咎。六四為近於君位的多憂之地，因此只能戰戰競競，謹慎小心，以求得不犯錯，不要希求會得到任何的讚賞。",
      "六五":"六五，黃裳，元吉。\n《象》曰：黃裳元吉，文在中也。\n\n黃色下裙，大吉。黃為中色，裳為下飾。黃裳比喻性情柔順而中庸。六五柔中，又處尊位，有美德而自然能表現於外。此似於六三「含章之美」。",
      "上六":"上六，龍戰于野，其血玄黃。\n《象》曰：龍戰于野，其道窮也。\n\n龍在野外打鬥相爭不下，兩敗俱傷，流出的血與泥土相混雜而成玄黃色。\n玄黃是天地混雜的顏色，因上位是天位。坤為地，因此上六為天地相混之爻。坤陰至極則傷陽而戰。此比喻人未能一開始就辨明正邪，剛愎自用，最終陰氣與疑心致極而引發爭端。另一比喻為小人居君子位，為惡多端，最終事態敗露而引來災難，窮途而沒路，故《象傳》說「其道窮也」。此象有血光之災。",
      "用六":"用六，利永貞。\n《象》曰：用六永貞，以大終也。\n\n宜於永遠貞定。問筮得坤卦六爻皆六，也就是「坤之乾」，則以「用六」為占驗。用六也是六個陰爻全部都變陽爻，符合陰隨陽，及坤卦堅持到底的德性。因此利永貞。用九為群龍無首之象，用六則是從一而終，專一堅定到底，蓋因坤陰之美德在於「貞」，因此用六曰「永貞」，為能永遠謹守貞正之美德者。"
    }
  },
  "010001": {
    "name": "屯",
    "pinyin": "zhūn",
    "summary": "雲雷屯，雷雨交加，險象叢生。(凶)",
    "detailed": "屯卦象徵初始階段的艱難，如雷在雲中孕育。君子應以智慧和謀略，克服困難，開創未來。屯卦代表｢困難｣，但不代表失敗。如果能夠屯積實力，走過｢凡事起頭難｣的階段，未來仍是無可限量。",
    "explanations": {
      "運勢": "運勢多有阻礙，宜謹慎行事，耐心等待時機。",
      "感情": "艱難的開始。感情關係可能遇到波折，需多溝通，增進了解。",
      "財運": "財運不穩，投資需謹慎，避免衝動決策。",
      "工作": "工作上可能面臨挑戰，宜冷靜應對，尋求解決方案。應多注重自己實力的培養，基礎的奠定。",
      "買賣": "交易可能遇到困難，宜觀望市場，謹慎行事。",
      "考試": "考試運一般，需加倍努力，方能取得理想成績。",
      "健康": "健康需注意，可能有小病痛，宜及時就醫。",
      "訴訟": "訴訟進展不順，宜尋求專業意見，謹慎應對。",
      "尋人": "尋人可能有困難，需擴大搜尋範圍。",
      "尋物": "尋物不易，可能需要花費時間。",
      "旅行": "旅行計劃可能受阻，宜做好充分準備。",
      "人際": "人際關係需謹慎處理，避免誤解與衝突。",
      "卦辭": "屯，元亨利貞，勿用有攸往，利建侯。\n《彖》曰：屯，剛柔始交而難生，動乎險中，大亨貞。雷雨之動滿盈，天造草昧，宜建侯而不寧。\n《象》曰：雲雷屯，君子以經綸。\n\n駐留在原地，匯聚了許多良好條件，宜於堅定守正。不要有遠行，利於建立諸侯。建立諸侯比喻設立防禦之屏障，或布局人事。坎險在外可取象溝瀆，以溝瀆為天險，有防禦之效。屯卦策略為留在原地，屯兵駐留，若行動則坎變成危險，若只是留在原地則坎成保護之天險。\n\n【卦旨】屯為初生的草木，其性質為艱難。揭示事物處於草創，初生階段的艱難情狀，但同時也認為，創業雖難，低要積聚力量、謹慎行事，遵循正確的道路，就可以逐漸變若為強，爭取到光輝的前景。"
    },
    "yaoInterpretation": {
      "初九":"初九，磐桓，利居貞，利建侯。\n《象》曰：雖磐桓，志行正也。以貴下賤，大得民也。\n\n有磐石及大柱，根基及基礎非常穩固，宜於貞定，利於建立諸侯。這一爻為屯卦最開始的時候，此時正是建立根本，穩定基礎的時機。震為動，動處於內而不進，外有坎，互卦有艮，為動而不進之象。故曰磐桓，利居貞。",
      "六二":"六二，屯如邅如，乘馬班如。匪寇婚媾，女子貞不字，十年乃字。\n《象》曰：六二之難，乘剛也。十年乃字，反常也。\n\n此段言求婚過程的艱難，因此有乘馬分開之象。女子起初可能因為被逼婚、搶婚之故，所以不答應婚媾，因此「貞不字」，堅定守貞不生小孩。要等待十年之久，關係回復到正常而接納對方之後，才終於答應。「十年乃字」的十年比喻事情之艱難與需要長久的等待與經營。而前面之乘馬則隱喻「馬上」求成的急切。屯難之世，凡事當耐心經營，而不當急躁如匪寇。六二乘陽，又居互體艮下，艱難而無法前進之象。虞翻曰：「震為馬作足，二乘初，故乘馬。」",
      "六三":"六三，即鹿无虞，惟入于林中。君子幾，不如舍，往吝。\n《象》曰：即鹿无虞，以從禽也。君子舍之，往吝窮也。\n\n到山林裡打獵，沒有守山林的人帶路就貿然進入，其危險可知。最好能知難而退。若一意前往，將自取其咎。六三處下體震之上，互體艮之中，艮為山為麓，有入於林中之象。又艮山止之，有舍止之象。三多凶，六三不當位，以柔處屯難之世，又居危險之位。與其追逐，不如捨棄。《象曰》：「往吝，窮也。」追逐為有吝，因為這是窮困之道。",
      "六四":"六四，乘馬班如，求婚媾。往吉，无不利。\n《象》曰：求而往，明也。\n\n騎著馬在原地打轉，想要求婚合。前往則吉，無所不利。六四柔居陰位為當位，下與初九相應，上承九五。屯難之世，柔需剛助，六四雖處多懼之位（因多懼所以班如），但能得兩陽剛之助，所以有功，故「吉無不利」。《象傳》曰：「求而往，明也。」因六四可得九五比應之陽明。",
      "九五":"九五，屯其膏，小貞吉，大貞凶。\n《象》曰：屯其膏，施未光也。\n\n屯積美食自己享用，問小事吉，若是問大事則凶。九五為陽剛居中之君位，五本是多功之位，但屯九五溺於私欲，所以只能做小事，無法做大事。",
      "上六":"上六，乘馬班如，泣血漣如。\n《象》曰：泣血漣如，何可長也。\n\n。身處危險，本身既無能力應付，又無救兵可幫忙，只能騎著馬在原地打轉乾著急。屯難之世原本只有陽剛之君子可以救濟危難，上六居坎卦之極端，又乘陽，因此完全沒有人可以協助幫忙。坎為血，又為水，為加憂，故曰泣血漣如。《九家易》：「體坎為血，伏離為目，互艮為手，掩目流血，泣之象也。」"
    }
  },
  "100010": {
    "name": "蒙",
    "pinyin": "méng",
    "summary": "山水蒙，山下出泉，蒙以養正。(中吉)",
    "detailed": "蒙卦象徵啟蒙，如山下湧出泉水，初生而未成熟。君子應以正確的引導，培養未成熟的事物，使其成長。能力不足以處理危機，最好的策略是向有經驗與智慧的人請益。但請益之前請先做好準備，誠心前往，避免繁鎖而一問再問的情況。",
    "explanations": {
      "運勢": "運勢處於起步階段，需謹慎學習，積累經驗。面對危險應當停下來靜觀其變，求教於有智慧、有經驗者則是最好的策略。",
      "感情": "感情關係尚未成熟，需耐心培養，增進了解。",
      "財運": "財運初現，宜小心謹慎，避免貪功冒進。",
      "工作": "工作處於學習階段，需虛心請教，積累知識。",
      "買賣": "交易需謹慎，宜多了解市場資訊，避免損失。",
      "考試": "考試運一般，需加強學習，充實自己。",
      "健康": "健康狀況平穩，宜保持良好生活習慣。",
      "訴訟": "訴訟進展緩慢，需耐心等待，尋求專業意見。",
      "尋人": "尋人可能有困難，需多方打聽，耐心尋找。",
      "尋物": "尋物需耐心，可能需要時間。",
      "旅行": "旅行計劃需詳細規劃，避免意外。",
      "人際": "人際關係需真誠待人，避免誤解。求問於人則應當誠心，避免繁鎖而亂問",
      "卦辭": "蒙，亨，匪我求童蒙，童蒙求我。初筮告，再三瀆，瀆則不告，利貞。\n《彖》曰：蒙，山下有險，險而止，蒙。蒙，亨，以亨行，時中也。匪我求童蒙，童蒙求我，志應也。初筮告，以剛中也。再三瀆，瀆則不告，瀆蒙也。蒙以養正，聖功也。\n《象》曰：山下出泉，蒙，君子以果行育德。\n\n蒙昧不懂事，良好的匯聚。不是我去求童蒙之人，而是童蒙不懂事的人來求我。第一次的筮問會告訴你答案，同一件事再有第二次、第三次的筮問，那麼就是褻瀆，褻瀆則不會告訴你答案了。利於貞定。\n\n【卦旨】蒙為蒙昧幼稚，並非貶低，旨在從「教」與「學」兩方面，揭示如何消除蒙味，受教養成，開啟智力、進行教化的道理。其中的某些觀點，成為古代教育思想與教學原則的重要淵源。"
    },
    "yaoInterpretation": {
      "初六":"初六，發蒙，利用刑人，用說桎梏，以往吝。\n《象》曰：利用刑人，以正法也。\n\n啟發蒙昧，宜於用刑罰之官來嚴懲，但也當適時脫去桎梏。若一味以刑罰直往而行，將有恨惜。桎梏為刑具，比喻人之蒙昧。用脫桎梏，比喻人之脫蒙。另一說則主張當用刑罰。以草昧而民智未開之時，就應當嚴加治理，切忌姑息養奸，宜於使用刑罰作為警戒。如果這時縱容罪犯，任其發展，則未來會有吝。",
      "九二":"九二，包蒙，吉。納婦吉，子克家。\n《象》曰：子克家，剛柔接也。\n\n具有包容及中庸之美德。問婚姻大吉，適於娶媳婦。有能幹的兒子能夠幫助持家。九二下卦坎中，剛中而應於六五，為蒙卦主爻。蒙卦諸陰爻為有待啟發的童蒙，九二則是啟發童蒙者，童蒙所求教者。剛中而居下，變而成坤，坤地為包容、廣生，因此為動而能有容之象。與六五應，故納婦吉。剛中，故克家。",
      "六三":"六三，勿用取女，見金夫，不有躬，无攸利\n《象》曰：勿用取女，行不順也。\n\n象曰「行不順也」意指女子行為不端正，所以不要娶女。不順指的是六三乘九二。六三失位，乘九二又與上九相應，為近逆而遠應，女子不安於室。",
      "六四":"六四，困蒙，吝。\n《象》曰：困蒙之吝，獨遠實也。\n\n受困於蒙昧，有吝。四為多懼多凶之位，又互體為坤，四居坤之中，為蒙昧小人為伍而遠君子之象。陽代表光明與君子、大人，是能夠啟發與救濟童蒙者，蒙卦四個陰爻唯獨四與陽爻無所接觸，亦無比應，因此稱「困蒙」。象曰：「困蒙之吝，獨遠實也。」唯獨六四遠離君子。實，即陽。",
      "六五":"六五，童蒙，吉。\n《象》曰：童蒙之吉，順以巽也。\n\n由於能保有赤子之心，純真而自然，雖蒙昧，但吉人自有天相，傻人有傻福。六五以柔處中，下與九二相應，上承上九，變而上卦成巽，巽為謙遜之象，又居互體坤卦之中，故象曰：「童蒙之吉，順以巽也。」處蒙之時，具有柔順中庸而卑下之德性，能夠為兩個陽九所救濟，是童蒙之吉者。",
      "上九":"上九，擊蒙。不利為寇，利禦寇。\n《象》曰：利用禦寇，上下順也。\n\n打擊童蒙，但不宜當盜賊做不義事，宜於抵禦盜賊。上九已經是蒙卦最後階段，應該走出無知蒙昧，打破童蒙的無知，一切應化為主動。但不能當盜賊去做不義之事，反而應該積極打擊不義之徒。又上九為陽剛，因此具有打擊童蒙之力。"
    }
  },
  "010111": {
    "name": "需",
    "pinyin": "xū",
    "summary": "水天需，雲上於天，守正待機。(中吉)",
    "detailed": "需卦象徵等待時機，如天上之水尚未降落，需要耐心等待機會成熟，方能順勢而為。需卦是藏有危機的一卦，雖然你的能力足以化險為夷，但仍不宜妄動，靜待佳機才是比較好的策略。",
    "explanations": {
      "運勢": "運勢尚可，需耐心等待機會，不可急於求成。",
      "感情": "感情需時間培養，勿急躁，真誠相待。",
      "財運": "財運平穩，投資需審慎評估後再行動。",
      "工作": "工作中需耐心，等待時機展現才能。",
      "買賣": "交易需等待合適時機，不宜急躁。",
      "考試": "考試成績平穩，需持之以恆。",
      "健康": "健康狀況良好，但需保持耐心調理。",
      "訴訟": "訴訟過程可能拖延，需有耐心處理。",
      "尋人": "尋人進展稍慢，對方可能正在移動。",
      "尋物": "尋物需耐心尋找，物品尚未顯現蹤跡。",
      "旅行": "旅行適合，但需事先計劃，避免突發狀況。",
      "人際": "人際關係需耐心經營，貴人運較好。",
      "卦辭": "需，有孚，光亨，貞吉，利涉大川。\n《彖》曰：需，須也，險在前也。剛健而不陷，其義不困窮矣。需，有孚，光亨，貞吉，位乎天位，以正中也。利涉大川，往有功也。\n《象》曰：雲上於天，需，君子以飲食宴樂。\n\n等待，有誠信則能夠光明而嘉會。貞定為吉，亦宜於涉大川。需卦乾陽在內，坎險在外，可靜可動。貞定則有利而吉，但亦可涉大川，因此卦辭說「貞吉」又說「剛健而不陷」、「利涉大川」。乾為光，故曰光亨。處需之時，誠信為上，有誠信則可光耀四方而嘉會，無誠信則否。\n\n【卦旨】需為等待，揭示任何事物的發展都有一個過程，須耐心等待時機，適時而動的道理。如水在天上，水氣畜積、儲存能量，再待機而動。"
    },
    "yaoInterpretation": {
      "初九":"初九，需于郊，利用恒，无咎。\n《象》曰：需于郊，不犯難行也。利用恒，无咎，未失常也。\n\n滯留於郊外，宜有恒心，沒有罪咎。雖然眼前有危險，但若懂得耐心等待，不強行冒險，與危險保持安全距離，就可免於罪咎。本就六爻卦位來說，郊應該在五或上爻。此初九言郊者，因坎在外，初九距坎最遠。此言乾陽「涉大川」的邊進邊等的過程，初九至九三以距坎險之距離而言「郊」、「沙」、「泥」。郊外離坎險很遠，宜於有耐心，故曰「利用恒」。又初九爻變，下卦成巽，巽為漸進，為進退，為不果，初九若動又有進退不果之象，不宜妄動。",
      "九二":"九二，需于沙，小有言，終吉。\n《象》曰：需于沙，衍在中也，雖小有言，以吉終也\n\n滯留於水邊的沙地。初至三為乾陽邊等待，邊視情況而前進的過程。初九距坎險遠而說需於郊，九二離水邊較近，已至河邊的沙地。九二居互體兌之下，兌為口，向下毀折，受言語中傷。九二變為離，成黃離之中，為元吉，故曰終吉。",
      "九三":"九三，需于泥，致寇至。\n《象》曰：需于泥，災在外也。自我致寇，敬慎不敗也。\n\n九三距離水險最近，九二還在沙岸邊，再進一步就準備要涉水，九三則已踩進水邊的爛泥，為爛泥所困。災在外意指坎險在外，坎為災。自我致寇，因為自己讓自己身陷險地，自曝弱點，而引來了盜賊。敬慎不敗，乾陽為大，足以禦寇，只要謹慎小心就不會失敗，可以逐退盜賊。九三近逼坎險，坎為盜，又居互卦離之下，兌之中，離為戈兵，兌為毀折，因此有致寇之象。",
      "六四":"六四，需于血，出自穴。\n《象》曰：需于血，順以聽也。\n\n滯留於溝瀆之中，等敵寇離開之後，離開所躲藏的洞穴。另一解釋為，浴血奮戰（血喻受傷、處於險境），從洞穴中逃出。六四已進入坎險之地，「濡於血」被血所沾濕，浴血之義；或滯留於血（洫）裡。血傳統講法認為是流血的血，比喻進入危險之地，因坎為血象。坎也可為溝瀆，需於血也可解釋為滯留於溝瀆，避難的意思。《象傳》說「需于血，順以聽也」，因此以躲於溝瀆的解釋最為符合。",
      "九五":"九五，需于酒食，貞吉。\n《象》曰：酒食貞吉，以中正也。\n\n滯留於酒食，享受酒食，貞定為吉。雖然身處險中，但九五剛中，所以能夠享受酒食宴樂。《象傳》說：「需，君子以飲食宴樂。」《序卦》說：「需者飲食之道也。」九五爻是需卦的主爻，也是需卦卦義的核心，所以九五爻「需於酒食」呼應了《象傳》「君子以飲食宴樂」及《序卦》「需者飲食之道也。」",
      "上六":"上六，入于穴，有不速之客三人來，敬之終吉。\n《象》曰：不速之客來，敬之終吉，雖不當位，未大失也。\n\n進入洞穴之中，有不請自來的客人來，禮敬他們，最後則吉。尊敬。亦可解釋為警戒。"
    }
  },
  "111010": {
    "name": "訟",
    "pinyin": "sòng",
    "summary": "天水訟，天水違行，不宜爭訟。(小凶)",
    "detailed": "訟卦象徵爭論、糾紛，宜和解而非爭鬥。當遇到矛盾時，應以理性和耐心解決，而非激化衝突。注意福禍相倚，得未必是福，失未必是禍。你的堅持是很危險的，凡事不要走極端，不要頑強固執。能夠放棄爭訟則吉，平安是福；若是一意爭取到底，既使贏了也會召來後續的禍害。",
    "explanations": {
      "運勢": "運勢受阻，易遇口舌之爭，宜保持冷靜。",
      "感情": "感情中可能有爭執，需耐心溝通，避免誤會。",
      "財運": "財運不穩，投資需謹慎，避免與人發生財務糾紛。",
      "工作": "工作上可能遇到競爭與爭執，需理性處理。",
      "買賣": "交易過程可能發生爭議，宜小心談判。",
      "考試": "考試成績可能受到心態影響，需調整心境。",
      "健康": "健康需注意，可能因壓力影響身體狀況。",
      "訴訟": "訴訟案件可能拖延，建議和解為佳。",
      "尋人": "尋人過程可能遇到阻礙，需尋求更多線索。",
      "尋物": "尋物可能因爭議而難以尋回。",
      "旅行": "旅行中可能遇到意外糾紛，需多加小心。",
      "人際": "人際關係易發生衝突，宜多忍讓。",
      "卦辭": "訟，有孚窒惕中吉，終凶。利見大人，不利涉大川。\n《彖》曰：訟，上剛下險，險而健，訟。訟有孚窒惕中吉，剛來而得中也。終凶，訟不可成也。利見大人，尚中正也。不利涉大川，入于淵也。\n《象》曰：天與水違行，訟。君子以作事謀始。\n\n訴訟，有誠信，鬱悶而恐懼，中庸則吉，讓訴訟走到底則凶。利於拜見大人，不利於涉險過大川。訟卦坎水在內為憂心之象，故曰窒惕。乾陽往居在外，坎險在內，故不利涉大川，不宜冒險行事。\n\n【卦旨】訟義為爭訟，揭示爭勝必須加以控制，如果爭訟不已，必將導致不利結局的道理。如同水在天下，水患起、麻煩至，平息爭端為貴，本卦反映了避免爭訟，以和為貴的思想。"
    },
    "yaoInterpretation": {
      "初六":"初六，不永所事，小有言，終吉。\n《象》曰：不永所事，訟不可長也。雖小有言，其辯明也。\n\n不讓事情長久持續，雖然有些輕微的言語中傷，最終為吉。初六為訟卦的開始，也是爭訟的最早階段。能夠在一開始就知道爭訟並不是什麼好事，所以不會因為堅持而讓爭訟持久下去。因為不堅持，所以最後為吉。",
      "九二":"九二，不克訟，歸而逋其邑，人三百戶，无眚。\n《象》曰：不克訟，歸逋，竄也。自下訟上，患至掇也。\n\n訴訟輸了，因此逃回自己的城邑，城邑人口雖然只有三百戶之多，但足以提供保護而免於禍害。災指天災，眚則是人禍。現今則通稱災禍。",
      "六三":"六三，食舊德，貞厲，終吉。或從王事，无成。\n《象》曰：食舊德，從上吉也。\n\n靠舊有的祿位供養度日，堅定而艱困，最終為吉。或者能夠為上位者做事，但無法有所成就。",
      "九四":"九四，不克訟，復即命，渝，安貞，吉。\n《象》曰：復即命，渝，安貞，不失也。\n\n訴訟失敗，回去即聽從命令，允諾遵守命令，安定守正則吉。",
      "九五":"九五，訟，元吉。\n《象》曰：訟元吉，以中正也。\n\n訴訟，大善而吉。九二處下卦坎中，為興訟的成卦主爻。與其對應的九五居天尊之位，具中正之德，為裁決訴訟的治卦主爻。中正象徵的是公正而不偏袒，此為決訟者之大善。「訟，元吉」，意指訴訟要能大善而得吉，並非教人訴訟可得大吉。",
      "上九":"上九，或錫之鞶帶，終朝三褫之。\n《象》曰：以訟受服，亦不足敬也。\n\n官司最後雖然獲勝，並因此而得到許多好處，然而也因此敗德。這種好處是無法持久的，接下來會失去的恐怕比得到的還要多。上九居訟卦最上，以陽居陰，不當位。雖為最後勝利者，但爭訟非正道，所得不可久，所以才一個早上的時間所得到的鞶帶就三度被剝奪。《象》曰：「以訟受服，亦不足敬也。」以爭訟而受贈的官位，完全無法讓人所敬重。"
    }
  },
  "000010": {
    "name": "師",
    "pinyin": "shī",
    "summary": "地水師，地中有水，行軍有序。(中吉)",
    "detailed": "師卦象徵組織與紀律，如軍隊行軍必須有序而穩重。君子應以嚴謹態度處理事務，穩步前行。帶兵打仗首先要師出有名，其次用人則是要找老成持重，有豐富疆場經驗者為宜。無經驗者絕不可用。",
    "explanations": {
      "運勢": "運勢尚可，需講求策略與紀律，步步為營。責任重大，憂慮很深。對事情經驗豐富者為吉。沒經驗者為凶。",
      "感情": "異性關係複雜，難以處理而爭吵。",
      "財運": "財運良好，宜穩健經營，勿躁進。",
      "工作": "工作中需注重團隊協作，組織有序。責任重大，很具挑戰性。無經驗勿試。",
      "買賣": "交易需有計畫，不宜衝動決策。",
      "考試": "考試需用心準備，穩扎穩打可獲佳績。",
      "健康": "健康狀況良好，但需防止過勞。",
      "訴訟": "訴訟需有策略，理性處理可望勝訴。",
      "尋人": "尋人需依照線索穩步尋找，終將找到。",
      "尋物": "尋物需有耐心，按規律推敲可得。",
      "旅行": "旅行計畫宜周詳多慮，避免突發狀況。",
      "人際": "人際關係穩定，與人合作可獲佳績。",
      "卦辭": "師貞，丈人吉，无咎。\n《彖》曰：師眾也，貞正也，能以眾正，可以王矣。剛中而應，行險而順，以此毒天下，而民從之，吉又何咎矣。\n《象》曰：地中有水，師，君子以容民畜眾。\n\n出師有名，以老成而有智慧、謀略的長者領軍，吉而沒有罪咎。《彖》：「師眾也，貞正也。能以眾正，可以王矣。」出師討伐，目的在於以群眾暴力糾正他人之行為，因此要師出以正，即師出有名。「師貞丈人吉」也可讀為「師，貞丈人吉」，貞解釋作問卜，引申為問。貞丈人吉，問丈人則吉。\n\n【卦旨】此卦揭示陰氣消退,陽剛正氣逐漸回復，此乃天地生生不已的必然規律，吿誡君子應當復善趨仁、堅持正道，不可迷入歧途的道理，師也代表「眾」，聚眾需有所統籌並重視紀律才不會散人才、人脈。"
    },
    "yaoInterpretation": {
      "初六":"初六，師出以律，否臧凶。\n《象》曰：師出以律，失律凶也。\n\n軍隊出征一定要有良好的紀律，軍法要森嚴。反之，如果散亂而無紀律將會大凶。《象》曰「師出以律，失律凶也」，「否臧」即「失律」，失去紀律則凶，呼應前「師出以律」。",
      "九二":"九二，在師中，吉，无咎，王三錫命。\n《象》曰：在師中吉，承天寵也；王三錫命，懷萬邦也。\n\n在軍隊之中，吉，沒有罪咎。不斷受到上位者重用。九二為師卦的主爻，也是師卦軍隊中帶兵的將帥。陰為眾，九二陽剛之臣（武臣）在下卦之中與六五之君相應，為將帥受命，親臨軍隊之中。王三賜命，言將帥受到厚愛而身負重任，且不斷受到君王的重用，所以一直下命令於他。九二爻動下卦成坤為順，將帥動而能順從君命之象，故「王三賜命」。",
      "六三":"六三，師或輿尸，凶。\n《象》曰：師或輿尸，大无功也。\n\n軍隊可能載著神主牌，凶。輿，車子、運載。尸，古代的神主牌。載屍而歸，大凶之象。六三失位，處於多憂之地，又乘九二之主帥，為失律之象。師出以律則吉，失律則凶。六三居於互體震卦之中，動則互體成兌，兌為毀折。另一解釋為軍隊號令不統一，因此為凶。或，或然之辭，類似於我們當今說的｢可能｣。",
      "六四":"六四，師左次，无咎。\n《象》曰：左次无咎，未失常也。\n\n因應情勢而暫時退避，以保存實力，這是兵家之常事，即使無法得勝，但可免於失敗的罪咎。六四為多懼之位，居互體坤卦之中，動而互體成坎有難，貞而不動則為坤有土。因此左次可得無咎。反之，躁動則有咎。",
      "六五":"六五，田有禽，利執言，无咎。長子帥師，弟子輿尸，貞凶。\n《象》曰：長子帥師，以中行也；弟子輿尸，使不當也。\n\n畋獵有獲得，宜於將捕捉到的敵人抓來拷問，沒有罪咎。由長子帥領軍隊，年輕弟子載運神主牌。堅持則凶。師比兩卦第五爻皆曰田獵之事，師卦言「執」，而比顯比言「失前禽」。師是攻伐不從者，故必執之。而比則是親附之道，乃欲擒故縱之術，故曰「失前禽」。",
      "上六":"上六，大君有命，開國承家，小人勿用。\n《象》曰：大君有命，以正功也；小人勿用，必亂邦也。\n\n天子承受天命，國家建立，分封諸侯。但小人不宜任用。戰爭結束，開始論功行賞，開國寧邦，分封諸侯。然而對於小人只可以施與錢財的獎賞，絕不可授與官爵，否則將危害國家安定。"
    }
  },
  "010000": {
    "name": "比",
    "pinyin": "bǐ",
    "summary": "水地比，地上有水，親近和合。(大吉)",
    "detailed": "比卦象徵親近與和諧，如水匯聚於地而互相依存。君子應與人和睦相處，誠信合作。比道貴在能夠發自內心的積極，表現在外的則是當仁不讓，不落人後。只要積極表現出你的誠意，就能受到青睞。",
    "explanations": {
      "運勢": "積極努力經營好下對上的關係則吉；無法經營這層關係者，則凶。但普遍運勢良好，貴人運旺，宜結交良師益友。",
      "感情": "積極討好對方，不可怠慢。便能感情和諧美滿，雙方關係穩固。",
      "財運": "財運旺盛，適合合作投資，互惠互利。",
      "工作": "應該積極努力經營好上下屬之間的關係。工作中有助力，團隊合作帶來成功。",
      "買賣": "交易順利，合夥經營可帶來豐厚回報。",
      "考試": "考試有貴人相助，成績提升顯著。",
      "健康": "健康狀況良好，適合與人共修養生之道。",
      "訴訟": "訴訟可和平解決，宜尋求調解方案。",
      "尋人": "尋人順利，對方與你有深厚關聯。",
      "尋物": "尋物容易找到，可能因人際關係獲得幫助。",
      "旅行": "旅行適合與親朋同行，增進情誼。",
      "人際": "人際關係和諧，適合結交志同道合之人。",
      "卦辭": "比，吉，原筮元永貞，无咎。不寧方來，後夫凶。\n《彖》曰：比，吉也。比，輔也，下順從也。原筮元永貞，无咎，以剛中也。不寧方來，上下應也。後夫凶，其道窮也。\n《象》曰：地上有水，比。先王以建萬國，親諸侯。\n\n親比則吉。原田之象的問筮結果，大善而長久堅定，不會有罪咎。動亂不安的方國也都歸順而來，最後遲遲不來者，大凶。比卦為比附、親近之義，比附的是上面的九五之君。比道應該主動而迅速，當仁不讓；落後者則大禍臨身，故凶。\n\n【卦旨】比義為親比，揭示上下之間、彼此之間應當親密相依、友好相處的道理，但同時也反對無原則、無選擇的親比。其中特別強調下對上的親附與順從，反映了古代以尊卑長幼為出發點的倫理原則。"
    },
    "yaoInterpretation": {
      "初六":"初六，有孚比之，无咎；有孚盈缶，終來有它吉。\n《象》曰：比之初六，有它吉也。\n\n以誠信前去親比，沒有罪咎。誠意有如盛滿瓶的水，最後自然會有意外的吉利之事。初六毫無相應之爻，與九五之君更完全沒有關聯，因此就身份來說完全沒有什麼親比的正當性。但因為比道貴早、貴快，初六是比卦的第一爻，誠意很夠，爻動下卦成震，為前行之象，以最積極而迅速的態度及足夠的誠意前往，感動人心。最終會有意外的好事。但反之，若誠信不足，那麼反為凶咎。",
      "六二":"六二，比之自內，貞吉。\n《象》曰：比之自內，不自失也。\n\n以自己內在的涵養而去親比，守正為吉。六二得位，柔而處坤體之中，又與九五相應，因此是最具臣道的一爻。六二是因為本身的涵養，以及優越的才能，而自然得到上面的賞識，所以是以內在美而和上面產生了親近的關係，與其他爻必需努力爭取的處境完全不一樣。所以象曰：「比之自內，不自失也。」",
      "六三":"六三，比之匪人。\n《象》曰：比之匪人，不亦傷乎。\n\n親比錯人，親近到的是沒有實權的人。與小人為伍，結交的盡是損友。六三以陰居陽不當位，前後與眾陰比鄰相繫，三又是多凶之地，再加諸外卦中所對應的為上六，上六不但與六三不相應，而且高而無位，並不是該親比的對象。六爻中唯有九五才是眾陰應當親近者。因此六三處境，是完全奉承錯人。爻辭沒有說吉凶，但象傳說：「比之匪人，不亦傷乎！」吉凶不言而喻。",
      "六四":"六四，外比之，貞吉。\n《象》曰：外比於賢，以從上也。\n\n向外親比，貞定則吉。六四以柔居柔，當位。又四為近君之地，雖然對內與初六不相應，但比道應當向九五靠攏，雖然六二為九五之正應，但六四具有「近水樓台」之優勢，與九五相鄰，且以柔承順於剛，比鄰而應，因此是能夠輔佐九五的良臣，亦得九五之心。",
      "九五":"九五，顯比，王用三驅，失前禽。邑人不誡，吉。\n《象》曰：顯比之吉，位正中也；舍逆取順，失前禽也；邑人不誡，上使中也。\n\n王者之親比，極其顯耀。以三驅的畋獵之禮彰顯比道，跑在前面對著君王而來的都放走而不射殺。邑中百姓可以安心而不需防備，吉。這一爻所表現的是王者的比道，公正無私、光明正大的親近關係。而能彰顯君王比道的，莫如畋獵時所用的三驅之禮。",
      "上六":"上六，比之无首，凶。\n《象》曰：比之无首，无所終也。\n\n親比而沒有首領，凶。就時間順序來說，初爻為始，上爻為後。初至四爻皆已比附於九五（象徵國君、大人），唯獨上六居於最後，且凌駕於九五之上，為遲遲而未能歸順者，即「後夫凶」所說的「後夫」。又上六高而無位，以陰柔居頂，陰乘陽為逆，且乘駕的又是九五之主爻。完全背離親比之道，大凶。就卦象來說，上六爻靜而不動則處坎險之極，動則成巽為不果，因此已是身陷險境而難以自拔之象。"
    }
  },
  "110111": {
    "name": "小畜",
    "pinyin": "xiǎo chù",
    "summary": "風天小畜，風行天上，積少成多。(小吉)",
    "detailed": "小畜卦象徵積少成多，如風吹雲聚但未降雨，表示尚需積累與等待。君子應勤奮努力，逐步積累成就。未來充滿不確定，當今之計可以退守，放下遠大的目標，活在當下，選擇眼前立即就可達成的小目標。",
    "explanations": {
      "運勢": "小事可以亨通，大事凶。凡事充滿疑雲，不確定感。運勢漸佳，需耐心積累，不宜急進。",
      "感情": "為對方所苦；暫不得志。感情需細水長流，勿急於求成。",
      "財運": "財運尚可，宜穩健理財，細水長流。",
      "工作": "懷才不遇，前途不明。工作需穩紮穩打，不宜急於求成。",
      "買賣": "交易漸趨穩定，累積信譽有助長遠發展。",
      "考試": "考試運普通，需持續努力。",
      "健康": "健康尚可，但需注意積累小病成大病。",
      "訴訟": "訴訟宜低調處理，避免拖延過久。",
      "尋人": "尋人需耐心，對方可能因某事受阻。",
      "尋物": "尋物進度緩慢，需持續努力。",
      "旅行": "旅行需做好準備，途中可能遇小阻礙。可出行，但不利出遠門。",
      "人際": "人際關係需細心經營，積累信任。",
      "卦辭": "小畜，亨，密雲不雨，自我西郊。\n《彖》曰：小畜，柔得位而上下應之，曰小畜。健而巽，剛中而志行，乃亨。密雲不雨，尚往也；自我西郊，施未行也。\n《象》曰：風行天上，小畜，君子以懿文德。\n\n小積畜，匯聚良好之條件。雖然雲層很厚，但卻遲遲不下雨，雲從我家鄉西邊的郊區聚集而來。密雲不雨比喻心中充滿疑惑、擔憂很深，擔憂的是家鄉事。西為周之發源地，因此西郊比喻家鄉。小畜全文以「復」（回家）為主軸，由此可證「密雲不雨，自我西郊」講的乃是心繫家鄉有事而急欲回鄉之事。雨在《周易》中又象徵乾陽之作用，此乾卦《彖傳》所說的「雲行雨施，品物流形」，益卦說的「天施地生」。乾道主施，坤道主生，雨則是象徵乾坤造物，傳統儒者視其為陰陽和合。「密雲」則是雨未施之時，象徵天德未行，大道未通。\n\n【卦旨】小畜是小有畜養，揭示事物發展過程中，處於輔助、低下的一方，應在一定範圍之內，對處於長上一方，應予協助，畜養的道理。小畜以陰畜陽蓄積程度小，又稱小畜，從蓄積的內容看為畜積物質財富，對比大畜以陽畜陽蓄積程度大，而大畜則是畜積道德與人才。"
    },
    "yaoInterpretation": {
      "初九":"初九，復自道，何其咎？吉。\n《象》曰：復自道，其義吉也。\n\n走大道回家。回歸正途，走自己的路，有什麼罪咎可言？吉。復為回家。小畜卦六爻以「復」為主軸，為什麼？乾與坤旁通至屯與家人過程當中，先是陽復（復卦）與陰畜（小畜）。就乾元來說，九四至坤體成復，因陽爻生於初，為陽元復反坤體大地之下。但坤初上行至乾體之四，成小畜，為坤元畜止於乾體之中，坤元迷途，因此需找到回家的路。當復五至小畜二之後小畜成家人而「男女正」、「家道正」，即回到家。這也是坤卦講的「先迷後得」。",
      "九二":"九二，牽復，吉。\n《象》曰：牽復在中，亦不自失也。\n\n牽引而回家，吉。比喻君子能夠攜手相助，不為小人所制，因此為吉。",
      "九三":"九三，輿說輻，夫妻反目。\n《象》曰：夫妻反目，不能正室也。\n\n用來固定車輪軸的革繩或伏兔脫落，夫妻兩人反目成仇。三為多凶之位，又居互體兌中，有脫象。夫妻反目成讎，有如車輪輹脫落，無法行走。輿象徵眾，民心。輿脫輻而車不可行，亦象徵君德不行而失民心。",
      "六四":"六四，有孚，血去惕出，无咎。\n《象》曰：有孚惕出，上合志也。\n\n有誠信，血流去，恐懼除，無罪咎。小有血光之災，雖會流點血，歷經恐懼，但能夠免於罪咎。四為近君多懼之位，又為互體兌卦之上爻，因此有憂慮驚險之象，但只要秉持誠信，恐懼自能消除，不會有事。",
      "九五":"九五，有孚攣如，富以其鄰。\n《象》曰：有孚攣如，不獨富也。\n\n有誠信又能彼此攜手相連，因鄰居間共同合作而富有。九五居上體巽卦中爻，巽為繩、係，攣之象；巽為利市三倍，富之象。泰六四及謙六五皆曰「不富以其鄰」，都有震象，震伏巽，巽象不見，故曰「不富」。",
      "上九":"上九，既雨既處，尚得載，婦貞厲。月幾望，君子征凶。\n《象》曰：既雨既處，德積載也；君子征凶，有所疑也。\n\n雨已經下了，就好好停下來休息，希望車子得以運載準備出行，婦女堅貞而艱苦。已近月圓之時，君子出征不利，凶。上九小畜已終，卦辭開始言密雲不雨，終則變為雨。上爻變成需，需本義為雨中等待，乃有待而行之義。所以不利於出征，出征為凶"
    }
  },
  "111011": {
    "name": "履",
    "pinyin": "lǚ",
    "summary": "天澤履，上天下澤，謹慎行事。(中吉)",
    "detailed": "履卦象徵行事需謹慎，如履薄冰而行，需小心應對，以免招致危險。凡事必需謹慎小心，戒慎恐懼，一切照規矩來，則可以亨通。要特別注意人與人的關係上，必需清楚分辨尊卑上下的份際，嚴守其應對之道。",
    "explanations": {
      "運勢": "凡事小心翼翼，謹守上下尊卑份際，則可以險中求通。運勢尚可，但需謹言慎行，穩健前進。",
      "感情": "感情關係需互相尊重，避免魯莽行動。",
      "財運": "財運普通，投資需謹慎評估，步步為營。",
      "工作": "工作中宜低調行事，穩定發展。必需循規蹈矩，凡事照規定來，注意上下的分工與份際，否則必然出重大差錯。",
      "買賣": "交易需注意細節，避免貿然決策。",
      "考試": "考試運勢普通，需專注準備，避免馬虎。",
      "健康": "健康需注意調養，避免過度勞累。",
      "訴訟": "訴訟案件需審慎處理，避免衝動行事。",
      "尋人": "尋人過程可能受阻，需穩步推進。",
      "尋物": "尋物需細心查找，不可急躁。",
      "旅行": "旅行需小心安排，途中需多留意安全。",
      "人際": "人際關係需謹慎經營，避免口舌是非。",
      "卦辭": "履虎尾，不咥人，亨。\n《彖》曰：履，柔履剛也。說而應乎乾，是以履虎尾，不咥人，亨。剛中正，履帝位而不疚，光明也。\n《象》曰：上天下澤，履，君子以辯上下，定民志。\n\n踩老虎尾，老虎不咬人，亨。 《彖傳》：「說而應乎乾，是以履虎尾，不咥人，亨。」老虎之所以不咬人，是因為能夠小心翼翼，和悅的順從其意，所以老虎不咬人。\n\n【卦旨】履有履踐、行走之意，揭示為人處世必須小心謹慎、循禮而動，方能無害的道理。其中卦辭更體現了「如臨深淵，如履薄冰」的行為準則。"
    },
    "yaoInterpretation": {
      "初九":"初九，素履，往，无咎。\n《象》曰：素履之往，獨行願也。\n\n樸素的禮儀，以此而往，沒有罪咎。素，形容人的德行很樸素，獨來獨往，獨善其身。素履引喻為樸素的禮儀，沒有官位與名份的人並不需繁文縟節，只要遵守為人處世的基本道理，樸素而行即可。",
      "九二":"九二，履道坦坦，幽人貞吉。\n《象》曰：幽人貞吉，中不自亂也。\n\n所走的道路平坦而廣闊，隱士貞定則吉。九二爻變下卦成震，互體成艮。震為大途，故曰「履道坦坦」。艮山之下，隱士（幽人）之象。",
      "六三":"六三，眇能視，跛能履。履虎尾，咥人凶。武人為于大君。\n\n《象》曰：眇能視，不足以有明也；跛能履，不足以與行也；咥人之凶，位不當也；武人為于大君，志剛也。\n 一眼盲了也能看見，但所見不清楚。跛腳也能走路，但既不靈活也無法行遠。因此而踩老虎尾巴，老虎咬人，凶。這就有如一個武人而想要當君王。「眇能視，跛能履」比喻人不自量力，做自己所不擅長的事。「履虎尾，咥人凶」說明此不自量力、不謹慎行事的結果。武人為于大君，武夫只懂得帶兵打仗，不懂治國方略，卻不安份而想要當國君，失敗乃註定的結果。就如眼睛看不清、腳跛不便於行，仍要冒險行事，踩到老虎尾巴而讓老虎所咬，乃是必然之事。",
      "九四":"九四，履虎尾，愬愬，終吉。\n《象》曰：愬愬終吉，志行也。\n\n踩老虎尾巴，戒慎恐懼，步步為營，終能化險為夷，吉。履道講的是戒慎恐懼，只要隨時保持警戒，即使如九四在踩老虎尾，一樣是吉。九四處近君多憂之位，兌為虎，六三在兌口，所以老虎咬人。但兌卦在內，九四在外，兌口（六三）又順承於九四之陽，故不咬人而吉。九四爻動上體成巽順，承九五之尊，為動而能順於君之象。九四爻動互體成震，「震來虩虩」，故曰「虩虩」。",
      "九五":"九五，夬履，貞厲。\n《象》曰：夬履貞厲，位正當也。\n\n破損的鞋子，堅定則艱苦。或解釋作「決斷之履行」。履道最忌諱的就是自滿，高傲，不懂尊卑分際，逾越本份。而九五處於最尊貴的位置，雖然沒有逾越的問題，但行事過於剛強，果斷，所以也因此而招來危險。王弼所說的：「履道惡盈而五處尊，是以危。」",
      "上九":"上九，視履，考祥其旋，元吉。\n《象》曰：元吉在上，大有慶也。\n\n履道進入尾聲，回顧自己所做所為，仔細檢驗檢討優缺點，大吉。此為能夠自省者，履卦吉道在謙虛自養，因此為吉。"
    }
  },
  "000111": {
    "name": "泰",
    "pinyin": "tài",
    "summary": "地天泰，天地交泰，通達順遂。(大吉)",
    "detailed": "泰卦象徵天地交融，陰陽調和，萬物暢達，代表通順與繁榮的象徵，適合推動計畫與發展。雖然一切順利，萬事如意。但人無遠慮，必有近憂。對於事情的發展應當有防患於未然的遠見，則可長保安泰。反之，若不知守成不易，防患未然，則泰極否來，吉之後很快就會轉為凶。",
    "explanations": {
      "運勢": "萬事亨通，運勢大吉，時機成熟，可大展拳腳。",
      "感情": "雙方情投意合，很有話聊，感情關係和諧，雙方相處融洽。",
      "財運": "財運旺盛，投資與創業皆有良好回報。",
      "工作": "工作順利，有貴人相助，事業穩步發展。",
      "買賣": "交易順利，市場環境良好，獲利可觀。",
      "考試": "考試運佳，學習成果豐碩，表現優異。",
      "健康": "健康狀況良好，精力充沛，宜持續保養。",
      "訴訟": "訴訟可望圓滿解決，結果有利。",
      "尋人": "尋人順利，對方可能平安無事。",
      "尋物": "尋物可順利找回，宜保持耐心。",
      "旅行": "旅行順利，途中有愉快收穫。",
      "人際": "人際關係融洽，適合建立合作夥伴關係。",
      "卦辭": "泰，小往大來，吉亨。\n《彖》曰：泰，小往大來，吉亨，則是天地交而萬物通也，上下交而其志同也。內陽而外陰，內健而外順，內君子而外小人。君子道長，小人道消也。\n《象》曰：天地交，泰。后以財成天地之道，輔相天地之宜，以左右民。\n\n陰氣離去，陽氣歸來。吉而亨。小指外面的坤卦（陰氣），大為裡面的乾卦（陽氣）。陰為小人、人之所惡；陽為君子、人之所欲。《彖傳》說：「內健而外順，內君子而外小人。」此為君子歸來而通達的時候，因此吉而亨通。泰卦卦象又有天地陰陽之氣相交之義，在上的乾陽下降，在下的坤陰上升，天地陰陽相交，因此萬物通泰而生。反之，否卦為乾天陽氣停留在上，坤地陰氣停留在下，為天地陰陽不交，萬物閉塞不通。\n\n【卦旨】泰為通泰，揭示事物的各個方面由於相互的交通應合而走向亨通的道理，以及陰陽對待、物極必反、泰極否來的哲理。"
    },
    "yaoInterpretation": {
      "初九":"初九，拔茅茹，以其彙，征吉。\n《象》曰：拔茅征吉，志在外也。\n\n拔茅草的根，一拔就一整串的同類根根相連、牽連而出。出征大吉。此比喻人當慎於始，一但一開始做對了，接下來將成連鎖效應，同類相牽引而出。又可比喻君子呼朋引伴，一但有人開頭，眾人便牽連而出。以此而出征，大吉。",
      "九二":"九二，包荒，用馮河，不遐遺，朋亡，得尚于中行。\n《象》曰：包荒，得尚于中行，以光大也。\n\n取中空的匏瓜來渡河，還沒到達時匏瓜就遺失，同行的朋友因而死亡。這趟旅程在行程當中得到獎賞。王弼注解在強調該爻講的是君子包容宏大而公正之美德，至宋明儒之後多將「包荒，用馮河，不遐遺，朋亡」解釋為四種不同的美德：具有包容荒穢之物的心胸，徒手渡河的勇氣，遠處不遺漏的深思熟慮，以及不繫絆於朋黨的大公無私。",
      "九三":"九三，无平不陂，无往不復。艱貞，无咎。勿恤其孚，于食有福。\n《象》曰：无往不復，天地際也。\n\n沒有不傾斜的平地，離去的一定會再回來，艱苦守正則可免於罪咎。不去擔憂這是否會應驗，一定可以享有其福報。九三為泰卦三陽的極盛，此段言君子要居安思危，才能長保安泰之道。天道循環，久泰則否將至，但若能艱苦守正，則能保有更長的安泰時光。此爻也預示陰氣將回來，上六爻將泰極否來，城復于隍。",
      "六四":"六四，翩翩，不富以其鄰。不戒，以孚。\n《象》曰：翩翩不富，皆失實也；不戒以孚，中心願也。\n\n群眾群集而來歸順，他們因為鄰居的侵擾而貧窮。不需對這些來歸的群眾警戒，而是要以孚信之心相待。象曰「翩翩不富，皆失實也」，陽為實，泰卦自六四開始不再有陽，故曰「失實」，失實者失乾陽也。乾為金玉，失實有失金之意。又六四互體為兌，兌為毀折，有失財之象。",
      "六五":"六五，帝乙歸妹，以祉元吉。\n《象》曰：以祉元吉，中以行願也。\n\n帝乙年少的女兒出嫁，因此而有福祉，大吉。此為商王帝乙（商紂帝辛的父親）嫁女兒的故事，時殷商勢力已衰，面對周逐漸興起的威脅，為了安撫、討好周，將女兒嫁給了西伯，也就是後來的周文王。此為殷商的和親策略，因此保有和周暫時的和平關係及商天下的安定，因此說「以祉元吉」。六五為君位，與九二臣位相應，六五陰柔，喻商王室之衰，九二陽剛，喻周之盛。",
      "上六":"上六，城復于隍，勿用師。自邑告命，貞吝。\n《象》曰：城復于隍，其命亂也。\n\n城牆倒塌成為一片廢墟，不宜出師。城內開始自行發布命令，然而命令已經大亂，若還以此堅定自守則會悔恨。泰道已至尾聲，泰極變否，國家開始動亂，不需出動軍隊即會滅亡。"
    }
  },
  "111000": {
    "name": "否",
    "pinyin": "pǐ",
    "summary": "天地否，天地不交，阻隔不通。(凶)",
    "detailed": "否卦象徵天地不交，陰陽隔離，氣運不通，表示困難與阻塞，需耐心等待機會轉變。除了靜待時機，等待否極泰來，或許可以多注意一下自己在溝通能力上的問題。若是為人上司，則應該設法放下身段，打破下屬的心結。若是為人下屬，則可設法將意見上達。",
    "explanations": {
      "運勢": "運勢不佳，阻力重重，宜謹慎應對。閉塞不通，有嚴重的溝通問題。",
      "感情": "雙方無法相互了解。感情關係易生隔閡，需多溝通化解誤會。",
      "財運": "財運不穩，投資需特別謹慎，避免損失。",
      "工作": "不順。工作進展受阻，適合暫時穩守，不宜輕舉妄動。",
      "買賣": "交易市場冷淡，建議等待更好的時機。",
      "考試": "考試壓力較大，成績可能未達預期，需更努力。",
      "健康": "健康需多注意，易有身體不適，宜及早檢查。",
      "訴訟": "訴訟糾紛較多，需有耐心應對，宜和解為上策。",
      "尋人": "尋人困難，可能因各種原因受阻。",
      "尋物": "尋物可能較困難，需多方面查找。",
      "旅行": "旅行過程可能遇到阻礙，也需避免溝通方面的問題，宜做好充分準備。",
      "人際": "人際關係可能受到影響，宜謹言慎行。",
      "卦辭": "否之匪人，不利君子貞，大往小來。\n《彖》曰：否之匪人，不利君子貞，大往小來，則是天地不交而萬物不通也，上下不交而天下无邦也。內陰而外陽，內柔而外剛，內小人而外君子，小人道長，君子道消也。\n《象》曰：天地不交，否。君子以儉德辟難，不可榮以祿。\n\n閉塞不通，慘無人道的時候，不利於君子的正道。君子大人離去，小人回來。天地閉塞不通的時候，萬物凋零，天下慘無人道，仁人君子的貞正之道完全不可行。君子離去，小人當道。陽為大，比喻君子。陰為小，比喻小人。\n\n【卦旨】否為閉阻，不順，揭示上下不交、陰陽不合，事物處於閉阻不通的情況下，如何應對自保的道理，以及否極必然泰來的發展規律。"
    },
    "yaoInterpretation": {
      "初六":"初六，拔茅茹，以其彙。貞吉，亨。\n《象》曰：拔茅貞吉，志在君也。\n\n拔茅草的根，一拔就一整串的同類根根相連、牽連而出。貞定則吉而亨通。傳統註解認為，否卦之所以貞吉，因初爻否道邪惡未成，小人貞正則可成君子。此段爻辭與泰卦初九幾乎一樣，但泰初九言「征吉」，為適於出征；此言「貞吉」，為不宜出征，反而應該貞定。這是陰陽之別，因泰初九，陽爻主動；否初六，陰爻主靜。",
      "六二":"六二，包承，小人吉，大人否亨。\n《象》曰：大人否亨，不亂群也。\n\n包容而承順，小人吉，大人則閉塞不亨通。六二為下卦之中爻，為包。下卦坤三爻承上卦之乾陽，二為下卦之主爻，故於六二曰「承」。《周易》陰下陽上為「承」，陰順於陽，承順之象；反之陰在陽上為「乘」，陰逆於陽，叛逆之象。",
      "六三":"六三，包羞。\n《象》曰：包羞，位不當也。\n\n所包容的是羞恥之事。或可解釋為將進獻的食物包裹好。帛本作「枹憂」，疑是姤卦九五「以杞包瓜，含章，有隕自天」的簡文。姤九五帛本作「以忌枹苽，含章，或塤自天」。「有隕自天」依上博簡可改訂為「有憂自天」。姤九五可能作「以杞枹瓜，含章，有憂自天」，簡文即「枹憂」。",
      "九四":"九四，有命无咎，疇離祉。\n《象》曰：有命无咎，志行也。\n\n有命令則不會有罪咎，同類可沾附其福祉。小人之道已消退，君子開始救濟閉塞的時運。然而處於多懼又沒有權力的位置，雖然有能力改變局面，但無法主動行事，必需等上面來的命令，才能行動並免於罪咎。而同伴也將因為九四之志行而共同享受福祉。九四居互體巽卦之中，巽為命令，故曰有命。",
      "九五":"九五，休否，大人吉。其亡其亡，繫于苞桑。\n《象》曰：大人之吉，位正當也。\n\n否道休止，大人吉。但應當有國家滅亡的警惕，就好比依賴茂盛而不牢靠的桑樹維繫國家一樣的危險。否道已經即將結束，小人之道停止滋長，具有陽剛中正之德的君子，得以為亂世之中流砥柱。然而否道畢竟還沒有結束，國家仍維繫於不穩固的基礎上。",
      "上九":"上九，傾否，先否後喜。\n《象》曰：否終則傾，何可長也。\n\n傾覆的否道，先是閉塞，最後有喜。否道已經要結束，正是黎明前的黑暗，否極要泰來的時候。先是閉塞不通，但馬上會否極泰來，喜事來臨。"
    }
  },
  "111101": {
    "name": "同人",
    "pinyin": "tóng rén",
    "summary": "天火同人，天火通明，和合共進。(大吉)",
    "detailed": "同人卦象徵人際和合，群策群力，適合團隊合作與共同發展。君子宜廣交善緣，共同成就大事。同人卦貴在無私，公正而不偏袒，謙卑而中庸。與人結盟應當要有信心與決心，更應注意自己的誠信與心胸氣度，否則中間可能出現的阻撓與障礙，不但可能讓你半途而廢，甚至惹禍上身。",
    "explanations": {
      "運勢": "運勢大吉，宜與人合作、與人結盟，事半功倍。",
      "感情": "感情和諧，宜互相扶持，共創未來，但應防第三者從中破壞。",
      "財運": "財運旺盛，與人合作投資可獲大利。",
      "工作": "工作上適合團隊合作，能獲得更好成果。需找到貴人幫助才可成功，更應慎防小人相害。",
      "買賣": "交易順利，合夥經營可帶來豐厚收益。",
      "考試": "考試運佳，與同學或師長互動學習可提升成績。",
      "健康": "健康良好，適合群體活動，增強體質。",
      "訴訟": "訴訟易和平解決，與對方協商可獲雙贏。",
      "尋人": "尋人順利，對方可能在人際網絡中可尋得。",
      "尋物": "尋物易得，可能需靠朋友協助。",
      "旅行": "旅行順利，宜與親友同行，共享樂趣。",
      "人際": "人際關係良好，廣結善緣，事事順利。",
      "卦辭": "同人于野，亨，利涉大川，利君子貞。\n《彖》曰：同人，柔得位得中而應乎乾，曰同人。同人曰，同人于野，亨，利涉大川，乾行也。文明以健，中正而應，君子正也，唯君子為能通天下之志。\n《象》曰：天與火，同人。君子以類族辨物。\n\n與人會見於野外，亨通。利於涉水過大河，可以涉險。利於君子的貞定。此指周王設壇於城外與諸侯行會同之禮，即見面商討如何征伐不順服的諸侯。同人卦是乾與坤旁通而來，乾九二至坤五，乾體變成同人，坤體變成比卦。同人於野、利涉大川講的都是乾卦九二至坤五成比卦九五。九二至九五多功之位，為眾所親比，為比卦上體坎中，坎為大川。五為郊野之位。\n\n【卦旨】卦義為和同於人、與人合同，與人合的面要寬廣不能只與合同親近的人或小圈子，合同包容天下所有人，也就是大同，揭示人與人之間應當保持一種和諧融洽的關係，不要偏私偏愛，甚至互相攻許爭鬥的道理。"
    },
    "yaoInterpretation": {
      "初九":"初九，同人于門，无咎。\n《象》曰：出門同人，又誰咎也。\n\n與人會面於門內，沒有罪咎。經文雖未說門內、門下，或門外，但初九為門內之位，因此理應是在門內會面，而不是出門會面。此句意思是宜於在門內會面，則可得無咎。不宜在門外與人會面。初九動，下卦成艮，艮為門闕，初處門之下位，故曰「同人於門」。",
      "六二":"六二，同人于宗，吝。\n《象》曰：同人于宗，吝道也。\n\n夏宗之禮上行會同之禮，有悔恨。六二為離卦之主，離為夏，六二應九五為見，夏見之象。夏見曰宗，故曰「同人於宗」。六二原本為同人卦的主爻，但只與九五和同，因此而與中間的九三、九四兵戎相見（見九三九四爻辭）。反之，若能放大視野，而能與眾人皆和同，則可亨通。",
      "九三":"九三，伏戎于莽，升其高陵，三歲不興。\n《象》曰：伏戎于莽，敵剛也；三歲不興，安行也。\n\n埋伏於草木叢裡，登高到高地上。三年都無法興兵動武。此段言敵人強大，因此伏兵於草叢間觀其虛實，等待時機。後又爬到高地上，希望對全局有更好的掌控，仍然一無所獲。最後三年時間都無法興兵攻敵。",
      "九四":"九四，乘其墉，弗克攻。吉。\n《象》曰：乘其墉，義弗克也。其吉，則困而反則也。\n\n修築城牆，讓敵人攻打不下。吉。傳統註解為，登上其城牆，但未能攻下，因為義理上不能攻下。以兵法來說，登牆而未攻下，或許可解釋為「圍點打援」戰術的運用。",
      "九五":"九五，同人，先號咷而後笑，大師克，相遇。\n《象》曰：同人之先，以中直也；大師相遇，言相克也。\n\n會同之前驚恐而痛哭，後因有轉機而大笑。大軍將敵人打敗，終於雙方相遇。會同的原因原本就是為了要征伐不順服的諸侯，因此會同之先「先號咷」，因遇諸侯反叛。而後笑者，會同是拉攏所親密的諸侯，諸侯來會同，大師得以會合。六二雖為同人卦主爻，但在會同當中九五才是真正的會同之主，也就是周天子。九三九四兩爻講的是不順服之諸侯來犯，九五因陽剛中正，所以有能力以強勢的手段來弭平。",
      "上九":"上九，同人于郊，无悔。\n《象》曰：同人于郊，志未得也。\n\n在郊外與人會合，無所後悔。郊與野原本有離城遠近之別，但都意指城外。依《周禮》，會同是在朝覲之後於國外設壇為之，因此郊與野都是「國外」的不同說法。上六最處卦外，爻位為「郊」。傳統解釋以「郊」喻人之置身事外。同人卦中，其他四陽爭一陰（六二），唯獨上九是完全置身事外者。上九雖想置身事外，又得與人和同，所以像是群體中與人格格不入者，因此象曰：「同人于郊，志未得也。」言獨善其身之志向未能實現。"
    }
  },
  "101111": {
    "name": "大有",
    "pinyin": "dà yǒu",
    "summary": "火天大有，如日中天，富貴盈滿。(大吉)",
    "detailed": "大有卦象徵財富與成就、日正當中，如烈日高照，萬物繁榮。君子宜珍惜當下，善加運用機會，達到更大成就。大有是非常好的一卦，凡事都順利而亨通。但要注意的是富有時應保持低調，不要炫耀，以免引來不必要的麻煩。",
    "explanations": {
      "運勢": "運勢大吉，萬事亨通。事業與財富皆有豐收。",
      "感情": "感情穩定幸福，適合發展長遠關係。非常有異性緣。",
      "財運": "財運極佳，宜把握機會擴展資源。",
      "工作": "吉星高照，工作順利，適合承擔大任，勇往直前。",
      "買賣": "交易順遂，市場有利可圖，適合擴展事業。",
      "考試": "考試運佳，學習成效顯著。",
      "健康": "健康狀況良好，但需注意過勞。",
      "訴訟": "訴訟有利，正當行事可獲勝。",
      "尋人": "尋人容易成功，對方可能平安無事。",
      "尋物": "尋物順利，易於尋回。",
      "旅行": "旅行順暢，可能有意外收穫。",
      "人際": "人際關係良好，可獲得貴人相助。",
      "卦辭": "大有，元亨。\n《彖》曰：大有，柔得尊位大中，而上下應之，曰大有。其德剛健而文明，應乎天而時行，是以元亨。\n《象》曰：火在天上，大有。君子以遏惡揚善，順天休命。\n\n大有，大亨。大有卦是所有卦辭中最簡要的一卦，只有「元亨」兩個字。不過還好有《易傳》解說可循。《彖》曰：「大有，柔得尊位大中，而上下應之，曰大有。其德剛健而文明，應乎天而時行，是以元亨。」「柔得尊位大中」指六五，以柔居五之尊位，五為兩個中爻中較尊高者，故曰「大中」。「上下應之」，上指上九，與六五比鄰而應，下指九二。「其德剛健而文明」講的是上下二體，內剛健而外文明，六五應於下卦乾之九二，所以是應乎天。\n\n【卦旨】大有是大獲所有，揭示在昌盛富有的情況下，來尋求協助幫忙的人很多，而此時應如何善處的道理；同時也指出，政治昌明，大有局面出現時，應順應天道，而君子更應當，遏止惡行，表揚善行。大有卦啟示我們在擁有名位財富之時，仍然必須保有一份謙讓之心，堅守正道，自律自重，同時好好運用富有之基，熱心公益，捐獻助人，千萬不可驕縱蠻橫，仗勢凌人而「為富不仁」，如此將自取滅亡。"
    },
    "yaoInterpretation": {
      "初九":"初九，无交害。匪咎，艱則无咎。\n《象》曰：大有初九，无交害也。\n\n因沒有相交而受害，並不是應有的罪咎。艱苦則沒有罪咎。大有的初始階段，與富有之主（六五）沒有交集，因而受害。這不是因為自己有什麼罪咎。只要能夠艱苦，就能安全渡過，免於罪咎。大有卦主爻為六五，九二與其相應，九三與其同功（三與五同功而異位），九四及上九與其比鄰，所有的陽爻中，唯有初九與六五完全沒有交集。《彖》傳說「大有，柔得尊位大中，而上下應之」，初九是唯一完全無法呼應到六五之君者，因此謂「無交害」。交或可解釋為皎，明白、清楚。無交，不明白。初六在下，上為離日，初無日照之明，故曰無皎。",
      "九二":"九二，大車以載，有攸往，无咎。\n《象》曰：大車以載，積中不敗也。\n\n大車用以承載，若要遠行，沒有罪咎。九二性情剛健而處事中庸，又與六五之君相應，所以足以受君王之所託而承擔重任，以走長遠的路途。",
      "九三":"九三，公用亨于天子，小人弗克。\n《象》曰：公用亨于天子，小人害也。\n\n公侯和天子聚餐，小人則不堪此任。若是君子、大人，可以直達天子，與天子嘉會。但反之，若是小人，居於此位反而無法擔當，直接受害。九三為多憂之位，與五同功。居互體兌之下，爻變之後又居坎下兌上，因此本為凶險之地。若是君子、大人居之，逢大有之世，可直達六五而免於凶險。若是小人，則無以應對，故為凶。",
      "九四":"九四，匪其彭，无咎。\n《象》曰：匪其彭，无咎，明辨晢也。\n\n不炫耀，保持低調，無咎。處於富有的極盛時候，但太接近權力核心，不只憂慮特別多，還要處處避免嫌疑。此時應該體認自己極盛之後可能將衰，伴君如伴虎，最好能懂得低調以明哲保身，認清自己的地位，則能免於罪咎。",
      "六五":"六五，厥孚交如，威如，吉。\n《象》曰：厥孚交如，信以發志也。威如之吉，易而无備也。\n\n誠信而能與人相交，且很有威嚴，吉。六五處於最尊貴的位置，柔順而中庸，而且有陽剛的一群賢能之士來輔佐。既有誠信與群臣交心，又有威嚴，受人敬重，吉。六五為大有卦主爻，大有卦的卦義也是從六五而來，所以《彖》曰：「柔得尊位大中，而上下應之，曰大有。」柔得位指六為陰為柔，居於「五」這個君位，大中指五的位置，是上卦的中爻，喻指具中庸的美德，上下應之指上九及九二兩爻與其相應。這是君王能得眾臣輔助的卦象，因此而能夠富有天下。原本五之尊位宜以九居之，六為陰柔，通常意謂著君王之柔弱無能，但大有六五與上下陽卦相應，柔君有能臣之輔，因此為吉。由於君德柔弱，因此若能有威信則吉，反之則凶。",
      "上九":"上九，自天祐之，吉无不利。\n《象》曰：大有上吉，自天祐也。\n\n來自上天的保佑，吉，無往而不利。六五已是尊位，上九處大有卦的極盛，又為六五之君所供養（六五承上九，柔承剛為順為吉），因此像是太上皇，較六五而更富有天下，因此大吉，無往而不利。"
    }
  },
  "000100": {
    "name": "謙",
    "pinyin": "qiān",
    "summary": "地山謙，地中有山，謙虛受益。(大吉)",
    "detailed": "謙卦象徵謙遜有禮，如高山藏於地下，內在有實力但不張揚。君子應虛懷若谷，積極學習，廣結善緣。謙是修養自己，以德服人的一卦。因為虛心，所以更為富有，因為謙卑，所以崇高；功成不居，所以偉大。但這些都不是一蹵可及的，而是要持之以恒。",
    "explanations": {
      "運勢": "修行以等待時機，持之以恒可以亨通。運勢大吉，謙遜待人則吉，驕傲自滿則凶。",
      "感情": "要學習退讓。感情關係穩定，互相尊重則幸福長久。",
      "財運": "財運穩定，宜低調累積財富。",
      "工作": "工作順利，功成不居，虛心退讓，保持謙虛可獲得更多機會。",
      "買賣": "交易順利，謙和待客可提升商機。",
      "考試": "考試成績良好，但仍需虛心學習。",
      "健康": "健康狀況良好，宜保持平和心態。",
      "訴訟": "訴訟有機會獲勝，但應保持謙和態度。",
      "尋人": "尋人順利，對方可能在安靜場所。",
      "尋物": "尋物可得，但需耐心尋找。",
      "旅行": "旅行愉快，低調行事可避禍。",
      "人際": "人際關係良好，謙虛待人可獲貴人相助。",
      "卦辭": "謙，亨，君子有終。\n《彖》曰：謙亨，天道下濟而光明，地道卑而上行；天道虧盈而益謙，地道變盈而流謙；鬼神害盈而福謙，人道惡盈而好謙。謙尊而光，卑而不可踰，君子之終也。\n《象》曰：地中有山，謙，君子以裒多益寡，稱物平施。\n\n謙卑而能夠亨通，君子能實踐到最後。謙卦主爻為九三，九三為艮卦之成，艮卦又是成物終物之卦，《說卦》「終萬物始萬物者莫盛乎艮」，因此九三也說「君子有終」\n\n【卦旨】謙為謙虛、謙遜，揭示立身處世必須恭敬合禮、屈己下人、有其德而不自居，謙讓而不自滿的道理。卦中六爻爻辭，皆吉或利，為《周易》中所罕見，可見謙德的重要。"
    },
    "yaoInterpretation": {
      "初六":"初六，謙謙君子，用涉大川，吉。\n《象》曰：謙謙君子，卑以自牧也。\n\n謙卑又謙卑的君子，可以涉水過大河，吉。初六居於六爻最下面，是最為謙卑的一爻，也是打從內在本質就是謙虛的一爻。有謙虛的德性而又能以柔順居於最卑微的地位，所以說「謙謙」，謙虛又謙虛、謙卑再謙卑之象。君子能以謙虛來修養自己，培養自己的內涵，就算面對危險，亦能逢凶化吉。但反之，若是不能謙虛，則無以濟事。此爻謙卑者吉，反之，高傲者凶。如涉水過河，知道危險、人力渺小，則反能安然渡過。而高傲者，以暴虎馮河的蠻勇，自以為人力勝天，就會遭至滅頂之災。",
      "六二":"六二，鳴謙，貞吉。\n《象》曰：鳴謙貞吉，中心得也。\n\n這是唱和式的謙虛，貞定則吉。性情柔和，而能與有能力的陽剛之人互相唱和，心悅誠服追隨賢能之士，貞正則吉。六二之謙虛，乃是唱和式的，不如初六之本質即謙卑，故初六曰「謙謙」，六二說「鳴謙」，鳴為唱和、呼應之意。六二居初之上，但柔得位而居中，有中正之德，又上承九三，因此為能唱和而謙者。",
      "九三":"九三，勞謙，君子有終，吉。\n《象》曰：勞謙君子，萬民服也。\n\n辛勞的謙虛，君子可以有始有終，吉。辛勤勞苦，苦行式的謙卑感化群眾，讓大家心服口服地追隨。如此吃苦耐苦、謙虛而不居功，又能持之以恒，有始有終，吉。",
      "六四":"六四，无不利，撝謙。\n《象》曰：无不利，撝謙，不違則也。\n\n無所不利，因為能夠發揮謙虛之美德。象曰：「無不利，撝謙，不違則也。」撝謙不違背原則，原則指謙卑之法則。",
      "六五":"六五，不富以其鄰，利用侵伐，无不利。\n《象》曰：利用侵伐，征不服也。\n\n因為鄰居而貧窮，宜於出征侵伐，無所不利。六五為君位，說的是君王對於身邊近處能以謙虛懷柔而收服人心，但對於惡鄰當以武力討伐。謙古卦名當為兼，六五及上六講的應是兼併他國之事。",
      "上六":"上六，鳴謙，利用行師，征邑國。\n《象》曰：鳴謙，志未得也，可用行師，征邑國也。\n\n聲討及兼併，宜於發動軍隊，征伐城邑國家。傳統解釋以「鳴謙」為徒具虛名之謙虛，不具實質，因而無法感人服人。只能動用軍隊，鎮壓城內。上六是謙卦的極高之處，謙卦貴在於卑微，謙虛，退讓，初六處於最下處說「謙謙」，是謙卑又謙卑，也是最得謙道者。上六則是在最高處，為最高調的謙卑，因此是虛假、徒具虛名，拿來自誇的謙卑。因此連近處的人都無法信服，只好以武力來鎮壓。"
    }
  },
  "001000": {
    "name": "豫",
    "pinyin": "yù",
    "summary": "雷地豫，雷出地奮，順勢而行。(中吉)",
    "detailed": "豫卦象徵愉悅與順勢而行，如雷聲在大地迴盪，春臨大地，萬物震奮。君子應趁勢而動，抓住機會，積極向前。可以用「寓教於樂」的手段來完成嚴肅的事。凡事用心傾聽，以娛悅的心與人多做心靈的交流；不要沉溺而迷失自我，要懂得節制，適可而止。",
    "explanations": {
      "運勢": "順著民情、民意，眾人之意做事則可成，運勢尚佳，順應時勢行事可獲成功。",
      "感情": "吉。有異性緣。感情關係穩定，宜珍惜當下。",
      "財運": "財運良好，適合順勢投資。",
      "工作": "工作進展順利，適合推動新計畫。利於建立人脈基礎。適於娛樂業。",
      "買賣": "交易可順利進行，市場穩定。",
      "考試": "考試運普通，需積極準備。",
      "健康": "健康狀況良好，保持規律作息。",
      "訴訟": "訴訟進展平穩，耐心處理可獲勝。",
      "尋人": "尋人順利，對方可能在熟悉之地。",
      "尋物": "尋物可找回，需耐心查找。",
      "旅行": "旅行順遂，適合放鬆心情。",
      "人際": "人際關係良好，積極交流有助發展。",
      "卦辭": "豫，利建侯、行師。\n《彖》曰：豫，剛應而志行，順以動，豫。豫順以動，故天地如之，而況建侯行師乎？天地以順動，故日月不過，而四時不忒。聖人以順動，則刑罰清而民服。豫之時義大矣哉。\n《象》曰：雷出地奮，豫。先王以作樂崇德，殷薦之上帝，以配祖考。\n\n豫樂，利於建立諸侯，發動軍隊。得到群眾的呼應又志在必行，順勢而動，所以為豫。此言建立諸侯，發動軍隊，皆順應民心，而且還有剛強的決心去執行。\n\n【卦旨】豫為悅逸安樂，是和樂之意，揭示樂須眾樂、而非獨樂，以及適性而樂，不可窮歡極樂的道理，人在快樂安逸之時，容易沉湎於安逸享樂之中，其中多含樂極生悲、豫逸亡身的告誡。"
    },
    "yaoInterpretation": {
      "初六":"初六，鳴豫，凶。\n《象》曰：大聲玩樂，凶。\n\n過於淫逸，而至鳴叫。豫之吉在於節制、防患未然，忌在淫逸放縱。初六處於豫樂的開始，一開始就不知自我節制。九四為豫卦卦主，也是唯一陽爻，初六與九四相應，自恃受到九四榮寵，失態放縱，因此而凶。",
      "六二":"六二，介于石，不終日，貞吉。\n《象》曰：不終日，貞吉，以中正也。\n\n敲擊演奏石磬，不到一日，貞定為吉。\n此言豫樂有所節制，豫道以節制為吉。不終日言有所節制，不至終日即停止。六二居互體艮之下，知所止之象。或：守衛于石，不到一日就可抵定，貞定為吉。介為守、禦之義。介于石，以石做防禦。相反的就是困卦六三的「困于石，據於蒺藜」傳統解釋以介為耿介，言君子品格耿介，堅定如石，不待終日就能從正而吉。",
      "六三":"六三，盱豫，悔遲有悔。\n《象》曰：盱豫有悔，位不當也。\n\n一早就豫樂，如果悔改晚了那就真的要悔恨了。傳統解釋「盱豫」為奉承謟媚的逸樂，悔改為宜。若陷溺其中而遲遲不知回頭，將會後悔。言小人因為接近權勢而奉承謟媚以求豫樂，陷溺其中而遲遲不知回頭，因此悔恨。",
      "九四":"九四，由豫，大有得，勿疑，朋盍簪。\n《象》曰：由豫，大有得，志大行也。\n\n心中猶豫不定。大有獲得，不用懷疑，朋友皆會以你為宗主。九四為互體坎卦之中，坎為疑，因此曰「猶豫」，猶豫因為懷疑。之所以懷疑，是因為卦主經常都是五位之爻，但就豫卦總體六爻來看，九四為豫卦唯一的一個陽爻，也是一卦之宗主，下三陰爻為朋眾之象，九四為眾陰所承，因此曰「朋合宗」。",
      "六五":"六五，貞疾，恒不死。\n《象》曰：六五，貞疾，乘剛也。恒不死，中未亡也。\n\n筮問疾病，久病不會死。也可解釋為貞固（偏執）以致成疾，久而不死。六五以柔居尊位，大權旁落於九四之大臣，眾陰（群眾、百姓）都依於九四，六五又逆乘九四，因此有疾。居互體坎上，動而成兌，坎為心病，兌為毀折，故曰疾。",
      "上六":"上六，冥豫，成有渝，无咎。\n《象》曰：冥豫在上，何可長也。\n\n豫樂至夜，該是結束的時候，改變則沒有罪咎。豫樂之道已走到盡頭，豫卦忌在耽溺，既然豫樂該是結束的時候那麼就要結束，再繼續則是沉迷而不知返，將有罪咎。因此告戒「成有渝」，渝者變也，豫道已成就要變。由動而歸靜，則可免於罪咎。上爻為冥象，升卦上爻亦曰「冥升」。"
    }
  },
  "011001": {
    "name": "隨",
    "pinyin": "suí",
    "summary": "澤雷隨，雷入澤中，隨機應變。(中吉)",
    "detailed": "隨卦象徵順應環境的變化，如雷響於澤中，君子應靈活應對，因時制宜，方能順利前行。凡事順其自然，隨緣，做了讓自己高興就好，不要太強求。但切莫把隨緣當隨便，否則事情會敗壞。",
    "explanations": {
      "運勢": "因為得失無常，所以清靜無為，順其自然，是最佳策略。運勢尚可，靈活應變可獲良機。",
      "感情": "大吉。夫唱婦隨。感情隨緣發展，勿強求，順勢而行。",
      "財運": "財運穩定，適合隨市場變化調整策略。",
      "工作": "有兩面難以取捨的情況。不要有太大得失心，隨緣就好。工作需隨機應變，靈活調整方向。",
      "買賣": "交易需把握市場變動，適時行動。",
      "考試": "考試運普通，需隨時檢討學習方法。",
      "健康": "健康需注意環境變化，適時調養。",
      "訴訟": "訴訟進展可變，宜保持彈性應對。",
      "尋人": "尋人可能需改變尋找策略，靈活應變。",
      "尋物": "尋物需細心留意周遭變化。",
      "旅行": "旅行可隨心選擇路線，靈活安排。",
      "人際": "人際關係需隨和應對，廣結善緣。",
      "卦辭": "隨，元亨利貞，无咎。\n《彖》曰：隨，剛來而下柔，動而說，隨。大亨貞，无咎，而天下隨時，隨時之義大矣哉。\n《象》曰：澤中有雷，隨。君子以嚮晦入宴息。\n\n隨從，德善匯聚而宜於貞定，則可免於罪咎。隨卦的元亨利貞，是做為无咎的條件。無咎者有咎者也，善補過方得無咎。\n\n【卦旨】隨為隨從、隨順，那是別人隨從自己還是自己隨從別人呢？隨卦的隨是指自己隨從別人，為何呢？因只有自己隨從別人、別人才會來隨從你，最後才能彼此相隨，好比你幫助別人，日後你須幫助時，別人也會幫助你，揭示立身處世必須誠信守正、隨時而動、擇善而從的道理，並強調隨從、隨順當以堅持正道為基礎和前提。啟示我們維繫人際關係必須「以正相隨」的道理，為人行事千萬不可「趨炎附勢」或者「隨波逐流」。"
    },
    "yaoInterpretation": {
      "初九":"初九，官有渝，貞吉，出門交有功。\n《象》曰：官有渝，從正吉也；出門交有功，不失也。\n\n官員有變動，貞定則吉。出門與人相交，會有功。此言官員有變動，當以不變應萬變，貞定則吉，不變者就是守住自己的立場。反之，若到處鑽營，試圖奉承可能的新長官，那麼可能弄巧成拙。出門交有功，出門與人結交，寓指不在體制內去運作，走出框架，到外廣結善緣，則可以有收獲初九為震之主爻，震為變動，故曰「有渝」，渝即變。動則下爻成坤，全卦成萃，萃為聚，故曰「出門交有功」。",
      "六二":"六二，係小子，失丈夫。\n《象》曰：係小子，弗兼與也。\n\n綁住了小輩，卻跑走了尊貴的丈夫。比喻無法兩面兼顧，顧此失彼，所得者小，所失者大。《象》曰：「係小子，弗兼與也。」無法兩面兼得之義。六二與九五之君相應，但在「隨」卦裡爻與爻之間的關係卻以前後相隨為優先。六二雖然當位，但以柔乘剛，為逆為凶，與六三為同類相牽，因此為係小子（陰為小），而六二原本應當相應於九五，追隨於九五之君，但隨卦的情勢只讓它與六三同類相牽而失去了與九五的關係，所以說「失丈夫」。又六二動則下卦成兌，兌為損失，故曰「失丈夫」。",
      "六三":"六三，係丈夫，失小子。隨有求得，利居貞。\n《象》曰：係丈夫，志舍下也。\n\n綁住了尊貴的丈夫，跑走了小輩。追逐求取而有所獲得，利於處正。追到正確的方向而有所獲得，利於守正不變動。比喻雖然兩面無法兼得，但選擇正確的一邊，收獲豐盛，而抓到了丈夫。隨卦爻與爻之間以前後相隨的關係為優先，六三緊隨六二之後，與六二同為陰並不相應，而與外卦的上六也同樣不相應，此為「失小子」。緊隨六三之後的為九四，六三承載九四為順為吉，此為係丈夫。象曰：「係丈夫，志舍下也。」因為六三捨棄與下面陰爻而不與其攜手相連，因此能夠得到上面之陽爻。六三動，下卦由震成離，互體由巽變乾。離為擒獲之義，故「隨有求得」。巽為繩，乾為丈夫，因此係丈夫。",
      "九四":"九四，隨有獲，貞凶。有孚在道，以明，何咎？\n《象》曰：隨有獲，其義凶也；有孚在道，明功也。\n\n追逐將有斬獲，貞定則凶。很顯然的有俘虜在路上，怎會有罪咎？意指當追逐，追逐則會有斬獲，不會有罪咎。反之，若不追逐，貞定而原地不動則凶。隨為追逐的意思，孚為俘虜。或者解釋為隨從有所收獲，堅定為凶。有誠信，走的是大道，若能明哲不居功，有何罪咎？君子有人追隨、獲得人心，若堅定而行將因此遭凶。這是因為九四處近臣之位，下得民心則上得君王之猜忌而引來殺機。但若能夠明哲保身，歸功於上，將可免於罪咎。「有孚在道，以明」乃是告戒之辭，依此而行乃可免於罪咎。",
      "九五":"九五，孚于嘉，吉。\n《象》曰：孚于嘉吉，位正中也。\n\n信於美善則吉。象曰：「孚于嘉吉，位正中也。」此言所謂信於善則吉，是因為九五陽剛中正當位，所應六二陰柔亦當位。另也可解釋為有俘虜於嘉禮，吉。",
      "上六":"上六，拘係之，乃從維之，王用亨于西山。\n《象》曰：拘係之，上窮也。\n\n將他抓來囚禁，然後再將他釋放。大王在西山舉行享祀。此爻典故講的可能是西伯（周文王）被商紂拘禁再釋放的故事。西伯囚於羑里，在被釋放之後舉行饗宴以感謝各方幫助，或舉行祭祀以謝神明。亨通享，饗宴或祭祀的意思。"
    }
  },
  "100110": {
    "name": "蠱",
    "pinyin": "gǔ",
    "summary": "山風蠱，山間風行，革故鼎新。(小凶)",
    "detailed": "蠱卦象徵變革與修正，如風穿行於山間，能清除腐敗之物。君子應除舊布新，掃除障礙，開創新局。蠱卦面對的是一種沉疴已久的問題，所以不是解決眼前問題而已。所以在力精圖治、奮發有為的同時，重要的是必需重新擬定新的計畫，建立新的未來。",
    "explanations": {
      "運勢": "運勢較弱，已經出現腐敗，努力挽回，仍然大有可為。需先改革問題才能順利發展。",
      "感情": "感情關係可能有問題，需誠心修復。不倫之戀。受到蠱惑，意亂情迷。",
      "財運": "財運不穩，投資需謹慎，防止損失。",
      "工作": "工作上可能遭遇困境，需積極調整策略。不知所措。應力圖振作，重新規畫打算一翻。",
      "買賣": "交易過程可能有風險，需詳加審查。",
      "考試": "考試運一般，需修正學習方法。",
      "健康": "健康需特別注意，可能有舊疾復發之虞。",
      "訴訟": "訴訟有困難，宜調整策略，避免硬碰硬。",
      "尋人": "尋人較難，對方可能狀況不佳。",
      "尋物": "尋物不易，可能需改變搜尋方向。",
      "旅行": "旅行可能遇到阻礙，需做好萬全準備。",
      "人際": "人際關係需修正問題，避免持續惡化。",
      "卦辭": "蠱，元亨，利涉大川，先甲三日，後甲三日。\n《彖》曰：蠱，剛上而柔下，巽而止，蠱。蠱元亨，而天下治也；利涉大川，往有事也；先甲三日，後甲三日，終則有始，天行也。\n《象》曰：山下有風，蠱。君子以振民育德。\n\n整飭而可大亨，宜於涉水渡大河。事情創始的前三天就要準備，事情創始之後的三天也要檢討。後世將此句引申之，認為「甲」指的是有事（蠱）之後的革新，重新制定與施行一件事，也就是「重新開始」的意思。因為「甲」為十天干之首。「前三日」與「後三日」則是指施行要有規畫與思慮。因為能夠努力重新再來，所以事情雖然敗壞，仍然講「元亨利涉大川」。\n\n【卦旨】蠱義為事也，蠱卦中的事通常指壞事，也是說事敗壞到極點而導致壞事發生，壞事一般事由於缺點、錯誤或者弊病，長期不能改正導致，比如一人生了小病，但諱疾忌醫，從而導致小病變大病，最後因病逝命，揭示任何事物的發展都有一個衰敗的過程，須防患未然、知錯能改，並且在衰敗來臨時或發生前適時而動、隨機應變的道理。"
    },
    "yaoInterpretation": {
      "初六":"初六，幹父之蠱，有子，考无咎。厲終吉。\n《象》曰：幹父之蠱，意承考也。\n\n有兒子承擔父親的事，死去的父親不會有罪咎。艱苦則最終可得吉。父親未完成之事，幸賴有能幹的兒子能夠繼承父親的責任，讓做父親的死也瞑目。雖然艱苦而有危險，但最終為吉。初六承九二，有承父之象。又初爻動則成乾，乾為父，動而承父業。",
      "九二":"九二，幹母之蠱，不可貞。\n《象》曰：幹母之蠱，得中道也。\n\n承擔母親的事，不可以貞定於此。為人子者不適於承擔婦人的事，所以這種事不宜堅持。",
      "九三":"九三，幹父之蠱，小有悔，无大咎。\n《象》曰：幹父之蠱，終无咎也。\n\n承擔父親的事，有小小的後悔，但並無大罪咎。九三處多憂之位，動而成坎，坎為心病為憂心，故有悔。九三陽剛又當位，故其悔不大而小。此言努力要挽救父親之事，但難堪重任，因此而有些悔恨，但還不至於會有罪咎。",
      "六四":"六四，裕父之蠱，往見吝。\n《象》曰：裕父之蠱，往未得也。\n\n增加父親的事，以此前往則悔恨。此言六四無能，讓事態更加嚴重。",
      "六五":"六五，幹父之蠱，用譽。\n《象》曰：幹父用譽，承以德也。\n\n承擔父親的責任，能夠繼承父親的道德，藉以建立好的聲譽。六五雖柔而無能，但居於尊位，柔中而與九二相應，又承上九，得多方陽剛（喻君子、能人）之助，因此為吉。",
      "上九":"上九，不事王侯，高尚其事。\n《象》曰：不事王侯，志可則也。\n\n不用再為王侯做事，只以「高尚」為事業。居蠱卦的最頂端，蠱道已成，已經置身事外，天下本無事，所以不用再為王公做事，可以開始做自己。「高尚其事」謂以「高尚」為事業，志向高尚的人，不偶合於世俗，此為獨善其身，自得其樂之義。《禮記》引用孔子以此段經文談臣事君之道，並以「終事而退，臣之厚也」詮釋。"
    }
  },
  "000011": {
    "name": "臨",
    "pinyin": "lín",
    "summary": "地澤臨，澤水養地，貴人相助。(大吉)",
    "detailed": "臨卦象徵機會來臨，靠近，接近，如澤水流向大地，潤澤萬物。君子應抓住機會，積極行動，獲得發展。關心並督促事情要注意保持內心的喜悅，態度及手法的柔順。做事要能持續，不要虎頭蛇尾，則事情可到達新的境界。若半途而廢可能會帶來災難。",
    "explanations": {
      "運勢": "運勢大吉，貴人扶持，可順利發展。應當注意對事情的熱情只有三分鐘熱度。或者至八月（陰曆）會有災",
      "感情": "適合進一步發展關係。若有一方過於凌厲之象。應學習和悅和柔順。",
      "財運": "財運旺盛，可獲得額外收益。",
      "工作": "工作機會增加，適合求職或升遷。或者在組織之中，長官督促下屬。持續為宜，若不為，小人之勢將會反撲。",
      "買賣": "交易順利，市場環境有利。",
      "考試": "考試運佳，成績優異。",
      "健康": "健康良好，身心愉快。",
      "訴訟": "訴訟可獲貴人相助，有利結果。",
      "尋人": "尋人順利，對方狀況良好。",
      "尋物": "尋物容易找回。",
      "旅行": "旅行順利，適合出行。",
      "人際": "人際關係良好，貴人臨到相助。",
      "卦辭": "臨，元亨利貞，至于八月有凶。\n《彖》曰：臨，剛浸而長，說而順，剛中而應，大亨以正，天之道也；至于八月有凶，消不久也。\n《象》曰：澤上有地，臨。君子以教思无窮，容保民无疆。\n\n大人親臨治理，大亨通，利於貞定。到八月會有凶。臨卦卦象為陽氣逐漸增長，內悅而外順，九二以剛居中而與六五相應，因此大亨通以貞定。之所以說「八月有凶」，因為八月為陽氣消退之時。此乃告戒之辭。雖然現在是陽氣增長的時候，但到了八月，陽氣消退，陰氣增長，小人得位，君子失道，為人臣者殺害君王。八月有凶是一種警惕，陽氣沒有一定增長的道理，應未雨綢繆，在承平之世就要有所戒備，才能長治久安。另一種解讀，臨為陽長之卦，八月為陰長陽消，八月有凶比喻人當持續陽氣之增長，若有如八月陽氣不長反退，那麼就有災難。\n\n【卦旨】臨為監臨，指居高臨下，往往給人一種逼迫、侵犯的感覺，可引申為統治、管理、面臨、監臨等意，揭示在上者對下進行治理時，必須彼此溝通、運用智慧，寬厚包容的態度，而不能依靠巧言誘騙的道理。是為儒家的治人之術。"
    },
    "yaoInterpretation": {
      "初九":"初九，咸臨，貞吉。\n《象》曰：咸臨貞吉，志行正也。\n\n感化式的治理，剛正而且地位正當。貞正則吉。陽為大，陰為小，初九與九二皆為大，監臨四陰之大人。初九剛正而當位，與四相應，所以貞吉。",
      "九二":"九二，咸臨，吉，无不利。\n《象》曰：咸臨吉无不利，未順命也。\n\n嚴格的治理，吉無不利。九二「咸臨」當作「鹹臨」，鹹為苦的意思，鹹臨即「苦臨」，嚴苛的監臨、治理。九二上為四陰所乘，又是剛長近逼四陰的陽爻（象官長），因此有嚴苛之象。相較於初九的感化管理，六三的輕鬆放任管理，九二最近四陰而能嚴格管理，處中而多譽之位，因此吉無不利。傳統解釋認為，九二與初九同樣為有感之臨，認為九二是具有中庸之德的一爻，又與六五相應，因此說「吉，無不利」。",
      "六三":"六三，甘臨，无攸利；既憂之，无咎。\n《象》曰：甘臨，位不當也，既憂之，咎不長也。\n\n輕鬆的治理，沒什麼利益。既然知道要憂慮，就能免於罪咎。六三失位乘陽而無應，處下兌口之位，兌為說為悅，以好話取悅人之象。此為鄉愿式的視察，無監臨之實質功效。兌為無利之象，故曰無攸利。不過若能夠知道憂慮，那麼還可免於罪咎；反之，如果不知憂慮，就有罪咎。六三為多憂之地，所以說「既憂之」。六三爻動全卦成泰，因此憂而動之則無咎。",
      "六四":"六四，至臨，无咎。\n《象》曰：至臨无咎，位當也。\n\n親臨現場的治理，沒有罪咎。六四當位，與初九相應。",
      "六五":"六五，知臨，大君之宜，吉。\n《象》曰：大君之宜，行中之謂也。\n\n睿智的治理，君王德政，吉。此言君王行事合宜而有睿智。六五為君位，柔順得中，又與九二相應，是能夠接納諫言與容納賢才之君王。象曰：「大君之宜，行中之謂也。」因六五居中爻。",
      "上六":"上六，敦臨，吉，无咎。\n《象》曰：敦臨之吉，志在內也。\n\n敦厚篤實的治理，吉，沒有罪咎。上六高而無位（沒有地位），但本性柔順。坤土為敦厚之象，特別是上爻。如復卦六五曰「敦復」，艮卦上爻曰「敦艮」（上九變成坤）。"
    }
  },
  "110000": {
    "name": "觀",
    "pinyin": "guān",
    "summary": "風地觀，風行草偃，靜觀其變。(中吉)",
    "detailed": "觀卦象徵觀察與省思，遙遠，如風吹拂大地，君子應仔細觀察時局，謹慎行動，避免輕率。觀卦的吉道在於能夠接近事情的核心，並用心去觀看事情的發展，從中充實自己。反之，若是無法接近事情好好觀察，為凶。而若接近了，只是外行看熱鬧也是枉然。",
    "explanations": {
      "運勢": "凡事虔誠而用心的觀看、學習，自然能有所獲得。運勢尚可，宜觀察局勢，不宜貿然行動。",
      "感情": "單戀而遠觀的愛情。感情關係需深入了解，避免盲目投入。",
      "財運": "財運穩定，投資需審慎決策。",
      "工作": "用心觀摩上司或別人怎麼做，能有所幫助。工作宜耐心學習，等待時機展現實力。",
      "買賣": "交易需詳細評估，不宜衝動決策。",
      "考試": "考試運普通，需冷靜應試。",
      "健康": "健康狀況尚可，宜注意保養。",
      "訴訟": "訴訟進展緩慢，需觀察變化後再行動。",
      "尋人": "尋人需冷靜判斷對方行蹤。",
      "尋物": "尋物可透過仔細觀察找到。",
      "旅行": "旅行需詳加規劃，或多觀察環境、以免發生變數。",
      "人際": "人際關係宜謹慎應對，避免輕信。",
      "卦辭": "觀盥而不薦，有孚顒若。\n《彖》曰：大觀在上，順而巽，中正以觀天下。觀盥而不薦，有孚顒若，下觀而化也。觀天之神道，而四時不忒，聖人以神道設教，而天下服矣。\n《象》曰：風行地上，觀，先王以省方，觀民設教。\n\n觀看祭典，就要看澆灌香酒請神最隆重的一段，這時與祭者最為虔誠而莊嚴。至於後面奉獻牲禮開始就沒什麼好看的。此比喻觀禮要虔誠與用心。\n\n【卦旨】觀為觀察瞻仰，為上示下瞻之意，何謂上示下瞻呢？這包含兩層涵義，所謂上示為上位者以中正示人，給下位者樹立榜樣，所謂下瞻指在下位者深受上位者的感化，仿效上位者的言行舉止，瞻仰仰視上位者，而上示為下瞻的前提條件，也就是說只有上位者以中正示人，才會有後面的下位者敬仰效仿，揭示美好事物感化人心的重要意義，以及自我省察修美德行、觀察下情以正其道、培養遠大政治眼光的道理。"
    },
    "yaoInterpretation": {
      "初六":"初六，童觀，小人无咎，君子吝。\n《象》曰：初六童觀，小人道也。\n\n童僕或兒童的觀點，小人沒有罪咎，君子就很可鄙。言初六之觀禮有如僕童或兒童，所觀膚淺、淺薄，從頭到尾不知道祭典在做什麼。小人如此無可厚非，故曰無咎。君子如此則不識大體，可鄙而有吝，吝者言其小疵而趨近於凶。初六距離九五最遠，與上體又無繫應，無法觀祭的一爻，此有如小孩或童僕之觀看祭典一樣，完全是「外行人看熱鬧」，不知在看什麼。對小老百姓、小人來說，這原本就沒什麼罪咎可言，反正就是去湊熱鬧。但是對於那些高官、君子而言，觀看祭典卻遠離現場而不能進入狀況，則是很可鄙的事。",
      "六二":"六二，闚觀，利女貞。\n《象》曰：闚觀女貞，亦可醜也。\n\n從門縫看祭典，只適於女子的貞靜。從門縫窺探祭典，所看非常偏狹而不完整。對女性而言，這樣的行為與胸襟無傷大雅，因此說有利於守貞守靜的女性。但此亦告戒君子，行為與心胸不當有如三姑六婆以窺探他人私事為業，應當志在四方，放眼外面的大世界，注重大的問題與事情。或者隱喻，君子看事不當以管窺天。",
      "六三":"六三，觀我生，進退。\n《象》曰：觀我生進退，未失道也。\n\n開始觀看自己的行為，面臨進退的決定。對於祭典既無法像小老百姓一樣漠不關心，又無法像國賓一樣直接參與，居於進與不進，退與不退的決定之間。三已較初、二更近九五之君，又與上九相應，因此是可參與祭典者。但所應的上九並非主祭的君王，再加上六三以陰居陽不當位，代表身份參與祭典並不洽當。三又是多凶之位，上有互體艮山止於前，所以前往觀看有許多難處。因此有進退之象，只能視自己的情況而決定是否參與祭典。",
      "六四":"六四，觀國之光，利用賓于王。\n《象》曰：觀國之光，尚賓也。\n\n觀看國家之光，受邀成大王的貴賓。直接參與盛會的觀眾，也是祭典的上賓，所以可以目睹一切的慶典盛事。利於去拜訪別人的國家，將被視為上賓。觀卦中能夠觀看祭典最清楚，位置最好的，就是六四一爻。因四為近君之位，就在國君旁邊，六四又承九五之君，因此為國家貴賓。所觀看者最近而最詳。",
      "九五":"九五，觀我生，君子无咎。\n《象》曰：觀我生，觀民也。\n\n自我觀察，自我反省，君子因此可免於罪咎。九五是舉辦慶典的主人，也是大家所觀摩的對象，但是另一方面也在自我觀看。此言君子當反身自省，則可免罪咎。三與五同功，故皆曰觀我生。",
      "上九":"上九，觀其生，君子无咎。\n《象》曰：觀其生，志未平也。\n\n觀看他人的行為，君子沒有罪咎。上九雖然高而無位，但也是高高在上。此言上九觀九五之行為。傳統以觀我生為君王之自觀，觀其生為君子或君王為民所觀。"
    }
  },
  "101001": {
    "name": "噬嗑",
    "pinyin": "shì kè",
    "summary": "火雷噬嗑，火焚雷震，斷惡除障。(中吉)",
    "detailed": "噬嗑卦象徵指一口咬下食物後，碰到了硬物，有所阻礙，但如火焚燒雷聲震，代表以決心斷絕不良影響，掃清障礙，迎接光明。得噬嗑卦凡事能小有獲得，但需要明察秋毫、明辨是非的能力，除了解決中間可能遇到的困難，更要能分清什麼是該得，什麼是不該得的，以免因得而惹禍上身。",
    "explanations": {
      "運勢": "可以小有獲得。但要防因得而召禍。運勢尚可，需果斷行動，排除阻礙。",
      "感情": "剛強好勝有些摩擦，需要摩合。感情關係需溝通解決問題，方能穩定發展。",
      "財運": "財運較好，需去除不必要的開銷。",
      "工作": "有困難待解決。工作上需整頓混亂，重新規劃發展方向。",
      "買賣": "交易過程中可能有障礙，需耐心克服。",
      "考試": "考試運勢普通，需專注於解決弱點。",
      "健康": "健康需注意飲食，避免消化系統問題。",
      "訴訟": "訴訟進展有起伏，需找出關鍵問題解決，便能亨通。",
      "尋人": "尋人可能有難度，需尋找突破點。",
      "尋物": "尋物需排除干擾，專注尋找。",
      "旅行": "旅行中可能有小問題，但可克服。",
      "人際": "人際關係需斷絕不良影響，慎選交友。",
      "卦辭": "噬嗑亨，利用獄。\n《彖》曰：頤中有物，曰噬嗑。噬嗑而亨，剛柔分，動而明，雷電合而章，柔得中而上行，雖不當位，利用獄也。\n《象》曰：雷電，噬嗑，先王以明罰勑法。\n\n噬嗑而能夠亨通，利於使用刑罰之事。噬嗑之所以能亨通，是因為威與明並濟，剛柔分明，主動而聰明（內震動外離明），要有明察秋毫的能力再加上執行的魄力才能夠亨通。獄指的是刑罰之事，這是最難決斷者，一定要果決而聰明者才能夠勝任。利用獄，隱喻所遇到的是棘手而艱難的事，若能剛柔並用，明察秋毫，則能夠處理得宜。\n\n【卦旨】噬嗑為咬合，從卦象來看如同一張嘴的形象，上九與六五爻像上嘴唇與上排牙齒，初九與六二、六三爻為下嘴唇與下排牙齒，而中間六四爻為嘴裡梗塞之物，梗塞之物阻礙嘴巴合攏，所以必須將梗塞之物用力咬碎才能使嘴巴合攏，揭示咬合意味著阻礙事物發展的障礙能得以清除，從而能使事物能通暢順利發展，也表示施用刑罰必須確定法令、明察果斷、剛柔並濟的道理，體現了中國早期關於法治的思想原則。"
    },
    "yaoInterpretation": {
      "初九":"初九，屨校滅趾，无咎。\n《象》曰：屨校滅趾，不行也。\n\n受刑而斷了腳趾，沒有罪咎。腳被戴上刑具而斷了腳趾，一開始就遭受小懲，不會繼續犯下殺身的大錯，所以沒有罪咎。初九爻位處最卑微之位，又居震初，與上無應，位卑而妄動之象。在行動之初就因犯錯而受到刑罰，因為小事受到懲罰而免於更大的過錯，所以何嘗不是因禍得福，能改過則可免於後悔。孔子以「小懲而大戒」詮釋這段經文。",
      "六二":"六二，噬膚滅鼻，无咎。\n《象》曰：噬膚滅鼻，乘剛也。\n\n吃肉犯法而遭受割鼻的刑罰，沒有罪咎。噬膚滅鼻也可指吃到好吃的膚肉以致於鼻子埋在器皿中，朱熹認為這是比喻所斷之案件簡單容易。但或可能用以形容人吃相難看。",
      "六三":"六三，噬腊肉，遇毒，小吝，无咎。\n《象》曰：遇毒，位不當也。\n\n吃到乾硬的腊肉，有陳年臭味的肥脂，小小悔恨，沒有罪咎。此言腊肉中有毒而誤食。不過只是小小的過錯，不致於有太大的罪咎。此或比喻遇到陳久而棘手的老案件，很難處理。毒隱喻人之積怨，心生不服。",
      "九四":"九四，噬乾胏，得金矢，利艱貞，吉。\n《象》曰：利艱貞吉，未光也。\n\n吃到乾硬而帶骨的肉，得到金屬箭頭的幫助，若能夠辛苦而守正則吉。吃到了骨邊的乾肉，此乾肉雖然味道最為豐富但卻也是很難處理之物；然而有了金屬做的箭頭可以切肉。現在雖艱辛坎坷，其中滋味也是無窮，吉。比喻事情艱難、錯綜複雜而不好應付，但若能努力辛苦好好處理則吉。",
      "六五":"六五，噬乾肉，得黃金。貞厲，无咎。\n《象》曰：貞厲无咎，得當也。\n\n吃到乾肉，得到黃金，堅貞而艱苦則可得無咎。乾肉比膚肉還要乾硬，但又不像乾胏那般帶骨而麻煩，有點難咬但又不是太難，只須多加咀嚼就可入口。此比喻事情有點困難又不會太困難。但也因為不難不易而更容易因此讓人心生怠慢而有所疏忽，所以斷案者必須要符合「黃金」之德，黃象徵中庸，金為陽剛堅硬，也就是秉持公正而剛正嚴明，同時還要貞定而艱苦，如此才能避免犯錯而後悔。",
      "上九":"上九，何校滅耳，凶。\n《象》曰：何校滅耳，聰不明也。\n\n罪刑重大而導致枷鎖套到頭上，耳朵被割，凶。滅耳象徵失去聰明，所以《象傳》說「聰不明也」。"
    }
  },
  "100101": {
    "name": "賁",
    "pinyin": "bì",
    "summary": "山火賁，山火相交，內外兼修。(中吉)",
    "detailed": "賁卦象徵修飾與美化，如山上燃起火光，帶來光亮與莊重之美。君子應注重內外兼修，以美德提升自身價值。卜得賁卦只適宜做小事，不宜做大事，而且既使有成，也只是小成，過程也不會太平順。賁卦最好不要矜持過度，以致於黑白不分。",
    "explanations": {
      "運勢": "小事吉，大事凶。私事可成，公務不亨通。運勢尚佳，形象與禮儀影響發展。",
      "感情": "感情關係和諧，外在形象亦影響進展。婚姻可成。但過程並不是很順利，會有插曲、疑慮。",
      "財運": "財運穩定，宜以誠信經營。",
      "工作": "工作順利，注重細節與形象有助提升。做小事可以。大事凶。要注意，不要公私不分。",
      "買賣": "交易需包裝產品或服務，提高吸引力。",
      "考試": "考試運普通，細心準備有助提升表現。",
      "健康": "健康狀況良好，適合改善外在形象。",
      "訴訟": "訴訟宜調整策略，注重形象與公信力。",
      "尋人": "尋人可得，對方可能在人際關係圈內。",
      "尋物": "尋物需仔細回想存放處。",
      "旅行": "旅行順利，適合觀賞文化藝術。",
      "人際": "人際關係良好，宜提升談吐與形象。",
      "卦辭": "賁亨，小利有攸往。\n《彖》曰：賁亨。柔來而文剛，故亨。分剛上而文柔，故小利有攸往，天文也。文明以止，人文也。觀乎天文，以察時變，觀乎人文，以化成天下。\n《象》曰：山下有火，賁。君子以明庶政，无敢折獄。\n\n文飾而能亨通，若是小事，利於有所往。反之，大事則不吉。陰為小，賁卦六爻中陰爻才得以利於有所往，即六四的「白馬翰如，匪寇婚媾」。陽爻則不宜於動。此初九之舍車而徒，九三之永貞吉（貞為定），上九之白賁無咎。彖「柔來而文剛」指六二，「來」為由外到內，言六二之柔從外至內以美化初九與九三兩個剛爻，故亨。「分剛上而文柔」指上九，從乾體分出由內至外，到上面文飾了六四和六五兩個柔爻，故小利有攸往。《彖》傳此說認為賁卦是從泰卦而來，泰卦上六至二為文剛，九二至上位以文柔。\n\n【卦旨】賁為文飾，文飾要把握好一個度，需做到恰到好處，文飾是為了將事物的本質更美好的表現出來，是對本質的修飾，從本末的角度來講本質才為根本，而文飾只是枝節末葉，所以千萬不可本末倒置，此卦辭爻辭所講述的文飾最高境界為「素」，也即反璞歸真，正所謂天水去芙蓉，天然去雕飾，揭示剛柔相雜而成文、社會以禮儀構成文明的道理，並體現了文以輔質、崇尚淳樸自然之美的觀點。"
    },
    "yaoInterpretation": {
      "初九":"初九，賁其趾，舍車而徒。\n《象》曰：舍車而徒，義弗乘也。\n\n文飾在腳，捨棄乘車，選擇步行。此言君子有所不為，縱使有車可乘，也因為義理上不應坐車，而情願步行。初為趾，也代表行為、行動的開始。引申為一開始就有所不為，隱喻君子慎於始。原本有車可乘是個榮寵，理當接受。但是自覺於道義上不當接受，所以文飾其行為，選擇步行而不乘車。",
      "六二":"六二，賁其須。\n《象》曰：賁其須，與上興也。\n\n打扮其陪嫁女。須比喻只是配角，只能當做是別人的裝飾。就整個賁卦來看，各爻講的像是一個求婚或婚禮的過程，那麼「賁其須」講的可能是陪嫁之女，或指家中老者高興而整理鬍鬚準備參加婚禮。但無論須是陪嫁女或老者，都不是婚禮主角，只是在一旁高興熱鬧。另有一說認為，須指的是馬匹的鬃毛。六二處下離卦黃中之位，為附麗二陽之陰，承於九三，因此是為九三之附屬。",
      "九三":"九三，賁如濡如，永貞吉。\n《象》曰：永貞之吉，終莫之陵也。\n\n文飾相當盛大而美麗，應當免於耽溺，能夠永保貞定則吉。包裝裝飾得極為漂亮，然而文勝質則史，不能過度追求外表的榮華，應更加堅守自己的內在美德，才能永保現在的成就。九三雖是多憂之位，但處下體離卦之頂，為六二所承載與文飾，所以是賁卦中裝飾最為隆盛者，故曰「賁如」。居互體坎中，故曰「濡如」。濡有耽溺之義，所以戒君子要以永貞才可得吉。",
      "六四":"六四，賁如皤如，白馬翰如，匪寇婚媾。\n《象》曰：六四當位，疑也；匪寇婚媾，終无尤也。\n\n要化妝打扮？還是樸素不打扮？讓人相當困擾。白馬飛奔而至，來者不是盜賊，而是來求婚者。此言婚合過程中內心的困惑與疑慮。象曰：「六四當位，疑也。」六四為多疑懼的爻位，又當互體坎之上，坎為心病，為疑象。互體震之中，上體艮之下，於體欲動又為艮山所止，爻動而後互體又有巽，所以為進退不果。",
      "六五":"六五，賁于丘園，束帛戔戔，吝，終吉。\n象》曰：六五之吉，有喜也。\n\n裝飾山丘上的家園，然而做為幣聘之禮的布帛過於簡單，顯得小氣吝嗇，不過最終還是圓滿而吉。這段有兩種解釋。一是認為談的是婚聘之事，繼六四「匪寇婚媾」而來。過程當中對於聘禮雙方有些認知的誤會因而有些不快，但最終還是解決了，圓滿結束。另一種解釋認為這是君子到山中請隱士出仕任聘。傳統解易者普遍認為，這一爻講的是如何招聘山中隱士，賁於丘園指隱士隱居山林，而束帛戔戔是招聘的禮物。但當代許多以訓詁及古代風俗學等觀點研究易學的學者認為，賁卦講的都是婚姻之事，如六四是搶婚，而這裡講的是下聘。這樣的觀點從《象》曰「六五之吉，有喜也」可得到印證。",
      "上九":"上九，白賁，无咎。\n《象》曰：白賁无咎，上得志也。\n\n以最為樸素的白色當做裝飾，沒有罪咎。傳統詮釋為以樸素為裝飾，反樸歸真之義。上九處外卦艮的最頂點，艮是停止的意思，又有樸素的意思，就整個賁卦來說則是文飾的最頂端，因此有裝飾到極點反轉為樸素，返樸歸真，以最樸素的白色做為裝飾也是「不裝飾之裝飾」。這也是《雜卦》所說的「賁，无色也」。"
    }
  },
  "100000": {
    "name": "剝",
    "pinyin": "bō",
    "summary": "山地剝，山附于地，損害凋零。(凶)",
    "detailed": "剝卦象徵事物衰敗，如山被侵蝕，逐漸剝落。君子應謹慎行事，避免陷入危機，並尋求轉機。剝卦為陽氣即將被剝盡的時候，諸事不宜。只能靜待時機，等待時局轉變，事情進入另一個循環時再重新開始。",
    "explanations": {
      "運勢": "諸事不宜，最好那裡都不去，應避遠行。運勢低迷，事業與人際關係可能受損。",
      "感情": "感情關係可能遭遇變故，需審慎處理。風流不專，不知節制",
      "財運": "財運不佳，避免高風險投資。",
      "工作": "敗壞走下坡，每況愈下。工作易遇困境，宜保守行動。",
      "買賣": "交易市場低迷，不宜冒險擴張。",
      "考試": "考試表現可能不佳，需加倍努力。",
      "健康": "健康需特別注意，可能有體能下降的跡象。",
      "訴訟": "訴訟不利，應考慮退讓或調解。",
      "尋人": "尋人困難，可能已遠離原處。",
      "尋物": "尋物可能難以找回，宜放棄。",
      "旅行": "旅行不順，易遇困難，宜延期。",
      "人際": "人際關係受損，宜低調謹慎應對。",
      "卦辭": "剝，不利有攸往。\n《彖》曰：剝，剝也，柔變剛也。不利有攸往，小人長也。順而止之，觀象也。君子尚消息盈虛，天行也。\n《象》曰：山附于地，剝，上以厚下安宅。\n\n剝爛，不宜遠行。不宜出門。剝卦六爻講的是房舍（廬）由內到外開始剝爛的過程。初爻從房舍最不起眼、最深之處的牀腳開始剝爛，然後剝爛到牀瓣，直至上爻「小人剝廬」而整個房舍剝落。剝為陰氣增長將剝除最後一陽的時候，因此剝之時義，需得陽氣之助。六三因為與上九主爻相應，因此說無咎，六五則與上九比應，所得陽氣最多，因此說「貫魚以宮人寵無不利」。上九雖是將被剝除之陽爻，但下有五陰承應，因此對於君子來說，剝卦仍有得眾之吉應。\n\n【卦旨】剝義為剝落，揭示陰盛陽衰，小人得勢、君子困頓之時，應當守正防凶以待來日的道理。同時，也揭示了事物剝極將復、不利局面終將轉化的客觀規律。"
    },
    "yaoInterpretation": {
      "初六":"初六，剝牀以足，蔑貞，凶。\n《象》曰：剝床以足，以滅下也。\n\n牀腳開始剝爛，失去貞定則凶。初為足為趾，又初六動，下體成震，震為足。初和足也都象徵事情的開始，此為剝落的開始。牀腳開始剝爛，可以安睡休息的地方受到威脅，這時候應當注意接下來將面臨的災難。牀足又象徵剝爛於不起眼處。",
      "六二":"六二，剝牀以辨，蔑貞，凶。\n《象》曰：剝床以辨，未有與也。\n\n牀剝壞到床板，失去貞定，凶。辨為牀板。足是支撐床的地方，辨則是與人體接觸，讓人所安睡休息的平台。剝床以辨比喻災害就在近身之處。六二動下卦成坎，坎為險為憂心。",
      "六三":"六三，剝之无咎。\n《象》曰：剝之无咎，失上下也。\n\n剝爛，沒有罪咎。六三動，下體成艮，則剝勢有暫止之象，因此曰無咎。來知德：「眾陰方剝陽而三獨與之為應，是小人中之君子也。去其黨而從正，雖得罪于私黨，而見取于公論，其義无咎矣。」剝卦為眾陰剝去最後一陽氣的過程，六三與上九相應，小人中的君子，能夠棄暗投明，因此無咎。",
      "六四":"六四，剝牀以膚，凶。\n《象》曰：剝床以膚，切近災也。\n\n牀已經剝爛到肌膚，凶。比喻大難已經臨頭，災禍直接降臨在身上，當然為凶。",
      "六五":"六五，貫魚，以宮人寵，无不利。\n《象》曰：以宮人寵，終无尤也。\n\n後宮嬪妃有如魚貫般很有秩序的排列，受到寵愛，無往不利。六五處五個陰爻的最上面，帶領五陰承一陽（陰承陽為順為吉），有宮廷后妃魚貫覲見而受寵之象。雖然身處小人堆裡，但是可以率領眾人聽從並追隨於君長，小人聽命於君子、下屬聽命於上司，吉，無不利。就小人的觀點來說，意謂可以受到上面的寵愛，當然為吉。就君王的觀點來說，則代表能夠把內宮或所屬的部下，管理得當，小人不至做亂，井然有序。",
      "上九":"上九，碩果不食，君子得輿。小人剝廬，終不可用也。\n《象》曰：君子得輿，民所載也，小人剝廬，終不可用也。\n\n豐碩的果實無法食用，君子能得到群眾，小人房舍毀壞，最後無法使用。豐碩的果實落地腐爛而無法享用，君子會找解決應變之道，因此而得到群眾。對小人而言，只顧自己一時生計，終究不會利用，所以最終有房舍剝爛的危機。君子明天道盈虛，順天時而行，因此可得輿而行。小人則只知眼前短利，因此剝廬而不可用。碩果不食卦象有兩種解釋，一是艮為碩果，上九為艮之主爻，因此言碩果。剝卦為艮在地上，為碩果落於地，碩果不食之象。另一解釋以爻象來看，陽為實，上九單獨一個陽爻高高掛在五陰之上，有如深秋果樹將剝盡最後的一顆果實。這最後一顆果實落地歸根後，將從地中再生起，即為復卦的一陽在下，開始另一生命之循環。"
    }
  },
  "000001": {
    "name": "復",
    "pinyin": "fù",
    "summary": "地雷復，雷返歸地，失而復得。(中吉)",
    "detailed": "復卦象徵循環與回歸，雷為「動」、「春」、「生機」在地下，象徵往而有復，依時回歸，萬物回歸原點。君子應珍惜機會，把握重新開始的可能。此時適於閉關休養生息。凡事莫心急，在最冷的冬天裡，生機暗藏，只需等待春天一到，就會欣欣向榮。",
    "explanations": {
      "運勢": "眼前不順，但長期可平安亨通。運勢回升，過去失去的機會可能重現。",
      "感情": "降到冰點，但或可重新再來，感情關係有復合的可能，需誠心面對。",
      "財運": "財運逐步回升，宜審慎理財。",
      "工作": "黎明前的黑暗，可靜候佳機。工作機會再次出現，應珍惜並努力。",
      "買賣": "交易可回暖，宜尋求回頭客。",
      "考試": "考試運勢改善，努力可獲佳績。",
      "健康": "健康逐漸好轉，適合進行調養。",
      "訴訟": "訴訟可能有轉機，宜積極爭取。",
      "尋人": "尋人有望成功，對方可能返回原地。",
      "尋物": "尋物可望找回，宜重點搜尋曾放置之處。",
      "旅行": "旅行適宜，可能有意外驚喜。",
      "人際": "人際關係改善，舊識可能重新聯繫。",
      "卦辭": "復，亨，出入无疾，朋來无咎。反復其道，七日來復，利有攸往。\n《彖》曰：復，亨。剛反，動而以順行，是以出入无疾，朋來无咎，反復其道，七日來復，天行也。利有攸往，剛長也。復，其見天地之心乎。\n《象》曰：雷在地中，復，先王以至日閉關，商旅不行，后不省方。\n\n回到家而能亨通。進出家門都平安無事，朋友將來，不會有罪咎。回到家的行程，需要七天的時間。利於有所往。得復卦雖出入平安，無災無難，利於出行，但《象傳》説：「雷在地中，復，先王以至日閉關，商旅不行，后不省方。」所以復卦到底是「利有攸往」，宜於遠行，還是應當閉關而不當出門？這邊重點在於「復」，利有攸往前往的是那裡？回家，所以利有攸往是要盡快動身回家的意思。回家又有改過遷善，回到根本的隱喻。因此，處復之時，雖然出入可以平安，利有攸往，但還是不當出遠門，而宜於閉關靜養，休養生息。有所往應該特別指的是家，而不是家之外的其他目的地。\n\n【卦旨】復有復生之意，此卦揭示陰氣消退，陽剛正氣逐漸回復，所以復卦的復又有返回與復歸之意，此乃天地生生不已的必然規律，吿誡君子應當復善趨仁、堅持正道，不可迷入歧途的道理。"
    },
    "yaoInterpretation": {
      "初九":"初九，不遠復，无祗悔，元吉。\n《象》曰：不遠之復，以脩身也。\n\n不遠就回來，不至於後悔，大吉。初九為動之初，一出門就回來，所以說「不遠復」。又內為近，初為最近之位，「不遠」之象。此比喻人一知道過失，就馬上改過遷善，故不至於後悔。",
      "六二":"六二，休復，吉。\n《象》曰：\n\n一路順風，漂亮的回到家！吉。六二雖然乘剛，但復卦重在改過能及早。二不但處內卦，而且具有中正之德，因此是自然而能改過者。因此以休美形容之。",
      "六三":"六三，頻復，厲，无咎。\n《象》曰：頻復之厲，義无咎也。\n\n憂心而回家，艱苦，但無罪咎。因為擔心有危險而回家，沒有罪咎。因為遇到挫折而改過遷善，雖然有危險，但終究還是不會有罪咎。三為多凶之位，三變而成互體之坎中，為憂心之象。",
      "六四":"六四，中行獨復。\n《象》曰：中行獨復，以從道也。\n\n自己走中央大道回家。此比喻君子特立獨行，不茍同於世俗而能秉持正道。因六四為群陰中唯一與初九陽爻相應者，變而上體成震，故曰「中行」。",
      "六五":"六五，敦復，无悔。\n《象》曰：敦復无悔，中以自考也。\n\n敦厚老實地回家，無悔。象曰：「敦復无悔，中以自考也。」敦復之所以無悔，是因為內心會自己反省改過。坤為厚載，敦厚之象。如臨卦上卦為坤，上六亦曰敦臨。敦復或可解釋為敦厚之人回家，敦厚之人心思少，一但出門，時間到了自然而然一定會回家，言老實淳樸之人，心思單純而無心機，或有犯錯，也很自然的會改過。敦亦通諄，勤勉、勉勵。敦復為勤勉式的改過。",
      "上六":"上六，迷復，凶，有災眚，用行師，終有大敗，以其國君，凶，至于十年不克征。\n《象》曰：迷復之凶，反君道也。\n\n迷路而回不到家，凶，有災禍。出師打仗最後大敗，殃及國君，凶，十年都無法再出征。此喻人迷途而不知返，一路錯到底。因上六離初九最遠，與內亦無應，迷而不返之象。復卦是「至日閉關，商旅不行，后不省方」的時候，當休養生息，出師則有違復道，因此為大凶。"
    }
  },
  "111001": {
    "name": "無妄",
    "pinyin": "wú wàng",
    "summary": "天雷無妄，天下雷行，順其自然。(中吉)",
    "detailed": "無妄卦象徵順應自然，行事不強求，如雷動於天，不因妄念而行。君子應誠實守道，順應天命。不要因為遇到災難而怨天尤人，甚至進一步胡作非為，否則事情會更糟而無法收拾。凡事守靜，循規蹈矩自可渡過難關。",
    "explanations": {
      "運勢": "無可逃的災難，守靜為宜，不宜出門。行為不正一定會有更大的災難。運勢尚可，宜保持真誠，順勢而行。",
      "感情": "彼此無可挑惕，但又八字不合。感情需自然發展，不宜過於勉強。",
      "財運": "財運穩定，不宜投機取巧。",
      "工作": "有凶險，但更應循規蹈矩。工作應按部就班，不宜急於求成。",
      "買賣": "交易需誠信經營，勿貪圖僥倖。",
      "考試": "考試運勢一般，需腳踏實地準備。",
      "健康": "健康平穩，宜保持規律生活。",
      "訴訟": "訴訟宜據理力爭，誠實以對。",
      "尋人": "尋人順利，對方可能狀況安穩。",
      "尋物": "尋物可望找回，需靜心回想。",
      "旅行": "避免戶外旅行，但需隨遇而安。",
      "人際": "人際關係穩定，宜真誠相待。",
      "卦辭": "无妄，元亨利貞。其匪正有眚，不利有攸往。\n《彖》曰：无妄，剛自外來而為主於內，動而健，剛中而應，大亨以正，天之命也，其匪正有眚，不利有攸往。无妄之往，何之矣？天命不祐，行矣哉？\n《象》曰：天下雷行物與，无妄，先王以茂對時育萬物。\n\n發生意想不到的事情，大亨通而宜於貞定。若是行為不正則會有災禍，不利出門或遠行。無妄為突然發生意想不到的事，發生意外。\n\n【卦旨】無妄是不妄為、不虛妄，不虛妄就是「實」，揭示立身處世必須真實自然不虛偽做作，合乎情理而不荒誕不惊，誠實本分而不妄為，做人切實而不心從妄想的道理，同時對吉凶禍福之深不可測亦應該防患於未然，早做準備。"
    },
    "yaoInterpretation": {
      "初九":"初九，无妄往，吉。\n《象》曰：无妄之往，得志也。\n\n心無期望的前往，吉。「妄」應作「望」，「无妄往」即「無望往」，心中沒有期望的前往。《象傳》說：「无妄之往，得志也。」內心無所期望的前往，可以得志，得所願，因此為吉。「無望」也可解釋為意外，意料之外。「無望往」為意料之外的行程，如有意外的事需前往處理，不需擔憂，此事為吉。傳統解釋無妄為毫無虛妄。無妄往吉，心正而誠地前往則吉。",
      "六二":"六二，不耕穫，不菑畬，則利有攸往。\n《象》曰：不耕穫，未富也。\n\n此段爻辭當依《禮記．坊記》修正為：「不耕穫，不菑畬，凶。」或者「不耕穫，不菑畬，凶，利有攸往。」「則」字可能是「凶」字之誤。帛本無「則」字。另依上博簡改為今文為「不耕而穫，不畜之」。不耕田就想得到收獲，不開墾荒地就要有熟田，凶。這是告戒人不要想著不勞而穫，只等著能夠得到上天之眷顧而獲得意外之財。",
      "六三":"六三，无妄之災。或繫之牛，行人之得，邑人之災。\n《象》曰：行人得牛，邑人災也。\n\n意料之外的災難。有人綁了牛，路過的人順手牽走了，但村人就因此受害。此言有人將牛綁著，可能是綁在樹旁，被剛好路過的人順手牽走，於是引來了村民的一場災難。至於什麼災難？有人認為就是主人遺失了牛。有人認為因為主人發現牛不見之後告官，而讓無辜的村民遭到拘捕。此段爻辭當與上古故事有關，只是這個故事已經失傳，無論那種說法，都只是後人之編織與臆測，實則還有待更多資料的考證。",
      "九四":"九四，可貞，无咎。\n《象》曰：可貞无咎，固有之也。\n\n可以貞定，沒有罪咎。《象》曰：「可貞无咎，固有之也。」意味自己本來就有了，所以貞定為吉，不需外求。",
      "九五":"九五，无妄之疾，勿藥有喜。\n《象》曰：无妄之藥，不可試也。\n\n意料之外的疾病，不用吃藥就會痊癒。傳統解釋為不知原因的疾病，不要亂吃藥，病情自然會好。依虞翻應作「無亡之疾」，此為死不了的疾病。象曰與經文並不一致。意思為意外而來的藥，即不知來源的藥，不可以亂嘗試。不要亂吃藥的意思。",
      "上九":"上九，无妄行，有眚，无攸利。\n《象》曰：无妄之行，窮之災也。\n\n意料之外的行程，有災難，無所利。帛書作「无孟之行」，依帛本當作「无妄之行」。或可解釋為無所期望的行程，對於此行沒有目標與期望，如此而往則有災眚，無所利。反之，若能有所望而往，則可免於災眚。"
    }
  },
  "100111": {
    "name": "大畜",
    "pinyin": "dà chù",
    "summary": "山天大畜，山中耀陽，積蓄待時。(中吉)",
    "detailed": "大畜卦象徵積蓄與等待時機，如高山阻擋天風，代表當下需耐心儲備實力，待時而動。對於事業很好，大膽前往會受到重用，但將難以兼顧家庭，甚至可能離鄉背井。因此自己需要的是什麼必需思考清楚。",
    "explanations": {
      "運勢": "養精畜銳，畜勢待發之後，可以大膽前往。運勢良好，但需耐心累積實力。",
      "感情": "受到事業影響而很難兼顧，感情需穩步發展，不宜操之過急。",
      "財運": "財運佳，適合儲蓄與長期投資。",
      "工作": "工作需穩重行事，積累經驗後再行突破。受到重用，功成名就。",
      "買賣": "交易需保持穩健，不宜貿然擴張。",
      "考試": "考試運佳，努力積累可獲好成績。",
      "健康": "健康良好，但宜保持規律生活。",
      "訴訟": "訴訟需耐心等待時機，勿急於求勝。",
      "尋人": "尋人需時間，對方可能暫時隱藏蹤跡。",
      "尋物": "尋物需耐心查找，可能藏於隱蔽處。",
      "旅行": "旅行可行，但宜事先準備充分。",
      "人際": "人際關係穩定，貴人運佳。",
      "卦辭": "大畜，利貞。不家食，吉，利涉大川。\n《彖》曰：大畜，剛健篤實，輝光日新其德，剛上而尚賢，能止健，大正也。不家食吉，養賢也；利涉大川，應乎天也。\n《象》曰：天在山中，大畜。君子以多識前言往行，以畜其德。\n\n大畜，利於貞定，不在家吃飯，吉。利於渡河涉險。不家食是因為食碌於外，受到重用，事業忙碌，無暇在家吃飯。因此此卦有因事業而無法兼顧家庭的情況。另一解釋，大畜為大量畜養家畜，利於貞定，不要在家中飼養，吉。利於渡河過去飼養。此可能講的是遊牧逐水草而居的生活。\n\n【卦旨】大畜為大為蓄積、蓄止，揭示君子當蓄積陽剛正氣與美德、畜養崇尚賢人，以及行其所當行、止其所當止的道理。小畜以陰畜陽蓄積程度小，又稱小畜，從蓄積的內容看為畜積物質財富，對比大畜以陽畜陽蓄積程度大，而大畜則是畜積道德與人才。"
    },
    "yaoInterpretation": {
      "初九":"初九，有厲，利已。\n《象》曰：有厲利已，不犯災也。\n\n有危險，宜停止。《象傳》說「有厲利已，不犯災也」，有危險而宜於停止不前，因為不去做冒犯危險、可能引來災難的事。大畜乃畜極而發之卦，初與二都只在初始階段，宜貞定而不發。",
      "九二":"九二，輿說輹。\n《象》曰：輿說輹，中无尤也。\n\n用來固定車輪軸的革繩脫落。此意味無法前進，不宜出行。大畜卦為畜極而發之卦，初與二為積畜之階段，至上九為何天之衢。",
      "九三":"九三，良馬逐，利艱貞。曰閑輿衛，利有攸往。\n\n《象》曰：利有攸往，上合志也。\n優良的駿馬飛奔有序，宜艱苦貞定。每天熟習駕馭大車的技術，利有所往。此爻言有志氣的人才技藝精湛，能力高人一等，但仍然每天自我精進，提升自己的能力，因此利有所往。此爻亦可能講遊牧之事。九二輿脫輹，車子故障而不能前進或出行。現在車子修理好了，不但能夠重新再出發，而且良馬狂奔，很熟練的駕著車子趕路前往新的牧場。",
      "六四":"六四，童牛之牿，元吉。\n《象》曰：六四元吉，有喜也。\n\n以童牛作告祭，大吉。傳統解釋：小牛的牛牿，大吉。在小牛的牛角還未長出來之前，就先綁好牛牿，避免牛長大後會用角觸人。由於能防患於未然，吉，有喜。此比喻做事情有先見之明，防患於未然則吉。",
      "六五":"六五，豶豕之牙，吉。\n《象》曰：六五之吉，有慶也。\n\n閹豬的牙，不會傷人，沒什麼好怕的，吉。閹豬巨大，但空有其表，不足為懼，沒有危險性，故為吉。",
      "上九":"上九，何天之衢，亨。\n《象》曰：何天之衢，道大行也。\n\n走到康莊大道，亨通。直接通達天衢。上九為畜極而發之時，積畜到極點，一飛沖天的時候。王弼：「處畜之極，畜極則通，大畜以至於大亨之時。」"
    }
  },
  "100001": {
    "name": "頤",
    "pinyin": "yí",
    "summary": "山雷頤，山雷相交，自我修養。(中吉)",
    "detailed": "頤卦象徵養生與修身，如雷震於山中，表示內在能量的積累與涵養。君子應修身養性，培養智慧，慎言語，節飲食。謀事時機未到，最好再閉關修練。凡事以守靜為吉，要知所節制，慎防口舌之災，不管是嘴巴講出去的話還是吃進去的東西。",
    "explanations": {
      "運勢": "守靜不動為宜，躁動則凶。運勢尚可，宜注重內在修養。",
      "感情": "感情仍有待培養。感情需真誠相待，彼此尊重。",
      "財運": "財運平穩，宜累積資源，減少不必要開銷。",
      "工作": "需要加強基本的能力。凡事鴨子滑水為宜。可再多充實自己的技能。工作需保持專業態度，不受外界影響。",
      "買賣": "交易需講求誠信，避免浮躁。",
      "考試": "考試運勢良好，需穩定心態應試。",
      "健康": "健康需注重養生，調理身心。",
      "訴訟": "訴訟需理性處理，宜爭取調解。",
      "尋人": "尋人進展平穩，對方可能在靜養中。",
      "尋物": "尋物需反思可能遺失的原因。",
      "旅行": "旅行宜選擇休閒靜養之地。",
      "人際": "人際關係穩定，適合深交知己。",
      "卦辭": "頤貞吉，觀頤，自求口實。\n《彖》曰：頤貞吉，養正則吉也。觀頤，觀其所養也；自求口實，觀其自養也。天地養萬物，聖人養賢以及萬民，頤之時大矣哉。\n《象》曰：山下有雷，頤，君子以慎言語，節飲食。\n\n頤養之道以貞定為吉，觀察頤養之道，以求得自己的口養之實。頤指的是觀察一個人所養的是什麼人、什麼物。就如天地所養的是萬物，聖人所養的是賢人與萬民。而自求口實則是觀察一個人放到嘴裡的是什麼東西。依鄭玄解釋，如此就可了解一個人的貪廉與品性。口實為頤中有物，頤卦為口中空虛，因此說自求口實。\n\n【卦旨】頤為頤養，頤本意指下巴與兩腮，此處代指人口，口是用來飲食與說話，所以頤可以引申為養的意思，頤卦的養主要包括了自養、求養和養人三方面，三方面都要堅持正道才會有好結果，自養在於自力更生自食其力，求養在於知恩圖報、常懷感恩報答之心，而養人則在於尊重被養者的人格與尊嚴，揭示生活的供養應當立足自身、遵循正道，以及當力求養人、養賢，乃至養天下的道理。"
    },
    "yaoInterpretation": {
      "初九":"初九，舍爾靈龜，觀我朵頤，凶。\n《象》曰：觀我朵頤，亦不足貴也。\n\n不知要守靜以畜養自己精神的靈明，反而因為看別人大快朵頤而羨慕不已。若能守靜養之道，則福氣自來，但若是急著要去追求外養，反而自取其辱。初九為下卦震卦的主爻，也是第一爻，是所謂的「震動」之主。以剛居陽，當位，而又與六四相應，為何為凶？頤卦以居靜為吉，而初九卻是妄動、始動之爻，因此凶。",
      "六二":"六二，顛頤，拂經。于丘頤，征凶。\n《象》曰：六二征凶，行失類也。\n\n顛倒向下求養，違背常理；往高處求養，又所求非人，征凶。六二陰柔居中又得位，為何為凶？陰爻無以自養，因此需求養於陽，與六二比鄰的是初九，往下求養於初九是為「顛頤」，但六二以柔而乘初九之剛，為逆，違背頤養之常道，因此說「顛頤，拂經」。于丘頤則是指六二向上求養，上卦為艮，為山，因此說丘，上卦能養六二者只有上九，但能與六二相應的只有五，五為陰，六五與六二不相應，故征凶。總觀六二，有些進退維谷。向下則違背常理而不得養，向上則妄作而凶。",
      "六三":"六三，拂頤貞凶。十年勿用，无攸利。\n《象》曰：十年勿用，道大悖也。\n\n違背頤養之道，堅定為凶。或者，違背養正之道，凶。十年都不得用，無所利。錯誤的頤養之道當然不能堅持，因此說「貞凶」。象曰：「十年勿用，道大悖也。」意指這是完全違背頤養的道理，以致於十年之久亦不可用。六三以柔居剛，不當位，又位於下卦震卦的最上面，也是震動的頂點，違背守靜的頤養之道，因此為凶，且達十年之久。三位多憂，爻變而成互體坎中，因此當居靜不變為宜。",
      "六四":"六四，顛頤，吉。虎視眈眈，其欲逐逐，无咎。\n《象》曰：顛頤之吉，上施光也。\n\n顛倒向下求養，吉。如果像老虎捕捉獵物一樣，視線下沉含畜，但欲望自然流露無遺，也是不會有罪咎。此爻當是兩種可能的判斷：一是顛頤為吉，顛為向下，有謙下而受益之義；二是如老虎般自然樸實，雖然欲望盡露無遺，但純真自然，也不會有罪咎。",
      "六五":"六五，拂經，居貞吉，不可涉大川。\n《象》曰：居貞之吉，順以從上也。\n\n違背頤養之道的常理，守正居靜則吉，不可以涉水行險。五是尊位，但柔以居之，不當位。不足以自養，反求諸上，所以說是「拂經」。不過因為以柔承剛（順），與上比應，所以吉。大川，為水，在易經都是比喻「危險」，不可涉大川為不可冒險行事的意思。",
      "上九":"上九，由頤，厲吉，利涉大川。\n《象》曰：由頤厲吉，大有慶也。\n\n頤養之道的源頭，艱苦則吉，利於涉大川行險。上九同時為外卦（艮）及頤卦全卦的主爻，是下方四個陰爻求養的對象，因此曰「由頤」，言頤養之義是由此而來。但以剛居柔，不當位，又養下方四陰爻，責任重大，因此厲。吉者，因為六五陰爻相承（為順），又與內卦的六三相應。而頤卦講的又是居貞守靜之道，上九處艮之頂，又為艮之卦主，是能守靜，以靜制動者，因此為吉。"
    }
  },
  "011110": {
    "name": "大過",
    "pinyin": "dà guò",
    "summary": "澤風大過，大澤滅木，承擔重任。(小凶)",
    "detailed": "大過卦象徵過度與承擔，如澤水覆蓋於風，表示重任在肩，君子需謹慎行事，陽氣過盛。避免過度勞累或超過自身能力範圍。根基不穩，基礎很弱，既使有棟粱之才獨撐大局而能化解危機，但一切還是應該回頭思考如何穩固根本，避免繼續腐化。或者另求出路，也是良策。",
    "explanations": {
      "運勢": "基礎不穩，另求出處為宜。運勢較低，事務繁重，需量力而行。",
      "感情": "過於縱情，華而不實的關係，感情關係易失衡，需互相體諒。",
      "財運": "財運不穩，投資需審慎評估風險。",
      "工作": "有將無兵，難成大事。工作壓力大，需適時調整步調。",
      "買賣": "交易風險較高，需謹慎考慮市場動向。",
      "考試": "考試需加倍努力，避免過度壓力。",
      "健康": "健康狀況需留意，避免過度操勞。",
      "訴訟": "訴訟易遇困難，應以柔克剛。",
      "尋人": "尋人有難度，對方可能遠行或失聯。",
      "尋物": "尋物較困難，可能藏於難以發現之處。",
      "旅行": "旅行需多加注意，避免超負荷行程。",
      "人際": "人際關係易受影響，需平衡人際互動。",
      "卦辭": "大過，棟橈。利有攸往，亨。\n《彖》曰：大過，大者過也。棟橈，本末弱也。剛過而中，巽而說行，利有攸往，乃亨，大過之時大矣哉。\n《象》曰：澤滅木，大過。君子以獨立不懼，遯世无悶。\n\n大的過錯，屋脊棟樑彎曲不正。宜有所往，亨通。棟樑彎曲，屋子將倒，另找安身之處則能亨通。君子當另求去處，或者隱退山林，不當留在原處，所以「利有攸往」。棟橈為屋宇架構出了問題。二體下卦巽為宮室之象，也是長木大柱之象，上兌毀之，則宮室毀損，砥柱彎曲，屋宇不宜居住。故利有所往，不宜居留。\n\n【卦旨】大過為大有所過，在《周易》裡陽為大、陰為小，大過又稱陽過，是超過超出之意，大過卦的初爻與上爻為陰爻其餘皆為陽爻，這好比一棟樓的主樑中間大而兩頭小，根基極其不穩固，所以這是超出常規之事，也即大過，揭示事物發展過程中陽剛主導一方過於強盛、陰柔附屬一方過於衰弱時，應當盡力調整，使之剛柔相濟、主輔平衡的道理。"
    },
    "yaoInterpretation": {
      "初六":"初六，藉用白茅，无咎。\n《象》曰：藉用白茅，柔在下也。\n\n敬獻時使用白茅，慎重其事，沒有罪咎。正處棟橈即將屋毀的時候，所以謹慎正可以保得平安。大過所謂的本末弱分別指初六和上六。初六以柔處剛，不當位，又處棟橈之時，原本應是有罪咎，能夠無咎是因為能夠承陽（為順），上又與九四相應，屬於能夠隨剛而與剛互濟者，故得無咎。",
      "九二":"九二，枯楊生稊，老夫得其女妻，无不利。\n《象》曰：老夫女妻，過以相與也。\n\n枯萎的楊樹發了芽，生機重現，猶如人老了年過婚齡還得到年輕的妻子，無往不利。大過之為凶，在於陽剛過盛，棟樑彎曲，房子結構不穩，澤滅木。大過之為亨為得陰之相濟，則陰陽調和。天施地生，坤陰氣主生，大過卦能得陰氣之助的陽爻，則可獲生機。九二與九五都與陰爻相比鄰，是能得陰氣者，所以兩爻都有得妻之象。但九二為無不利，九五為無咎無譽，何故？因為九二與初六比應，其得妻有如楊木往下生根（陰爻在下），九五與上六近而相逆，有如楊木向上開花（陰爻在上）。枯樹生根發芽是重現生機，開花則是迴光返照，準備在結束生命之前繁衍後代，不但無濟於樹木的枯萎，反而加速死亡。其次，九二為初六所承載，為陰以濟陽，妻幫夫之象，故為吉。九五則是為上六所駕御，柔乘剛，陰傷陽，妻剋夫之象，所以說是老婦得士夫，無咎無譽。",
      "九三":"九三，棟橈，凶。\n《象》曰：棟橈之凶，不可以有輔也。\n\n棟樑彎曲不正，凶。巽為長木，為棟樑。兌為毀折，九三處巽木之上，上兌之下，為兌所傷。為棟橈。大過卦的九二及九五以枯楊取象，九二在下生根而發芽（初六為根）為吉，九五在上生花為無譽。而九三與九四兩爻則以棟取象。九三為巽木之上，上兌之下，為兌所毀，為棟橈，凶。而九四則處上卦之下，在巽木之上，為棟隆，吉。九三雖與上六相應，上六是讓楊樹生命加速枯萎的楊花，再加上上六本身即有滅頂之災，無以濟其陽剛，兩者雖相應，但反而為凶。而九四則與初六相應，初六為讓枯楊重現生機的樹根，為能夠濟陽者，因此為吉。",
      "九四":"九四，棟隆，吉，有它吝。\n《象》曰：棟隆之吉，不橈乎下也。\n\n棟樑穩固，吉，但會有意外而悔恨。此爻之所以為吉請見九三爻的說明。九四之吉，在於與初六相應，得陰之助。雖然吉，但應慎防意外發生而造成悔恨。",
      "九五":"九五，枯楊生華，老婦得其士夫，无咎无譽。\n《象》曰：枯楊生華，何可久也；老婦士夫，亦可醜也。\n\n枯萎的楊樹開花，老婦人嫁給年輕力壯的丈夫，雖沒罪咎，但也沒什麼好名聲。枯樹發芽代表已經長出新根，是重生現象，但若是開花則是死亡前的迴光反照，所以枯楊開花並不是吉利的事，不可被美麗的花所欺騙。而老婦再嫁給少男，不被風俗民情所容，所以應防名譽掃地。九五與九二同以枯楊取象，兩者吉凶差異請見九二爻辭釋義。象曰：「枯楊生華，何可久也？老婦士夫，亦可醜也。」枯萎的楊樹開花無法長久；老婦得到年輕力壯的丈夫，讓人感到羞恥。",
      "上六":"上六，過涉滅頂，凶，无咎。\n《象》曰：過涉之凶，不可咎也。\n\n明知水深危險而仍強力涉水，以至慘遭滅頂，凶。明知危險而仍然要勇往直前，慘遭滅頂，為壯烈成仁，殺身取義之象。雖凶險萬分，有滅頂死亡的危險，但因不論個人利害，義之所當為而為，是很令人敬佩的烈士，所以說沒有罪咎。上六居於大過之上，陰柔者本無力救濟大過棟橈之勢，又不知量力而為，凌架四陽之上，行事極端，因此過涉滅頂。大過為澤滅木之象，巽為舟楫，因此有沉船舟楫不可用之象。上爻可代表一卦之發展結果，大過之滅木而舟楫不可行，可從上爻得知。"
    }
  },
  "010010": {
    "name": "坎",
    "pinyin": "kǎn",
    "summary": "水洊坎，坎為水，險中求勝。(凶)",
    "detailed": "坎卦為正北之卦，節氣冬至，坎序數為一，象徵險境與考驗，如水陷於水中，代表困境與挑戰。君子應小心行事，步步為營，方能突破難關。面對逃無可逃的危險要能安之若命，進一步求通達變，那麼或可化險為夷，甚至達成目標；反之若無法泰然處之，那麼卜此卦者為大凶。",
    "explanations": {
      "運勢": "處境艱難，但若是努力並警慎，仍然能夠險中求通，小有斬獲。",
      "感情": "陷入僵局。感情關係易受外界影響，需穩定內心。",
      "財運": "財運不穩，易有財務壓力，需保守理財。",
      "工作": "進退都有困難。工作上挑戰較多，需堅持不懈。",
      "買賣": "交易有阻礙，需保持耐心。",
      "考試": "考試運勢一般，需加倍努力。",
      "健康": "健康需注意，易受情緒影響。",
      "訴訟": "訴訟進展不順，宜尋求和解。",
      "尋人": "尋人較困難，可能受環境因素影響。",
      "尋物": "尋物不易，可能遺失於隱密處。",
      "旅行": "旅行易遇阻礙，宜多做準備。",
      "人際": "人際關係需謹慎處理，避免衝突。",
      "卦辭": "習坎，有孚，維心亨，行有尚。\n《彖》曰：習坎，重險也。水流而不盈，行險而不失其信。維心亨，乃以剛中也；行有尚，往有功也。天險不可升也，地險山川丘陵也，王公設險以守其國，險之時用大矣哉。\n《象》曰：水洊至，習坎。君子以常德行，習教事。\n\n雙重的坎險，有信念而能維持內心的亨通。出行前往，能夠得到獎賞。處於內外都是坎陷，前後上下都是危險的時候，能夠求通者只有內心的改變，所以說「維心亨」。「行有尚」是說積極行動能夠有所得。但處坎之時，只可能是小小的獲得，不會是大成就。總體來說，遇到坎卦不能大吉，雖然內外都是坎險，只要保持樂觀的態度，並積極去行動，還是能夠小有收獲，小有作為的。\n\n【卦旨】坎為險陷，陽陷陰中、外虛內實、險陷之象，揭示處於險難困頓之時，應當堅定剛設、心懷誠信、謹其行，以逐步排除險難，走出困境，以及善用險阻以守其國的道理。"
    },
    "yaoInterpretation": {
      "初六":"初六，習坎，入于坎窞，凶。\n《象》曰：習坎入坎，失道凶也。\n\n雙重的坎險，落入很深的坎陷裡，凶。此處的坎或指地牢、監獄，所言為被關入地牢的最深之處，監護最為嚴密而難有出脫之時。初六在習坎的最下方，就時間來說，是習坎最開始的時候，不能習於坎者。就空間來說，則是坎險最深最難之處，處境暗無天日。以柔處剛，不當位，是危險中之危險，凶。坎窞為古代之地牢或獻祭人牲用的祭祀坑，初爻為一卦的最下方，也是坎陷的最深處，為最難出脫之地。又初六動下體成兌，兌為毀折，靜為坎險，動靜皆凶。",
      "九二":"九二，坎有險，求小得。\n《象》曰：求小得，未出中也。\n\n坎洞中有手枕，雖沒有枕頭，但也算是小小的獲得。「坎有險」傳統解釋為坎洞中有危險。九二居於下坎的中間，因此仍居於危險之中，此為坎有險。但因本性剛強又居中，具有陽剛而中庸的美德，是能夠自力救濟者，因此說求小得。雖能有小得，但仍居於危險的境地，也只是險中求通，並非化險為夷，也未脫離危險。求小得，雖能夠險中求通，小事求之可有獲得，但大事不行。",
      "六三":"六三，來之坎坎，險且枕。入于坎窞，勿用。\n《象》曰：來之坎坎，終无功也。\n\n進退都是坎險，有手枕暫且充當枕頭。進入了坎險的最深處，凡事皆不可行。此處的坎或指地牢、監獄，所言為被關入地牢的最深之處，監護最為嚴密而難有出脫之時。六三失位乘剛，又處於兩個坎險交界之處，又是多凶的爻位，進退都是坎險，因此凡事都不可行。險且枕，以檢（手枕）為枕頭，要人安之若命之義。",
      "六四":"六四，樽酒，簋貳，用缶，納約自牖，終无咎。\n《象》曰：樽酒簋貳，剛柔際也。\n\n一樽酒，二盤食物，以及裝水的瓦罐，將如此簡約的飲食從窗戶送進牢房，最後無罪咎。傳統認為這是在講祭祀祖先或是奉獻於王公的事，雖然東西簡單，但當危難之時，未失虔敬之心。然而觀坎卦之本義。坎卦講的應該是人被關入地牢之事，九四講的可能是親友帶著飲食來探監，所以飲食必需從窗戶遞進去。另一可能為人牲獻祭所用。六四已脫離內部的危險，只要再渡過外部危險這一關就能夠出險，再加上承載九五之君，因此比較接近出險的機會。故曰「終無咎」。因處外坎，已可見到外面的陽光，因此曰「牖」。相較之下，下卦三爻為處於內坎，不見天日。",
      "九五":"九五，坎不盈，祗既平，无咎。\n《象》曰：坎不盈，中未大也。\n\n坎洞並未填滿，小土丘已挖平，沒有罪咎。坎險雖然還未完全渡過，但是曙光已現，沒有永遠的坎險。小土邱已平，比喻平安之日已近，故曰無咎。九五已近坎之尾，剛中而處互卦艮體之上，變而上體坎成坤，坤為平地，故曰「坻既平」。此爻或言人古代葬禮的填坎（墓穴）過程，坎洞還未填滿，但小土坵已鏟平。",
      "上六":"上六，係用徽纆，寘于叢棘，三歲不得，凶。\n《象》曰：上六失道，凶三歲也。\n\n用繩子將人綑綁起來，囚禁在荊棘圍牆裡面。三年都無法出去，凶。此近於困卦初六爻辭：「臀困于株木，入于幽谷，三歲不覿。」講的是古代圜土之事。圜土即古代的監獄，三歲不得即三年不得出。"
    }
  },
  "101101": {
    "name": "離",
    "pinyin": "lí",
    "summary": "火明離，離為火，依附光明。(吉)",
    "detailed": "離卦為正南之卦，節氣為夏至，離序數為九，象徵光明與智慧，如火焰閃耀，帶來溫暖與啟發。君子應善用智慧，追求真理，發揮自身光芒。此卦雖吉，但顯然是有條件的，若能柔順中庸則吉，反之切忌走邪門歪道，聰明反被聰明誤，則不吉。另要注意事情是否華而不實；或者人是否流於小聰明，而缺乏圓融智慧。",
    "explanations": {
      "運勢": "懂得柔順與中庸之道，此事自吉，智慧與機遇並存，反之則凶。",
      "感情": "感情穩定，彼此欣賞並支持。若過於重視外貌或形式，注意是否過於浮華不實。",
      "財運": "財運佳，適合創業或知識型投資。",
      "工作": "工作有發展機會，適合展現才華。適於文學、文創、畜牧等產業。凡事應當走中道。",
      "買賣": "交易順利，市場對產品或服務接受度高。",
      "考試": "考試運佳，聰明才智可助成功。",
      "健康": "健康良好，但需注意火氣過旺之症。",
      "訴訟": "訴訟有利，智慧應對可獲勝。",
      "尋人": "尋人順利，對方可能積極尋找幫助。",
      "尋物": "尋物可望找回，宜尋明亮處。",
      "旅行": "旅行適宜，可見識新文化與知識。",
      "人際": "人際關係良好，適合與智者交流。",
      "卦辭": "離，利貞，亨，畜牝牛吉。\n《彖》曰：離，麗也。日月麗乎天，百穀草木麗乎土，重明以麗乎正，乃化成天下。柔麗乎中正，故亨，是以畜牝牛吉也。\n《象》曰：明兩作，離，大人以繼明照于四方。\n\n附麗，利於貞定，亨通，養母牛則吉。牝牛比喻柔順中正，牛被視為是溫馴的家畜，而母牛又是溫馴中之溫馴。所以畜牝牛比喻要培養柔順的特質。六二和六五分別為上下離卦的中爻，一陰包於二陽之內，坤為牛，陰包於陽所以是畜牝牛之象。兩陰爻皆居中，因此卦辭又說「利貞」，貞者正也，定也。這與坤卦卦辭「利貞…利牝馬之貞」極為相似，有異曲同工之妙，因為離可視為坤體附麗於乾之內。六十四卦唯一作「利貞亨」者。餘皆作「亨利貞」。\n\n【卦旨】內德外才須兼備，離為附麗，離為火，如火要燃燒必須也要靠依附其外物才可延續散發光明。揭示世間萬物均有所依附，而人類社會的依附應當柔順謹慎、遵循正道的道理。與坎卦以剛中為主相對，此卦乃以依附柔中為宜。"
    },
    "yaoInterpretation": {
      "初九":"初九，履錯然，敬之，无咎。\n《象》曰：履錯之敬，以辟咎也。\n\n鞋子像是涂金的，尊敬他，以避免罪咎。傳統解釋認為，履錯然為行為小心謹慎的樣子，如履薄冰，心存敬畏才能避免於罪咎。較好的解釋為：履為鞋，錯為涂金，錯然就是像涂金的樣子。此為從小處細微處看人看事，從鞋子就看出一個人的身份、地位，知來者腳下踩的鞋子都如此華麗光鮮，當然要心存敬畏，以避免犯錯惹禍上身。",
      "六二":"六二，黃離，元吉。\n《象》曰：黃離元吉，得中道也。\n\n黃色的鸝鳥，大吉。黃為「中色」，象徵中庸的美德。六二居於下卦的中央，得位又以柔居中，所以具有中庸又柔順貞正的美德。如卦義中所說的，離卦最重要的是要有中庸之德。因此六二為大吉。此或以黃離象徵春天，以春天代隱喻人事通泰。",
      "九三":"九三，日昃之離，不鼓缶而歌，則大耊之嗟，凶。\n《象》曰：日昃之離，何可久也。\n\n日落的美麗，不敲盆唱歌，就只能老來等死空哀嘆，凶。象曰：「日昃之離，何可久也。」日薄西山的美麗是無法持久的，自古就讓人有種哀愁別離之感。但這是天道循環無法改變的常理，「鼓缶而歌」是勸人對於人生必需豁達，要能夠活在當下，享受最平凡的快樂，隨興而歌。不然以將死的高齡，也只能空自哀嘆，那麼就只有凶咎可言。",
      "九四":"九四，突如其來如，焚如死如棄如。\n《象》曰：突如其來如，无所容也。\n\n倒行逆施，有如不孝的逆子，為眾人所不容。該受焚死棄的嚴刑。突古字為倒寫的「子」字，以表達「逆子」、不孝的意思。不孝順的子女突然做出大逆不道的事，就是突。引申之，凡突然做出大逆不道之事，不限定為人子者。焚如、死如、棄如，則謂當受此嚴厲之刑。",
      "六五":"六五，出涕沱若，戚嗟若，吉。\n《象》曰：六五之吉，離王公也。\n\n眼淚鼻涕一直流，憂慮歎息。吉。「六五之吉，離王公也。」此說明為何痛苦憂慮如此還會是吉，是因為附麗於王公。五為尊位、君位，附麗於二陽，故曰「離王公」。離卦的吉道在中庸，六五雖有災臨身以致於痛哭流涕，哀戚悲歎，但因有柔順而中庸的美德，知所憂慮警惕，因此得以化險為夷，轉危為安，最後變成吉。六五爻變全卦成同人，同人為天子會同諸侯（王公）協助征伐不順服者之義。",
      "上九":"上九，王用出征，有嘉折首，獲匪其醜，无咎。\n《象》曰：王用出征，以正邦也。\n\n大王用以出征，拿下敵人首級而立下戰功。捕獲的俘虜相當多，可免罪咎。"
    }
  },
  "011100": {
    "name": "咸",
    "pinyin": "xián",
    "summary": "澤山咸，山上湖澤，感應共鳴。(中吉)",
    "detailed": "咸卦象徵感應與共鳴，如山澤相互交融，產生共鳴之效。君子應順應感應之道，以誠待人，促進和諧。虛心傾聽，取得他人共鳴，那麼事情自然可成。但若感情用事，濫情而不守禮法，則大凶。",
    "explanations": {
      "運勢": "與事情有所感應，運勢良好，適合與人合作或發展感情。",
      "感情": "男女心心相映，婚姻大吉。感情順利，彼此相吸，相互影響。",
      "財運": "財運佳，合作投資可帶來收益。",
      "工作": "多傾聽他人的意見，以同理心做事。工作有良好契機，適合與人攜手共進。",
      "買賣": "交易成功率高，需善用人際關係。",
      "考試": "考試運普通，與師長同學互動可提升學習成效。",
      "健康": "有受傷、病痛的危險，建議追蹤檢查。",
      "訴訟": "訴訟可望和解，宜尋求雙方共識。",
      "尋人": "尋人容易，對方可能有感應相應。",
      "尋物": "尋物可得，需回憶與之相關之人事物。",
      "旅行": "旅行宜結伴同行，增進交流。",
      "人際": "人際關係和諧，適合社交與團隊合作。",
      "卦辭": "咸亨，利貞，取女吉。\n《彖》曰：咸，感也。柔上而剛下，二氣感應以相與，止而說，男下女，是以亨，利貞，取女吉也。天地感而萬物化生，聖人感人心而天下和平。觀其所感，而天地萬物之情可見矣。\n《象》曰：山上有澤，咸，君子以虛受人。\n\n感動而能亨通，利於貞定。娶女吉。咸或作「皆」解釋，即眾人皆同意的意思。咸亨，眾人皆同意則亨。咸卦之所以娶女吉，是因為少男居於少女之下，少男三爻又與少女三爻全都相應，陰陽男女交感之象。《周易》裡男下於女就是婚合之象，因就男上女下之卦象來說，是男女卦氣交易而相感；就男在先、女在後之順序來說，有夫唱婦隨之義。損卦少男在上，少女在下，女先於男，男女卦氣不交，《象傳》則說「君子以懲忿窒欲」，必須戒慾，可推理不宜娶女或結婚。\n\n【卦旨】咸字通感字，為交感、感應之意，為何交感？因前三爻與後三爻一一對應，並且咸卦上兌下艮，兌為少女、艮為少男，這就有了少男追求少女，少女與少男交相感應之象，揭示男女相互感應的各種不同情狀、是非得失，以及感亦當立足於貞正的道理。其中亦有天地感而萬物化生、聖人感人心而天下和平的引申發揮，乃將立感的原則擴大到了自然與社會領域。"
    },
    "yaoInterpretation": {
      "初六":"初六，咸其拇。\n《象》曰：咸其拇，志在外也。\n\n感應到腳拇指。初位在六爻中為趾、拇之位。其初難知。這是易動又很末稍的地方，有過於妄動，且難以感動人心之弊。若談感應，則給人的感動非常膚淺而不實。咸若解釋作砍傷，那麼此爻就是砍傷了腳指。有幾種象徵意義。一它是行動的開始。二它是一個非常容易自己亂動的地方。三，只是人體非常末稍的地方，離感動人心相當遠。",
      "二六":"六二，咸其腓，凶，居吉。\n《象》曰：雖凶居吉，順不害也。\n\n感應到小腿肚，凶。居靜不動為吉。小腿是極好動的部位，象徵過於躁動，因此而遭致凶災，最好是居靜不要妄動則吉。或者可解釋為砍傷了小腿，凶。安靜不動就吉。居為不動，靜、定的意思。居靜之所以為吉，是因為柔順而不會受到傷害。",
      "九三":"九三，咸其股，執其隨，往吝。\n《象》曰：咸其股，亦不處也。志在隨人，所執下也。\n\n感動其大腿，執意於隨足而動，前往的話就有恨惜。股是大腿，依王弼注，大腿是隨足而動者。執為執著，隨則意指股之隨足而動，執其隨比喻人沒主見而只會隨人起舞。所以《象》曰：「志在隨人，所執下也。」意指人像股一樣，以隨人為志，這種志氣相當低下。此承「咸其股」而言，因大腿受傷，因此靠著扶持而免於倒下。",
      "九四":"九四，貞吉，悔亡。憧憧往來，朋從爾思。\n《象》曰：貞吉悔亡，未感害也；憧憧往來，未光大也。\n\n貞定則吉，後悔消亡。反之，若內心不定，憂慮而想法搖擺，讓朋友們全都跟著你的想法而無所適從，那麼就有悔。言意志要堅定則吉而悔亡。反之，意志不堅，搖擺不定則會後悔。四為多憂之位，憂慮之象。居上體兌下，動而成坎，動有悔之象。居互體三陽之中，朋從之象。九四爻所感而動者為心的位置，因此曰憧憧。但咸卦以能定能緘為吉，憧憧往來則心已妄動。",
      "九五":"九五，咸其脢，无悔。\n《象》曰：咸其脢，志末也。\n\n感應到背脊，無所悔恨。各爻都有感而動，唯有此爻寂靜而不為所動。九五處尊位，感而仍居靜，好的一面來看為公正而冷靜，壞的一面來看則是冷漠而無憂憫感人之懷抱，所以《象傳》說「志末也」。只能免於後悔，無法成大事。咸其脢亦可解釋為傷到背脊。",
      "上六":"上六，咸其輔頰舌。\n《象》曰：咸其輔頰舌，滕口說也。\n\n感應到嘴巴。此比喻有口無心，只是嘴巴說說，空口說白話，不足以為信。所以《象》曰：「咸其輔頰舌，滕口說也。」輔頰舌都是說話的地方。「滕口說也」意思近似於我們現今所說的只靠一張嘴、打嘴砲，只會在言語上跟人爭勝負。"
    }
  },
  "001110": {
    "name": "恆",
    "pinyin": "héng",
    "summary": "雷風恆，雷風相與，持之以恆。(小吉)",
    "detailed": "恆卦象徵恆久與持續，如風雷交替運行，代表堅持與穩定之道。君子應恆守正道，長久發展。如果你想要的就是穩定，那麼這就是一個大吉之卦；但如果你所想要的是挑戰與成長，那麼這是一個潛藏未來成長障礙的卦。因為過於穩定，將會缺乏變化與創新。",
    "explanations": {
      "運勢": "穩定，細水長流。運勢小吉，貴在持之以恆，穩步發展。",
      "感情": "感情關係穩定，適合長期發展。",
      "財運": "財運穩健，長期投資有利。",
      "工作": "工作需持續努力，累積經驗可得成功。穩定但缺少變化、創新，與成長。",
      "買賣": "交易穩定，宜建立長期合作夥伴。",
      "考試": "考試運佳，持續學習有助提升成績。",
      "健康": "健康良好，適合規律養生。",
      "訴訟": "訴訟進展穩定，需耐心等待結果。",
      "尋人": "尋人順利，對方可能維持固定生活軌跡。",
      "尋物": "尋物可找回，可能存放於慣用之處。",
      "旅行": "旅行適宜，可長途遠行。",
      "人際": "人際關係穩定，宜建立長久友誼。",
      "卦辭": "恒，亨，无咎，利貞，利有攸往。\n《彖》曰：恒，久也。剛上而柔下，雷風相與，巽而動，剛柔皆應，恒。恒亨，无咎，利貞，久於其道也。天地之道，恒久而不已也，利有攸往，終則有始也，日月得天而能久照，四時變化而能久成，聖人久於其道而天下化成，觀其所恒而天地萬物之情可見矣。\n《象》曰：雷風，恒，君子以立不易方。\n\n恒久而嘉會合禮，沒有罪咎。利於正定則利有所往。恒卦宜於貞定不變而守成，貞定之後才利於有所往。所以《象傳》說「君子以立不易方」。卦象漸入而動，雷與風相得益彰，漸進而動，六爻皆相應，因此能夠長長久久。\n\n【卦旨】恆為恆久,長久的意思，也即常而能久之意，何謂常而能久？常，常理也，久則長久之意，綜合起來常而能久就是因符合常理，所以能夠長久，何謂常理？恆卦是講述夫婦之道的卦，雖說古代與現代婚姻觀念已大不相同，但有一點是不變的，那就是夫妻之間需各正其位，直白地說，就是丈夫應當要有做丈夫的樣子，而做妻子的應當要有做妻子的樣子，唯有這樣，夫婦才能白頭偕老、天長地久，揭示立身處世應當堅持正道、持之以恆，不可急於求成，以及恆久之道在自然與社會領域中具有重要意義的道理。"
    },
    "yaoInterpretation": {
      "初六":"初六，浚恒，貞凶，无攸利。\n《象》曰：浚恒之凶，始求深也。\n\n要求過深的恒道，堅定則凶，沒有利益。初爻為恒卦一開始的時候，一開始就要求過深，苛刻無理之道，無以長久，若堅定此道為凶，無利益。初在最下最深之處，故為浚。此有如兩人才剛開始在一起，就苛責太過，反而有違和諧。",
      "九二":"九二，悔亡。\n《象》曰：九二悔亡，能久中也。\n\n後悔消失。象曰：「九二悔亡，能久中也。」因為能長久秉持中庸之道，所以能夠不再後悔。悔亡意指原本應當有悔，後來因為行為正確而不再有悔。九二悔亡，是因為能夠堅守中庸之道，也就是「久中」。",
      "九三":"九三，不恒其德，或承之羞，貞吝。\n《象》曰：不恒其德，无所容也。\n\n不能長久維持德行，可能因此而引來羞辱，堅定則悔恨。象曰：「不恒其德，无所容也。」德行無恆常者為人所不容，因此可能引來羞辱。",
      "九四":"九四，田无禽。\n《象》曰：久非其位，安得禽也。\n\n畋獵抓不到獵物。象曰：「久非其位，安得禽也。」長久都不在其位，言做事無恒心，荒廢很久，當然無法有任何收穫。",
      "六五":"六五，恒其德，貞，婦人吉，夫子凶。\n《象》曰：婦人貞吉，從一而終也。夫子制義，從婦凶也。\n\n能夠長久堅定其美德，從一而終，對女子而言，這是很好的德性，大吉。但對於男子而言，身為義理的制定者，本應剛強果斷，有自己的主見，反而採取柔順之婦道，有優柔寡斷、無法成大事之象，凶。六三言「不恒其德」，因此六五似乎應讀做「恒其德」為宜。「貞」或獨立一句，或可讀作「貞婦人吉，夫子凶」，此事問婦人為吉，問夫子則凶。",
      "上六":"上六，振恒，凶。\n《象》曰：振恒在上，大无功也。\n\n以振動為恒，凶。或：改變原本穩固的常態。原本事情已經穩定，一切有一定的軌道，現在卻輕舉妄動，貿然改變做法，違背過去的慣例，不但不能成事，反而動搖既有的根本，凶。"
    }
  },
  "111100": {
    "name": "遯",
    "pinyin": "dùn",
    "summary": "天山遯，天下有山，退避為吉。(小吉)",
    "detailed": "遯卦「遯」即是「遁」象徵退避與遠離，如天地分離，小人道長，君子道消，代表當局勢不利時，宜避其鋒芒，等待更好的時機。小人得勢的時候，不要想著功成名就，凡事躲得越快越遠越好；功成不居，急流勇退。",
    "explanations": {
      "運勢": "運勢尚可但求事無成。遯卦之吉是因為能夠置身事外，遠離是非，而不是因為有所成就。宜暫避風頭，待機而動。",
      "感情": "感情可能出現疏遠，需審視關係本質。對象不宜，能避則避。",
      "財運": "財運不穩，宜觀望市場變化，不宜冒進。",
      "工作": "無法有成就，只能求明哲保身。工作上宜低調行事，避免捲入爭端。",
      "買賣": "交易市場波動大，暫不適宜大額交易。",
      "考試": "考試需沉穩應對，避免緊張影響發揮。",
      "健康": "健康需休息與調養，避免操勞。",
      "訴訟": "訴訟不宜激烈對抗，退一步或可化解。",
      "尋人": "尋人可能較難，對方可能刻意避開。",
      "尋物": "尋物不易，可能藏於隱秘之處。",
      "旅行": "旅行宜選擇偏僻或靜養之地。",
      "人際": "人際關係宜保持距離，避免是非爭端。",
      "卦辭": "遯亨，小利貞。\n《彖》曰：遯亨，遯而亨也。剛當位而應，與時行也。小利貞，浸而長也。遯之時義大矣哉。\n《象》曰：天下有山，遯。君子以遠小人，不惡而嚴。\n\n逃離而能夠嘉會而亨通，小人利於堅定於正道。遯卦是小人道長，君子道消的時候。《易經》是一部「為君子謀」的經典，所以「遯亨」是就君子而言。遯卦時君子之所以能夠亨通，是因為能夠退避而遠遁，因此還可保有些自己的理想。而小人則利於貞靜，不需逃難，但需守正守靜，故曰小利貞。\n\n【卦旨】遯為退避、歸隱之意，為何退避歸隱？從六爻來看遯卦只有初六、六二為陰爻，其餘都為陽爻，初六、六二居下，這是陰長陽消態勢，小人漸盛，所以君子當退而避之，揭示事物發展受到挫折與阻礙之時，應當認清時勢，暫時退避，以待轉機的道理；同時也告誡君子，此時小人勢力增強，應堅持貞正，不要妄動。"
    },
    "yaoInterpretation": {
      "初六":"初六，遯尾厲，勿用有攸往。\n《象》曰：遯尾之厲，不往何災也。\n\n逃離在最後，危險，那裡都不要去。初位為尾，所以說是「遯尾」。就空間來說，初是最後面的位置，是留在原地而未逃離者。處遯之時，也是應該逃離的時候，初六以柔居下不當位，又處於尾。艮山之下，又有止而不走之象。既處遁逃之時，為何說「勿用有攸往」？有兩種可能。一是因為初已經來不及，所以只好留在原地以不變應萬變。二，所當遯去者為君子，於卦則只有陽爻當遯去。卦辭說小利貞，小者宜於貞定而不宜遯去。陰為小，因此初與二兩個陰爻都宜定而不宜往。初六說勿用有攸往，六二說執之用黃牛之革莫之勝脫。",
      "六二":"六二，執之用黃牛之革，莫之勝說。\n《象》曰：執用黃牛，固志也。\n\n以黃牛的皮革將它綁緊，牢固而無法鬆脫。革卦作「鞏用黃牛之革」，原指用皮革將豬綁緊讓它無法逃脫。後儒解釋認為這是比喻君子之意志堅定，有如用黃牛的皮革綁緊一樣的牢靠，意志堅定而無法鬆脫。",
      "九三":"九三，係遯，有疾，厲，畜臣妾吉。\n《象》曰：係遯之厲，有疾憊也。畜臣妾吉，不可大事也。\n\n心有牽掛的逃離，有心病，危險。畜養臣妾吉。原義應該是指繫綁的豬有病，因此若畜養豬為不順而厲。但若畜養臣妾則為吉。傳統解釋則認為這是君子遠遁之志有所牽係，無法擺脫名利的束縛，深深眷戀過往，無法超然物外，因此稱有疾，疾意指心病。雖然是應該隱退逃去的時候，但仍念念不忘富貴名利。諸如畜養臣妾等小事為吉，但對於一些國家大事，或是公務，則是凶。隱喻只能做些偏邪小事，不足以成大器。",
      "九四":"九四，好遯，君子吉，小人否。\n《象》曰：君子好遯，小人否也。\n\n好的隱退，君子吉，小人閉塞不通。遯卦為君子離去，九四開始才進入外卦，也是門闕之外，所以到九四才真正逃離。九四為逃離的開始，以「好」來形容。但君子與小人有不同的判斷。九四乾體，為君子之卦，又處外體，為能遁退者，因此君子為吉。但反之卻無利於小人，小人居此位則當閉塞而無所做為。",
      "九五":"九五，嘉遯，貞吉。\n《象》曰：嘉遯貞吉，以正志也。\n\n美好的隱退，貞定則吉。九五雖然是比九四逃得更遠的君子，然而以中正陽剛之德而居九五之尊位，是能逃但卻又為名與職位所累，不能完全逃去的一位。又與六二相應，代表多少仍有些許牽掛。所以與九四同樣，以「嘉」來形容。",
      "上九":"上九，肥遯，无不利。\n《象》曰：肥遯，无不利，无所疑也。\n\n自得而寬裕的逃離，無所不利。達到了隱退的最高境界，已有仙風道骨，天子都無法命令於你，達官貴人也無法和你高攀。心中無所懷疑，而能完全超然物外，對於世俗的榮辱名利，完全能看開。無所不利。遯卦中逃離的三個陽爻裡，九四與九五都還有初六、六二相應，上九不但與陰爻完全不相應，又居於遯卦的最外面，與任何一爻都沒有任何關聯，是最能夠放下一切，沒有任何遲疑而無所繫絆的逃離者，因此以「肥遯」形容。原義或指肥的豬，豬養得肥，代表豐盛與財富，因此無所不利。"
    }
  },
  "001111": {
    "name": "大壯",
    "pinyin": "dà zhuàng",
    "summary": "雷天大壯，雷鳴於天，剛健有力。(中吉)",
    "detailed": "大壯卦象徵力量增長，如雷聲震天，表示剛健有力，但亦需節制，不可過於魯莽。反應出大壯卦的三個不同面向：一是陽氣壯盛（陽壯），二是嚴重衝突（大撞），三是嚴重的傷害（大戕）。凡事應當多點冷靜審察情勢，不要莽撞，就能夠避免不必要的錯誤與災難。",
    "explanations": {
      "運勢": "運勢佳，勢力增長，但需適時收斂。易會有衝突，甚至受到傷害。",
      "感情": "有衝突、不合，需避免過於強勢。",
      "財運": "財運較好，適合擴展事業，但需穩健。",
      "工作": "工作發展順利，適合承擔更多責任。理直氣壯，據理力爭或可達到目標，到小心因此而造成與人衝突及不和。",
      "買賣": "交易有利，但不宜貿然擴張。",
      "考試": "考試運良好，努力可得佳績。",
      "健康": "健康狀況佳，但需避免過度消耗體力。",
      "訴訟": "訴訟可望獲勝，但不宜過於強硬。",
      "尋人": "尋人順利，對方可能處於活動狀態。",
      "尋物": "尋物可望找回，宜積極尋找。",
      "旅行": "旅行適宜，但需避免冒險行程。",
      "人際": "人際關係佳，宜與志同道合者共進。",
      "卦辭": "大壯，利貞。\n《彖》曰：大壯，大者壯也，剛以動，故壯。大壯利貞，大者正也。正大而天地之情可見矣。\n《象》曰：雷在天上，大壯，君子以非禮弗履。\n\n陽氣壯盛，宜於貞定。大壯有三層意義。一是陽氣旺盛（陽為大），二是「大撞」，如果不夠冷靜、遵循禮儀，則可能演變為「大撞」，就是衝突、衝撞。因此《象傳》說「君子以非禮弗履」。三是「大傷」，衝撞結果就是造成嚴重的傷害。\n\n【卦旨】在《周易》裡陽為大、陰為小，而壯又為壯盛、強盛，大壯卦象來看下面四爻皆為陽爻，上面兩條陰爻，陽強陰弱，陽為剛強，揭示事物處於全面強盛之時，應當堅持正道、捷還持中，而不可恃強自負、急進妄動，躁進而莽的道理。"
    },
    "yaoInterpretation": {
      "初九":"初九，壯于趾，征凶，有孚。\n《象》曰：壯于趾，其孚窮也。\n\n壯大在腳趾，出征一定是凶。初位為趾，故曰趾。趾有行動之初的意思，也隱喻這是末稍、卑微、無足輕重、妄動。壯于趾比喻這是空有樣子的壯盛，以此出征，必凶無疑。其初難知，初爻為情勢不明難知之時，此時用壯為躁動而無謀，因此為凶。壯也是傷，壯於趾為傷到腳趾。腳趾又可比喻行動的開始，行動的開始就受傷。",
      "九二":"九二，貞吉。\n《象》曰：九二貞吉，以中也。\n\n貞定為吉。大壯的吉道在於中庸、冷靜。九二有中庸之道，中立而不偏頗，因此而吉。",
      "九三":"九三，小人用壯，君子用罔。貞厲。羝羊觸藩，羸其角。\n《象》曰：小人用壯，君子罔也。\n\n小人用強大的蠻力控制失控的羝羊，君子則知道要用網子。堅定則有危險。公羊頂撞圍籬，那麼就要設法綁住羊角。大壯卦以羝羊來隱喻過盛的陽氣，談的是如何控制羝羊，如人控制過盛之血氣。小人與君子對於如何處理過盛的血氣顯然有所不同。小人以壯御壯，意氣用事而好勇鬥狠，有如羝羊以角觸藩。君子則能深思熟慮，以柔克剛，以網羅控制羝羊。罔字一語雙關，既是網羅，又通無，用罔頗有以空虛柔弱為用之義。如果堅定固執於壯，則會艱苦或危險。就如蠻幹的公羊，仗著自己有堅硬的羊角而頂撞圍籬，只知進不知退，羊角因此被困而進退不得。",
      "九四":"九四，貞吉悔亡。藩決不羸，壯于大輿之輹。\n《象》曰：藩決不羸，尚往也。\n\n貞定而吉之後得以不再後悔。撞倒圍籬，無法綁住羊的角，公羊撞壞了大車的車體。羝羊完全失控，有如人之血氣爆發，則只有破壞，讓事情一團亂。若能夠冷靜，則能夠變吉，不用後悔。「藩決不羸，壯于大輿之輹」另一最常見的解釋意思與此見解完全相反：圍籬已經倒下，前面的險阻已經排除，氣勢沒有被削弱，車子的輪輹也經過加強非常堅固，能夠走更長遠的路。這符合《象傳》「藩決不羸，尚往也」的解釋。此以壯為壯大。但此解釋文義邏輯並不通順。但不管那一個解釋，都是冷靜、鎮定為吉，衝動則凶。九四已到外卦，羊既已在外，所以是「藩決」之象，也就是圍籬已倒下。",
      "六五":"六五，喪羊于易，无悔。\n《象》曰：喪羊于易，位不當也。\n\n在有易這個地方損失了羊群，無所後悔。「喪羊於易」依朱熹解釋為在田邊讓羊走失了。依王弼、程頤，為喪失其剛壯的陽氣而變為和易，因此而無悔。喪羊比喻人不再氣盛。大壯卦中以「公羊」比喻「壯」，因羊秉性陽剛而愛「撞」，特別是公羊。因此喪羊，也就是「喪陽」。大壯卦之所以為「大壯」，是就下面四個陽爻而言，至六五，陽爻失，所以說「喪羊」。易，也有平易，心境坦然的意思。此當作「有易」，方國名。",
      "上六":"上六，羝羊觸藩，不能退、不能遂。无攸利，艱則吉。\n《象》曰：不能退，不能遂，不詳也。艱則吉，咎不長也。\n\n公羊用羊角頂撞籬笆，羊角卡住，不能進也不能退。沒有任何好處，艱苦則吉。此以公羊比喻衝撞反而讓事情陷入進退兩難的僵局，沒有任何好處。若反過來，能夠冷靜堅定，吃苦耐勞則吉。就全卦卦象來看，上六的陰爻兩斷像公羊的一對角在頂撞圍籬，因此上六雖不是陽，卻說「羝羊觸藩」。上六以陰柔的才性而居大壯的極高之處，才柔而無力以進，位極高而無路可退。柔而當位，若能艱貞則可為吉。"
    }
  },
  "101000": {
    "name": "晉",
    "pinyin": "jìn",
    "summary": "火地晉，明出地上，步步高昇。(大吉)",
    "detailed": "晉卦象徵前進與升遷，黎明之象。離又可象徵賢人，如火照耀大地，帶來光明與發展，君子應順勢而行，把握機遇。除了卜問感情，晉是一個大吉之卦，聰明才智會受到肯定。卜問生意與財運也都能有所斬獲。",
    "explanations": {
      "運勢": "運勢大吉，勇往直前，無往不利，事業可望步步高昇。",
      "感情": "花心而受到異性喜愛與包圍。感情運佳，須避免濫情。",
      "財運": "財運旺盛，適合擴展投資與財務管理。",
      "工作": "工作機遇良好，受到重用或肯定，發揮所長，宜積極進取便能亨通。",
      "買賣": "交易有利，可望獲得豐厚收益。",
      "考試": "考試成績優異，努力可獲佳績。",
      "健康": "健康良好，適合積極運動與養生。",
      "訴訟": "訴訟有利，正當行事可望勝訴。",
      "尋人": "尋人順利，對方可能正在向好方向發展。",
      "尋物": "尋物可得，宜快速行動。",
      "旅行": "旅行適宜，可能有愉快的收穫。",
      "人際": "人際關係良好，貴人運旺。",
      "卦辭": "晉，康侯用錫馬蕃庶，晝日三接。\n《彖》曰：晉，進也。明出地上，順而麗乎大明，柔進而上行，是以康侯用錫馬蕃庶，晝日三接也。\n《象》曰：明出地上，晉。君子以自昭明德。\n\n急速地進入敵方陣地，康侯貢獻馬匹眾多，一日連續三次告捷。晉此處有二義，一是進獻，講的是康侯進獻兵馬。二是疾進，可能是講三監之亂的某一戰役中，因康侯的眾多兵馬而告捷。晉為急速進入，藉以說明直取敵營。意思近似於高亨解釋的侵伐。高亨認為周易的晉有「侵伐」之意，本字應是「戩」。晉為疾進之義，有別於漸卦之漸進。晉卦的進，也有進獻之義。卦象上離日，下坤地，日出地上，黎明、希望之象。離又可象徵聰明、智慧、才華，坤為眾，離在坤上為才華出眾，能人得以擢升之象。\n\n【卦旨】晉同為「進」，但晉卦卦名用「晉」其既包含前進、進長之意，還多了晉升、光明之意，也就是像著光明前進之意，揭示前進求發展之時，必須保持光明美德、堅持柔順中正， 容眾專一，而不可進長過甚的道理。"
    },
    "yaoInterpretation": {
      "初六":"初六，晉如摧如，貞吉。罔孚裕无咎。\n《象》曰：晉如摧如，獨行正也；裕无咎，未受命也。\n\n長驅直入，無人能擋，貞定為吉。捕獲的俘虜眾多，沒有罪咎。傳統解釋為進退兩難，貞定則吉。不受信任，保持寬裕則不會有罪咎。初六因處最卑微之位，所應為四非君（五才是君位），受到懷疑，無法讓人信任，因此受到挫折，無以進升，進退兩難。貞吉意謂堅定不動，以守正之不變應萬變則可吉。保持內心的寬泰，可得无咎。",
      "六二":"六二，晉如愁如，貞吉。受茲介福，于其王母。\n《象》曰：受茲介福，以中正也。\n\n康侯協助周公伐商邑，雖然進兵順利，但因兄弟相殘，還必需兼及母親之感受，因此而憂愁。後來受到王母的祝福。六二之愁如，雖柔中，但前有艮山阻擋，上與六五無應，靜而難動者。",
      "六三":"六三，眾允，悔亡。\n《象》曰：眾允之，志上行也。\n\n眾人允諾，不再後悔。六三承四應上，率眾陰承順於九四君子，因此能得眾人之允許、信任。眾人皆認同，因此無悔。六三為下坤之上，率三陰爻以承九四，眾允之象。",
      "九四":"九四，晉如鼫鼠，貞厲。\n《象》曰：鼫鼠貞厲，位不當也。\n\n像鼫鼠一樣的進入，堅持則危險。傳統解釋「鼫鼠」為比喻有如小人，貪婪而到處鑽營，因此不可堅定於此。此處應該以戰術之使用來看，要有如鼫鼠一樣，以隱伏方式攻入。或者不應拘於正規戰法或單一戰法，要像鼫鼠一樣有五種技法，若堅持正規或單一的戰法為「貞」，貞則厲，有危厲。九四居互體坎中艮上，坎為隱伏，艮為鼠，隱伏在下的鼠即鼫鼠。",
      "六五":"六五，悔亡，失得勿恤，往，吉无不利。\n《象》曰：失得勿恤，往有慶也。\n\n不再後悔，誓在必得，勿憂慮，前往，將吉而無往不利。「失得勿恤」當作「矢得勿恤」。傳統註解作「失得勿恤」，意思為不要有得失心，患得患失。《象》曰：「失得勿恤，往有慶也。」得失不要在意，前往則能夠有喜慶。六五為晉卦的主爻，也是君位，處上離之中。離為矢為得。",
      "上九":"上九，晉其角，維用伐邑，厲吉无咎，貞吝。\n《象》曰：維用伐邑，道未光也。\n\n長驅直入，勢如破竹，藉此氣勢來征伐城邑。以此而進，雖艱苦但可得吉而無咎，若堅定不進則將有吝。晉卦為康侯助周公及成王平三監之亂的故事，此處的邑當指武庚的商邑。晉其角為形容其進入商邑勢如破竹的樣子。大壯九三羸其角，為羝羊羊角纏繞而受困，過剛而無以前進。姤卦上九姤其角，亦是過剛而不得進之義。反觀晉上九，剛而居柔，又為六五所承，為剛得柔助，動而能進者，因此曰「晉其角」。以此征伐商邑，雖艱困但能得吉而無咎。"
    }
  },
  "000101": {
    "name": "明夷",
    "pinyin": "míng yí",
    "summary": "地火明夷，明入地中，晦暗難行。(小凶)",
    "detailed": "明夷卦象徵光明受傷，如太陽被遮蔽，表示處境不利，君子應低調行事，避開災禍。局勢混亂，求財求事皆無成，不要想著功成名就，應當以明哲保身、求取生存為第一要務。",
    "explanations": {
      "運勢": "黑暗時刻，諸事不成，反受誅害。運勢不佳，宜韜光養晦，等待時機。",
      "感情": "遭人摒棄，受到情傷。感情關係易受外界影響、易被誤解、欺瞞，需穩定心態。",
      "財運": "財運較低，投資宜保守，勿盲目跟風。",
      "工作": "情勢動亂，凡事退避，明哲保身。工作易遇阻礙，宜保持耐心，避免衝突。",
      "買賣": "交易市場不佳，宜謹慎決策。",
      "考試": "考試運一般，需努力克服困難。",
      "健康": "健康需注意，易有疲勞與內在損耗。",
      "訴訟": "訴訟進展不順，宜保持低調應對。",
      "尋人": "尋人困難，對方可能刻意隱藏行蹤。",
      "尋物": "尋物較難，可能遺失於陰暗處。",
      "旅行": "旅行不宜，易有不測風險。",
      "人際": "人際關係易受損，爭理易被誤解，宜謹言慎行。",
      "卦辭": "明夷，利艱貞。\n《彖》曰：明入地中，明夷。內文明而外柔順，以蒙大難，文王以之。利艱貞，晦其明也。內難而能正其志，箕子以之。\n《象》曰：明入地中，明夷。君子以莅眾，用晦而明。\n\n光明隕落消失，利於艱苦與貞定。明夷為大型流星墜落，光明火球橫空而出之後又消失於地，並造成災難。依《易傳》及傳統注解，明夷卦講的可能是商紂無道的故事。\n\n【卦旨】明夷為光明殞傷,從明夷卦象來看上坤下離卦，坤為地、離為日，所以整個卦象為日落地下，黑暗來臨，揭示處於政治黑暗、光明泯滅的艱難昏亂之世，君子應當自晦其明、堅持正道，等待並爭取光明前景的道理。"
    },
    "yaoInterpretation": {
      "初九":"初九，明夷于飛，垂其翼。君子于行，三日不食。有攸往，主人有言。\n《象》曰：君子于行，義不食也。\n\n明夷鳥（金烏）飛過天空，翅膀下垂遮天。君子逃難出行，三天不得飲食。有長遠的路要走，主人以言語相譏。此處的明夷為金烏鳥，明夷于飛講的是巨大的流星從天而降，古代認為這是會飛的太陽。「垂其翼」形容巨大隕石掉下來時一片焦土與黑暗，有如世界末日。這是關於上古一場天文災難的記載，因為這場災難而造成了飢荒，連君子都要逃難以致於三天都沒有飯吃。傳統解釋以明夷為夜晚，比喻黑暗的時代，也可指鳥的翅膀受傷。明夷于飛，指鳥在夜晚飛行，喻指君子在亂世逃難，或者鳥受傷仍在飛。垂其翼，翅膀下垂，因為受傷而下垂。此比喻逃難之急迫與狼狽。",
      "六二":"六二，明夷，夷于左股，用拯馬壯吉。\n《象》曰：六二之吉，順以則也。\n\n光明消失，傷到了左大腿，能有強壯的馬來拯救則吉。在流星隕石掉落的這場災難裡，傷到了左大腿而難以逃亡，這時當努力拯救，若有強壯的馬將得以逃離而吉。這裡的「吉」，是指在動亂中逃難生存下來，所以是大難不死的吉，並不是飛黃騰達、萬事如意的吉。或者可以說是不幸中的大幸，真實處境是大凶，只是能夠化險為夷而已。",
      "九三":"九三，明夷于南狩，得其大首，不可疾貞。\n《象》曰：南狩之志，乃得大也。\n\n光明隕落於往南狩獵的時候，去除了罪魁禍首，不可以急速的方式推行正道。出征可以有很大的斬獲，遂其所願，但注意凡事不可操之過急。傳統通解認為南狩是為討伐明夷之主，也就是暗昧無明的君王。從初九可推斷出明夷講的是十個太陽與后羿射日的故事，那麼南狩講的可能就是傳說中帝堯派遣后羿去射日。離日在南，故曰南狩。",
      "六四":"六四，入于左腹，獲明夷之心，于出門庭。\n《象》曰：入于左腹，獲心意也。\n\n傳統解釋以為，這是以不正的手段接近昏君，成為他的心腹，然後在門外耀武揚威。此言小人以偏邪的方法接近昏君，助紂為虐，為虎作倀。另一說認為這是微子啟的故事，微子是商紂左右心腹之臣，因看透紂王之心，知道紂王暴民無道，最後必將亡天下，是不值得輔佐的君王，因此毅然遠去。",
      "六五":"六五，箕子之明夷，利貞。\n《象》曰：箕子之貞，明不可息也。\n\n箕子處亂世而能隱藏其聰明，韜光養晦，利於貞定。此以箕子的故事講處亂世之道。箕子為商紂的叔父，雖知商紂無道，但不忍棄之而去，於是亂髮裝瘋，以躲避禍害。此比喻人處亂世，應當要韜光養晦，隱藏自己的聰明，堅定意志，心存正直之心，靜待世局的轉變。武王伐紂之後，向箕子請益，而作《洪範》。此處明夷的明當指聰明，明夷意指箕子能夠隱藏自己的聰明。",
      "上六":"上六，不明晦，初登于天，後入于地。\n《象》曰：初登于天，照四國也；後入于地，失則也。\n\n從大放光明而變黑暗！明夷鳥先是飛上了天空，接著又墜落於地。此在描繪流星從天空出現到墜落的過程。古人將天空飛的都視為飛鳥，流星在天空時為一團火球光體，有如太陽般光明。初登於天為火球出現於空中，後入於地為隕石墜落。傳統以為這是比喻紂王為虐，身處最尊貴的地位，原本應德澤光耀而明照四國。然而行為無道，不只失去天下，還帶來殺身之禍。初登於天，言紂之登基。後入於地，言紂之被殺。"
    }
  },
  "110101": {
    "name": "家人",
    "pinyin": "jiā rén",
    "summary": "風火家人，風自火出，和睦持家。(中吉)",
    "detailed": "家人卦象徵家庭與和睦，如風助火勢，象徵家道興旺。君子應以仁愛為本，維繫家庭與團隊的穩定。凡事應當優先反躬自省，處理好自己的份內事、家務事，家有賢良，治家有方，處理好了一切問題都可迎刃而解。",
    "explanations": {
      "運勢": "運勢良好，適合穩定發展，家庭和諧。優先管理好家事、份內之事，事情自然能夠順利。女性者諸事皆吉。",
      "感情": "感情關係穩定，適合談婚論嫁。婚姻幸福，女人賢慧，可以旺夫。",
      "財運": "財運平穩，適合長期規劃。",
      "工作": "工作宜團隊合作，家庭事業並重。應當管理好自己部門內，或是自己職務上的事，諸事自然順利，水到渠成。",
      "買賣": "交易適宜與熟識人士進行，互惠互利。",
      "考試": "考試運佳，適合家人支持下努力。",
      "健康": "健康穩定，宜關注家人健康。",
      "訴訟": "訴訟宜尋求和解，不宜爭鬥。",
      "尋人": "尋人順利，對方可能與家人有聯繫。",
      "尋物": "尋物可望找回，宜在家中或熟悉場所查找。",
      "旅行": "旅行適合家庭同行，增進感情。",
      "人際": "人際關係和諧，家庭關係影響外界人際互動。",
      "卦辭": "家人，利女貞。\n《彖》曰：家人，女正位乎內，男正位乎外，男女正，天地之大義也。家人有嚴君焉，父母之謂也。父父，子子，兄兄，弟弟，夫夫，婦婦，而家道正。正家，而天下定矣。\n《象》曰：風自火出，家人，君子以言有物，而行有恆。\n\n家人，利於女子的貞定。家人卦的成卦主爻為六二，六二具中正之德，為女正之爻，因此曰利女貞。利女貞有三種解釋。一、利女正：貞為正的意思，就是彖傳說的「女正位乎內」，意思是家中女子都安份而賢淑則有利。二、利女卜問：利於女子的卜問，凡是女子占問，都有利，為吉。貞即卜問的意思。三、利女之貞潔：貞有貞操、貞固、堅定的意思。利於女子守貞操，有把家中女子管好的意味，引申為必需管理好自己家裡的事。\n\n【卦旨】家人為一家之人，如何管理好一家之人，使家人團結一心，和睦相處呢？家人卦以夫婦關係為中心，講述治家之道，揭示家庭內部應當男威女順，共同以正道而從嚴為治的道理，並由治家之道推廣到治國平天下的普遍原則。"
    },
    "yaoInterpretation": {
      "初九":"初九，閑有家，悔亡。\n《象》曰：閑有家，志未變也。\n\n整肅家風，建立家道，預防家中成員的散亂。建立家風，免於後悔。閑有家或可解釋為很嫻淑地持家。",
      "六二":"六二，无攸遂，在中饋，貞吉。\n《象》曰：六二之吉，順以巽也。\n\n沒什麼才能，只會燒飯煮菜，貞定則吉。此言女子雖沒有什麼才能，但能夠完全勝任家中的內務，將家中一切打理得很好。",
      "九三":"九三，家人嗃嗃，悔厲吉。婦子嘻嘻，終吝。\n\n《象》曰：家人嗃嗃，未失也。婦子嘻嘻，失家節也。\n家人很嚴厲，後悔又艱苦之後就是吉。反之，如果家裡婦女小孩嬉鬧，最後會悔恨。一家之主治家嚴格，對家人大聲斥罵，使得家中女人小孩都因此而害怕。治家過於嚴厲不免有傷恩慈，但也由於能夠整治，所以才能漸趨於吉，雖然過程會有些艱苦。反之，若家中婦女小孩嬉鬧不端莊，治家不嚴，那麼就會悔吝。「悔厲吉」說明「家人嗃嗃」之後的三個階段，首先是讓人後悔，因為家人過於嚴厲不免有失親情，因而心痛後悔。接著又是艱苦，厲可作危險，或艱苦。最後則因為嚴厲讓家風得到端正而得吉。",
      "六四":"六四，富家，大吉。\n《象》曰：富家大吉，順在位也。\n\n能夠治理家務，事事進入軌道，家道興旺，享有財富，大吉。《象》曰「順在位」，六四為上巽主爻，柔而當位，承順九五，因此稱順在位。巽為近利市三倍，為富，六四為巽之主爻，故曰富家。小畜九五處上卦巽中，曰「富以其鄰」，泰六四居互體震中，謙六五互體震上，震伏巽為巽象不見，故曰「不富以其鄰」。无妄六二下體震中，象曰「不耕穫，未富也」。",
      "九五":"九五，王假有家，勿恤，吉。\n《象》曰：王假有家，交相愛也。\n\n大王到此成立家室，不用擔憂，吉。家和萬事興，就連為人之君者，也要從治理家道而做起。由於家道已成，所以心中大可不必憂慮。大王以寬大治家，大家能彼此互相相愛，所以諸事和諧，吉。",
      "上九":"上九，有孚威如，終吉。\n《象》曰：威如之吉，反身之謂也。\n\n有誠信，又有威嚴，最後為吉。能夠以身作則，經常反身自省，有誠信與威嚴，家道當興。治理家道如過於注重禮數則有礙親情，但如果過於注重和樂則會失於教養。此爻過於注重威嚴，能治理家道，但應避免有傷親情。不過只要是出自真心真愛，最終為吉。"
    }
  },
  "101011": {
    "name": "睽",
    "pinyin": "kuí",
    "summary": "火澤睽，上火下澤，分歧對立。(小凶)",
    "detailed": "睽卦象徵分歧與對立，如火在澤上，一動一靜，一陽一陰，方向相反，代表彼此不合，君子應調整心態，以求和解。人與人之間意見不和並不見得是壞事，如何包容異己，同中存異，和而不同，讓「不同」不變成「不和」是卜得睽卦該學習的智慧。",
    "explanations": {
      "運勢": "人事不和。若事情能獨自完成則小吉，否則應當設法解決人與人之間不和的問題。運勢較弱，人際關係易起爭執。",
      "感情": "感情關係易有誤會，需耐心溝通。感情不睦，分手。",
      "財運": "財運不穩，易有經濟糾紛，宜謹慎處理。",
      "工作": "孤軍奮戰。可以做小事，無法做大事。工作中可能出現分歧，需積極溝通。",
      "買賣": "交易不順，容易產生分歧，宜謹慎決策。",
      "考試": "考試運普通，需克服內心焦慮。",
      "健康": "健康需注意，情緒起伏影響身體狀況。",
      "訴訟": "訴訟不利，宜考慮調解，避免激化矛盾。",
      "尋人": "尋人困難，對方可能刻意疏遠。",
      "尋物": "尋物較難，可能因誤放而遺失。",
      "旅行": "旅行不宜，易遇衝突或不順。",
      "人際": "人際關係易有對立，宜以包容心態面對。",
      "卦辭": "睽，小事吉。\n《彖》曰：睽，火動而上，澤動而下，二女同居，其志不同行。說而麗乎明，柔進而上行，得中而應乎剛，是以小事吉。天地睽而其事同也，男女睽而其志通也，萬物睽而其事類也，睽之時用大矣哉。\n《象》曰：上火下澤，睽，君子以同而異。\n\n小事吉，大事則因人心違和，缺乏團隊合作而難成。睽為乖離，人與人不和，之所以小事吉，睽卦內兌悅而外離明，六五（睽卦主爻）具有柔順中庸的美德，又與九二相應（得中而應乎剛），所以小事吉。小事也可意指私事，或者是不需與人合作之事。反之，大事為公事，或者必需團隊合作之事。\n\n【卦旨】睽為乖異背離，睽卦象離火動而上，兌澤動而下，由於火的特性炎上而澤向下流淌，水火背離既睽也，其二、上離下兌，離為二女兒，兌為小女兒，即二女同居雖說小時候生活在一起，但長大後各自嫁人而分離，所以也符合睽卦乖異背離之意，揭示處於乖背違逆的情況下，應當柔和大度、求同存異，以逐漸消除隔閡對立，達到和諧一致的道理。"
    },
    "yaoInterpretation": {
      "初九":"初九，悔亡，喪馬勿逐自復。見惡人，无咎。\n《象》曰：見惡人，以辟咎也。\n\n後悔消失，失去的馬不用追逐，自己會跑回來。見惡人則可免罪咎。處於睽違孤獨的時候，應有去者不追，來者不拒的心理準備，凡事不可強求。失去的馬，不必去追逐，該回來的時候它自然會回來。惡人，人之所惡，但是該見之時還是必需與他見面，以避免罪咎。處睽乖的時候，事情發展往往不依常規，違背心願。因此凡事不宜堅守窠臼，當無可無不可。",
      "九二":"九二，遇主于巷，无咎。\n《象》曰：遇主于巷，未失道也。\n\n在小巷道內與主人相遇，沒有罪咎。得此爻，若是為人主管求才，則無法以正式的手段求得，必須求之於巷道，臺面下運籌，或委曲輾轉而得；而如果是要謀事，也當如此。小巷非正道、大道，小巷道相遇，比喻不是很光明正大，而是暗地進行，或不由正規之途徑。但成大事不拘小節，所以象傳說：「遇主于巷，未失道也。」九二與六五相應，為「遇主」之象，六五即所遇之主，六五爻說的「其宗」。然而睽卦為人事乖離的時候，凡事不依常理而行。九二與六五之間又有坎險（三至五爻的互卦為坎），因此遇主於巷實為不得已，勢之所然，只要不違背正道，當然沒有罪咎可言。",
      "六三":"六三，見輿曳，其牛掣，其人天且劓。无初有終。\n《象》曰：見輿曳，位不當也。无初有終，遇剛也。\n\n見到有人因車子難以前進而在拉車，牛不斷地在仰頭使力。這個人額頭上有犯罪遭刑的刺青，鼻子被割掉。開始很糟糕，但最後算是有個結果。此言車子前進時困難，以致於牛很使力。車子是遠行及載物的工具，車子困住，比喻事情前進有困難，停頓無法前進。",
      "九四":"九四，睽孤，遇元夫，交孚，厲无咎。\n《象》曰：交孚无咎，志行也。\n\n分離而孤獨，遇到部落的族長，彼此交心互信，艱苦則沒有罪咎。雖然處境受到孤立，孤獨無援到極點，但由於遇到與自己同德的朋友，能以誠心相交而共處時艱，終能免於罪咎。九四居於互體坎中，處多懼之位而為六五所乘。初九及六三都有「惡人」之描述，注家多認為「惡人」即指九四，則九四是眾人眼中的惡人，因而受到孤立。但九四乃面惡心善之人，或者是有前科但並不是那麼壞的人，而且與人可以誠信相交，唯眾人以貌取人。現在則遇到知音，與他誠心相交，故得無咎。",
      "六五":"六五，悔亡，厥宗噬膚，往何咎。\n《象》曰：厥宗噬膚，往有慶也。\n\n不再後悔，族人或宗主吃好吃的膚肉，前往不會有罪咎。噬膚，有兩種解釋。一是受到肌膚之刑，受傷很淺，可再參考噬嗑卦六二：「噬膚滅鼻，无咎。」第二種解釋是吃到柔脆好吃的膚肉。膚為食物，帶皮、外脆內軟，好吃的肉。《象傳》說「往有慶也」，則噬膚應當解釋作吃好吃的膚肉，不當解釋為刑罰。",
      "上九":"上九，睽孤，見豕負塗，載鬼一車。先張之弧，後說之弧。匪寇婚媾，往，遇雨則吉。\n《象》曰：遇雨之吉，群疑亡也。\n\n見到的怪事太多，讓人心生許多疑慮，一下子見到全身裹滿泥巴的豬（比喻見到的事很污穢骯髒），一下子見到載滿鬼方的車子（比喻詭譎到極點）。因此讓人一下子張弓，一下子又將弓鬆脫。此鬼方或指後文之「匪寇」，是要來婚媾的。遇雨，象徵事情終於明朗，疑慮盡釋。《象傳》說的「群疑亡也」。"
    }
  },
  "010100": {
    "name": "蹇",
    "pinyin": "jiǎn",
    "summary": "水山蹇，山間水阻，舉步維艱。(小凶)",
    "detailed": "蹇卦的「蹇」的原意為跛腳，象徵困難與阻礙，如水困於山間，行動受阻。君子應保持耐心，穩步前行，逐步克服困境。諸事不宜，強行則有危險。知難而退，等待機會，蹇卦為東北之卦（坎艮位於東北），因此東北方有難。反之，西南方則較為有利。",
    "explanations": {
      "運勢": "不宜行動，退守為宜。運勢低迷，諸事不順，需耐心應對。",
      "感情": "困頓無法有進展。感情發展受阻，需多加溝通與包容。",
      "財運": "財運不佳，投資宜保守，避免損失。",
      "工作": "事情窒礙難行，應當知難而退，重新閉關學習成長。工作進展緩慢，需尋求突破口。",
      "買賣": "交易不利，可能遇到阻礙或延期。",
      "考試": "考試運較差，需加倍努力。",
      "健康": "健康需注意，易有疲勞或慢性疾病。",
      "訴訟": "訴訟難解，需做好長期應對準備。",
      "尋人": "尋人困難，對方可能遇到困境。",
      "尋物": "尋物較難，可能被障礙物遮擋。",
      "旅行": "旅行不宜，途中可能遇阻礙。宜待在家中。",
      "人際": "人際關係受限，易有誤會與摩擦。",
      "卦辭": "蹇，利西南，不利東北。利見大人，貞吉。\n《彖》曰：蹇，難也，險在前也。見險而能止，知矣哉。蹇，利西南，往得中也；不利東北，其道窮也。利見大人，往有功也；當位貞吉，以正邦也。蹇之時用大矣哉。\n《象》曰：山上有水，蹇，君子以反身脩德。\n\n難行，利於西南方，不利東北方。利於見大人。貞定為吉。蹇卦上坎下艮，艮為東北之卦，外坎為險，為東北有難，往東北將道窮，無法前進。反之往西南則有利。大人，古時候指當官的人。當今除了當官的人之外，還可指有職位的人，長官、上司，或者是社會上有名望，德高望重的人。蹇卦有艮無坤，為何言「利西南」？一種說法認為，蹇卦坎險在外，艮在內，為不利東北之象。西南在東北（艮）的相反方，因此不利東北可兼言利西南，就如坤卦無艮卦，同時說「西南得朋，東北喪朋」。\n\n【卦旨】蹇為「行走險難」，但與屯卦的「難」性質不一樣，屯卦的難是由於事物之初生，一時無生存或生活能力，因而比較難，而蹇卦的難則是由於前面遇到危險，一時難以行進之難，揭示處於險難之時， 應當柔順待時、進退適宜的道理，同時也強調了上下同心、和衷共濟的重要作用。"
    },
    "yaoInterpretation": {
      "初六":"初六，往蹇來譽。\n《象》曰：往蹇來譽，宜待也。\n\n前往會遇到困難，回來則會得到聲譽。處於蹇難的時刻，若是硬要前進則會更加危險，但如果能後退一步，則反而能得到好的名聲。應採取保守態度，宜退守，不宜進取。",
      "六二":"六二，王臣蹇蹇，匪躬之故。\n《象》曰：王臣蹇蹇，終无尤也。\n\n王臣上諫再上諫，這不是可以噤聲不言的事。「王臣䞿䞿」講的是事情的困難，因為知道事情非常困難，所以用「䞿䞿」重文來形容（蹇者難也，智通知），以告戒當今之人。君子知道困難而做好準備，那麼就不難了。見到「幾」之後就努力去做，那麼就可以有功業，所以為困難做好準備事情就變容易。所謂的「務幾」（致力於洞察事情之微妙之處），意思是成功的條件存在於人，所以爻辭不講吉凶。所謂的「非今之故」，不只今日如此，古代亦然。",
      "九三":"九三，往蹇來反。\n《象》曰：往蹇來反，內喜之也。\n\n前往有難，不如回來比較好。爻辭並未說吉凶，象傳則說明「來反」是因為有喜。九三居互體坎中，雖與上六相應，但上六無位又體屬陰柔，不但無以濟險，兩爻中間又是坎卦，往至外卦亦是坎，這是「往蹇」。",
      "六四":"六四，往蹇來連。\n《象》曰：往蹇來連，當位實也。\n\n前往則有難，歸來則可得盟友。傳統多解釋為往蹇，來亦連蹇。連或解釋為難，往來皆蹇難的意思。六四為近君多懼之位，又處互體坎卦之終，上體坎卦之始，故有往來皆蹇的卦象。承順九五，九五為蹇卦卦主。動則上體成兌為傷，靜則承五為順，為九五所濟。",
      "九五":"九五，大蹇朋來。\n《象》曰：大蹇朋來，以中節也。\n\n最險難的時候，朋友來。九五居上體坎中，是最危險的時候，因此曰大蹇。九五為君位，也是蹇卦卦主，剛中當位，五多功，下有六四相承，內有六二相應，故曰朋來。得此爻雖遇大難，但除自己本性陽剛得以自救之外，還將有多方朋友來相助，化險為夷。",
      "上六":"上六，往蹇來碩，吉，利見大人。\n《象》曰：往蹇來碩，志在內也；利見大人，以從貴也。\n\n前往有難，回來則大有獲得，吉。利於見大人。已在蹇難的絕地，若是要再繼續往前，無人可以救濟，情勢將無法有所轉圜。但往回走則能有很大的收獲。宜於拜見大人，吉。艮為碩果。剝卦上九「碩果不食」。上六應下體艮之九三，往則蹇極乘九五之剛，來則應乎艮，故曰往蹇來碩。或讀作「往蹇來碩吉」，「碩吉」即「大吉」。前往則有蹇難，回來則大吉。"
    }
  },
  "001010": {
    "name": "解",
    "pinyin": "xiè",
    "summary": "水雷解，雷動水險，困厄得解。(中吉)",
    "detailed": "解卦象徵化解與釋放，如雷雨過後萬物復甦，表示困境即將解除，君子應寬容待人，順勢而行。凡事要積極主動，遇到任何事情，不要拖延，馬上解決則吉，以積極行動而讓自己化險為夷。",
    "explanations": {
      "運勢": "積極主動則可解決問題。運勢好轉之象，困境即將化解。",
      "感情": "有分手危機，但問題盡早解決仍可轉圜。感情關係可改善，適合和好與溝通。",
      "財運": "財運回升，可望緩解經濟壓力。",
      "工作": "任何問題都要掌握時機盡快做決定，馬上解決。工作中的阻礙可望消除，逐步順遂。",
      "買賣": "交易逐漸好轉，市場環境變佳。",
      "考試": "考試運勢回升，需把握機會。",
      "健康": "健康狀況改善，適合放鬆與調理。",
      "訴訟": "訴訟可望和解，宜理性處理。",
      "尋人": "尋人順利，對方可能已脫離困境。",
      "尋物": "尋物可得，可能重新出現。",
      "旅行": "旅行適宜，可放鬆身心。若有出行，則盡早出發為宜。",
      "人際": "人際關係改善，適合化解誤會。",
      "卦辭": "解，利西南。无所往，其來復吉。有攸往，夙吉。\n《彖》曰：解，險以動，動而免乎險，解。解，利西南，往得眾也；其來復吉，乃得中也；有攸往夙吉，往有功也。天地解而雷雨作，雷雨作而百果草木皆甲坼，解之時大矣哉。\n《象》曰：雷雨作，解。君子以赦過宥罪。\n\n危險緩解，利於西南方。若是沒有要去那裡，那麼回家為吉。若是要去什麼地方，趕早則吉。行動以脫離危險，這是以二體卦象說明解卦必需採取積極行動。「利西南，往得眾也」，西南為坤，坤為眾，故往西南可得到群眾。得眾亦可解難。總言之，得解卦凡事需積極處理與面對，無事則快快回家休息，有事則立即行動前往。\n\n【卦旨】解為解散或解除險難，解卦之上一卦為蹇卦，蹇卦是前方有險難，而危險必須想方法解除，這樣才能繼續前進，所以解卦有解除危險和危險得以解除之意，揭示排患解難，尤其是消除內部隱患應當迅速及時、堅持誠信、根絕後患的道理。"
    },
    "yaoInterpretation": {
      "初六":"初六，无咎。\n《象》曰：剛柔之際，義无咎也。\n\n沒有罪咎。處於解除危難的初期，無所罪咎。此時宜安靜休養生息，將來才能凡事得宜。初六雖在坎下，但上承九二，外又與九四相應，柔在最下而能安。九四是震動的主爻，也是解卦中解脫危險的主爻，因此初六能夠為兩個陽剛之爻所解救。",
      "九二":"九二，田獲三狐，得黃矢，貞吉。\n《象》曰：九二貞吉，得中道也。\n\n畋獵捕獲三隻狐狸，並獲得黃色的箭頭，貞定則吉。此比喻能去除邪惡的小人，並能秉持中庸之道，有獲利之象。田獲三狐，喻指處理了麻煩的人物。",
      "六三":"六三，負且乘，致寇至，貞吝。\n《象》曰：負且乘，亦可醜也。自我致戎，又誰咎也。\n\n小人背負財物，又搭乘君子的車乘，招搖過市，而引來盜賊搶奪。貞定則有悔恨。小人背負著物品，搭乘大人才能坐的車子，是小人招搖過市，因此引來盜賊覬覦，搶奪財物。此告戒人行事當守本份，不當踰越。當知密藏，不要炫耀。凡事當注意，自己的言行不當將會引來災禍。正所謂禍福無門，惟人自召。",
      "九四":"九四，解而拇，朋至斯孚。\n《象》曰：解而拇，未當位也。\n解救你的腳趾，等朋友來了，才終於事情落實而可信。解而拇比喻沒有對症下藥，無濟於事。拇（腳趾）這裡指的是初六，《易經》中常以初爻為腳趾，並可比喻為枝微末節，無關緊要的末稍，或是行動的開始。因九四與初六相應，有陽濟陰弱之象。",
      "六五":"六五，君子維有解，吉，有孚于小人。\n《象》曰：君子有解，小人退也。\n\n君子遭到拘繫得以獲得釋放，吉，讓小人信服。君子維有解另可解釋為因君子的維繫而得到解救。",
      "上六":"上六，公用射隼于高墉之上，獲之，无不利。\n《象》曰：公用射隼，以解悖也。\n\n王公藉以在高牆上射擊隼鳥，一發就中，無往不利。此段言君子藏器，見機行事，因時而動。一見有背叛者，快、狠、準地立即出手，一定會有收獲。比喻的是君子對於事件有所預見與準備，當事情發生時就能夠明快的處理。"
    }
  },
  "100011": {
    "name": "損",
    "pinyin": "sǔn",
    "summary": "山澤損，山下澤水，減少以得。(吉)",
    "detailed": "損卦象徵減少與節制，如山下澤水減少，但換來穩固。君子應懂得取捨，犧牲小利以換取更大成就。損並不是一般人常識中認為的「損失」，是一個壞卦。反而是「元吉」且「利有攸往」──所以其實損卦是個還算不錯的卦，只要你眼光放遠，願意暫時小小犧牲一下。",
    "explanations": {
      "運勢": "運勢尚佳，需懂得放棄不必要的執著。凡事眼光放遠，不要計較眼前利害得失，則吉而無咎。但若只著眼於眼前利益，損卦為大凶。",
      "感情": "動乎情、止乎禮，以後還有機會，縱情則惹禍上身。感情需互相讓步，關係方能穩定。",
      "財運": "財運需減少不必要開支，精打細算。",
      "工作": "工作上適合精簡計畫，聚焦重點。宜犧牲個人以成就長官，放長線釣大魚。",
      "買賣": "交易需有策略，適時降價或讓利。",
      "考試": "考試需去除雜念，專注學習。",
      "健康": "健康狀況可控，需減少壓力與負擔。",
      "訴訟": "訴訟宜退讓一步，以換取更好的結果。",
      "尋人": "尋人可能需減少範圍，精準尋找。",
      "尋物": "尋物可能已遺失，需接受現實。",
      "旅行": "旅行宜輕裝簡行，減少不必要花費。",
      "人際": "人際關係需減少不必要的社交，聚焦真誠關係。",
      "卦辭": "損，有孚，元吉，无咎，可貞，利有攸往。曷之用，二簋可用享。\n《彖》曰：損，損下益上，其道上行，損而有孚，元吉。无咎，可貞，利有攸往，曷之用，二簋可用享，二簋應有時，損剛益柔有時，損益盈虛，與時偕行。\n《象》曰：山下有澤，損，君子以懲忿窒欲。\n\n減損，有誠信，元吉則可沒有罪咎，而可以貞定，利有所往。要用什麼來供奉祭祀？簡單兩個盤子的黍稷雜糧就可。損即精省、精簡之道，若用在祭祀，則貴在虔誠。整段的吉凶判斷為「利有攸往」，但條件相當的多，簡單來說則是「有孚」兩字。此言虔誠之重要，虔誠可得元吉，而無咎，而可貞，最終才得利有攸往。最後談到「損，有孚」如何用在祭祀上。損之為道，重在誠心，簡單兩盤的黍稷做為供奉就可。程頤以「損飾以存誠」解釋，最得其義。《彖傳》則強調「時」，減損用在祭祀當有時，時機不對，亦不宜減損。\n\n【卦旨】損為減損，損卦中的損主要是指損下而益上，損卦上卦為艮，艮為山，下卦為兌，兌為澤，這就好比山腳下挖土去增添山的高度，導致山腳下成為一片澤地，從山腳下挖土去增山的高可行嗎？當然可行，但不可過度，否則動搖山的根基，不但沒有使山更高，反使山體崩落、大澤掩埋，揭示損下益上時必須堅持誠信、適時的基本原則，以及損下、益上均不可過濫的義理。"
    },
    "yaoInterpretation": {
      "初九":"初九，已事遄往，无咎，酌損之。\n《象》曰：已事遄往，尚合志也。\n\n祭祀之事要快速前往，沒有罪咎。倒的酒可以減少一些。快速前往言參與祭祀的誠心。酌損之承上爻，祭祀重誠，有誠則精簡、減損無妨。另一解釋為，有事而快速前往，沒有罪咎。斟酌減損，不需減損太多。",
      "九二":"九二，利貞，征凶。弗損，益之。\n《象》曰：九二利貞，中以為志也。\n\n利於堅定，出征為凶。不需減損，反應當增益。宜於守住既有，不宜出征或進取。若能安於目前狀似平平的情勢，未必會不利。但如果貿然前往，反而會帶來災難。以靜制動則小吉，出征則凶。損卦原為損下益上的意思，但九二居中，是有中庸之德者，雖與六五相應，但不宜減損自己而迎合在上者，反應堅持及強化自己的中庸美德。",
      "六三":"六三，三人行，則損一人。一人行，則得其友。\n《象》曰：一人行，三則疑也。\n\n三人同行，則減少一人。若是一人獨自前往，則可得到朋友。此言事情應該以兩人偶對為宜，不宜成群；若是一人，則當有另一人為配偶。引申又有專心一意，不宜一心多用的意思。言一人則可行，若要三人或多人同行則相互猜疑，因此要有所減損。",
      "六四":"六四，損其疾，使遄有喜，无咎。\n《象》曰：損其疾，亦可喜也。\n\n去除其疾病，快速則有喜，沒有罪咎。四原本是多懼的爻位，其德性又柔弱，但六四當位，有初九相應，因此得吉。初九言「巳事遄往」，六四言「使遄有喜」，因兩爻與應，初九遄往可損六四之疾。",
      "六五":"六五，或益之十朋之龜，弗克違，元吉。\n《象》曰：六五元吉，自上祐也。\n\n十朋之龜意指價值不斐的烏龜。朋為貝或玉的交易單位，一朋二串，每串五枚，因此十朋為一百枚的貝。有人拿著價值十朋貝的烏龜來幫助，無法違背，大吉。龜在古時為神聖的決疑寶物，從選龜到如何處理、儲藏，都有嚴格的規矩。因此龜的幫助類似於我們在說「神明」保祐。六五爻變之後卦成中孚，中孚為大離之象，離為龜，因此為十朋之大寶龜。益卦六二也同樣說「或益之十朋之龜」，因益卦六二爻變同樣成為中孚。互體坤，坤為眾為朋為十，故曰「十朋」。",
      "上九":"上九，弗損，益之，无咎，貞吉。利有攸往，得臣无家。\n《象》曰：弗損益之，大得志也。\n\n不要減損，應當增益。沒有罪咎，貞定則吉。利有所往，得到無私的大臣。上九為損卦結束將變為益卦的時候，已不需再減損，故曰「弗損」。又損卦為「損下益上」，上九同時有六五相承以及六三相應，皆為下益上，因此曰「益之」，曰「得臣」。"
    }
  },
  "110001": {
    "name": "益",
    "pinyin": "yì",
    "summary": "風雷益，風助雷勢，積極增益。(大吉)",
    "detailed": "益卦象徵增加與助益，如風烈則雷迅，雷激則風怒，風雷相益，代表積極進取可獲成功。君子應樂於助人，見善則遷，有過則改，以獲取更大福報。此卦雖吉，但屬於長遠性的利益。凡事必需努力上進，特別要設法增加自己的優點與技能。",
    "explanations": {
      "運勢": "運勢大吉，宜主動積極，可獲福報。",
      "感情": "感情增溫，可以積極投入。關係良好，適合增進彼此關係。",
      "財運": "財運旺盛，適合投資與發展。",
      "工作": "工作有貴人相助，事業蒸蒸日上。積極投入工作，多找成長機會，自我充實，將有益於未來升遷。",
      "買賣": "交易順利，積極擴展可帶來更大收益。",
      "考試": "考試運極佳，努力可獲好成績。",
      "健康": "健康良好，適合強化體質。",
      "訴訟": "訴訟有利，結果可能對己方有助益。",
      "尋人": "尋人順利，對方可能受到他人幫助。",
      "尋物": "尋物可得，可能有人主動送回。",
      "旅行": "旅行適宜，可能有意外收穫。",
      "人際": "人際關係佳，適合與貴人建立聯繫。",
      "卦辭": "益，利有攸往，利涉大川。\n《彖》曰：益，損上益下，民說无疆；自上下下，其道大光。利有攸往，中正有慶；利涉大川，木道乃行。益動而巽，日進无疆；天施地生，其益无方。凡益之道，與時偕行。\n《象》曰：風雷，益，君子以見善則遷，有過則改。\n\n攸，遠，或所。利有攸往即利有遠往，或利有所往，就是利於出行、利於遠行的意思。也可解釋為利益有遠往，即有長遠的利益。益卦上巽木，為舟楫，可以渡水救險。下震卦為行，亦屬木，上下二體為舟行之象，因此說「利涉大川」。《易經》中凡言「利涉大川」都在比喻可以冒險犯難，險中求通的意思。大川比喻危險，涉為徒行渡水，水過膝則稱涉。利涉大川，利於冒險一試，做事可以冒些風險\n\n【卦旨】益為增益，益卦的益主要是指損上而益下，為何損上益下稱為益？因位益下則本固，本固則枝榮，揭示損上益下時應當心懷誠信、堅持中道，以及自損者必自益、自益者必自缺，因而絕不可過於損人利己、貪益無厭的義理。"
    },
    "yaoInterpretation": {
      "初九":"初九，利用為大作，元吉，无咎。\n《象》曰：元吉无咎，下不厚事也。\n適於有大的作為，大吉則可免於罪咎。初九陽剛當位，又與六四相應，處於震卦的初爻，因此正是可以有所作為的時候。只是初九地位卑微，不免被人看低，若事情沒做好，則罪咎也會更大。只有大的作為，做出大好成績，才能免於罪咎，因此爻辭說「元吉，無咎」，大作為、大吉之後才能無咎。《象傳》說：「下不厚事也。」",
      "六二":"六二，或益之十朋之龜，弗克違，永貞吉。王用享于帝，吉。\n《象》曰：或益之，自外來也。\n有人拿著價值十朋貝的烏龜來幫助，無法違背，永保貞定為吉。大王藉以敬祀天帝，吉。龜在古時為神聖的決疑寶物，從選龜到如何處理、儲藏，都有嚴格的規矩。因此龜的幫助類似於我們在說「神明」保祐。傳統以覆象來解釋損六五與益六二，認為損卦翻轉就是益卦，益卦翻轉則成損。益之六二即損之六五，因此兩爻皆曰「或益之十朋之龜」。",
      "六三":"六三，益之用凶事，无咎。有孚，中行，告公用圭。\n《象》曰：益用凶事，固有之也。\n努力救濟凶阨之事，沒有罪咎。但應秉持誠信，行事中間，應當慎重其事地用玉圭作為信物，稟告於公侯。三為多凶多憂的爻位，互體坤，爻動成坎，動輒得咎之象。六三以柔居剛，不當位，原本不當有所作為，但遇凶事，不但要努力救濟，還必需秉持誠信，慎重其事，不斷回報狀況，才可免於罪咎。用圭，圭為古時與長官以及神明互為通信的媒介，有「取信於上」的意思。告公本身就有取信於上的意思，還必需用圭，則表示更為慎重其事，避免被猜疑。",
      "六四":"六四，中行，告公從，利用為依遷國。\n《象》曰：告公從，以益志也。\n行程之中稟告於公侯，公侯無不順從，甚至連遷國這麼大的事也有利。君主聽從建議，上下共同協謀，基於對大局利益之考量，而遷國以安撫百姓。適於遷移，凡可遷移者都大吉。下屬則能得到上級的信任而得以做大事。六三、六四都講「中行」與「告公」。但六三所受到的信任顯然不如六四，因此六三要用圭（信物），六四不需用圭，什麼原因？六三位不正，與九五之君不相鄰亦不相應，其行事是因急難而不得不為。六四不但當位，而且與九五之君比應，因此不需信物，只需稟告一聲，就被充份授權，而得以做大事。",
      "九五":"九五，有孚惠心，勿問，元吉，有孚惠我德。\n《象》曰：有孚惠心，勿問之矣；惠我德，大得志也。\n有誠信，而且能恩惠及於人心，此事不須問，大善而吉。我以誠信恩惠於人，人亦以誠信回報所受之恩德。能利益於人至於惠及人心，人亦回報於我而惠及我德，大善而吉。益卦為「損上益下」，九五為損己以利人者，是益卦的卦主，也是能夠利益於天下的一國之君。九五若能誠心利益於天下，恩惠深入到人心，至於大善則吉。",
      "上九":"上九，莫益之，或擊之。立心勿恒，凶。\n《象》曰：莫益之，偏辭也；或擊之，自外來也。\n不能有益於民，因而受到各方的攻擊。完全沒有持久的恒心，凶。上九處益之上，益卦應該是損上益下的時候，但上九陽剛居極，凌駕於九五之尊，非但不能利益於他人，還反過來要人利益於己，是無功而居功、邀功者。若偶有行善，也只因一己之利，所以無恒心可言。凶。上九並不是以恒久的心態做事，行善只是基於短期的私利，所以為凶。"
    }
  },
  "011111": {
    "name": "夬",
    "pinyin": "guài",
    "summary": "澤天夬，澤及天下，決斷行事。(中吉)",
    "detailed": "夬卦象徵果斷與決策，如澤水盛滿天際，需及時決斷。君子應勇於取捨，果斷行動，避免優柔寡斷。內心固然要果決，但手段則要委婉。夬卦有兩個層面的意義，五陽判決一陰，其次是就二體來說，澤上於天，澤以潤下，在上位者要能夠施惠於下則可得人心。",
    "explanations": {
      "運勢": "面臨棘手的人事問題，手段要委婉，千萬不要強硬，則可保長治久安。運勢良好，需勇於決策，不宜拖延。",
      "感情": "感情關係需果斷處理，不宜猶豫。對象任性而難纏，宜於畫清界限。",
      "財運": "財運佳，適合做出投資決策。",
      "工作": "工作上需果斷行動，把握時機。有人事鬥爭問題。可以的話以施恩來攏絡人心，殺手鐧也會傷到自己。",
      "買賣": "交易宜快速決策，延遲可能失去機會。",
      "考試": "考試運勢良好，臨場判斷力強。",
      "健康": "健康尚可，需及早診治健康隱憂。",
      "訴訟": "訴訟宜果斷處理，拖延恐不利。",
      "尋人": "尋人需迅速行動，機會稍縱即逝。",
      "尋物": "尋物宜果斷回想最後存放處。",
      "旅行": "旅行適宜，但需做好決策與規劃。",
      "人際": "人際關係需明確界定，避免不必要糾葛。",
      "卦辭": "夬，揚于王庭，孚號有厲。告自邑，不利即戎，利有攸往。\n《彖》曰：夬，決也，剛決柔也。健而說，決而和。揚于王庭，柔乘五剛也；孚號有厲，其危乃光也；告自邑，不利即戎，所尚乃窮也；利有攸往，剛長乃終也。\n《象》曰：澤上於天，夬。君子以施祿及下，居德則忌。\n\n處決，大肆張揚地在君王的大庭上舉行，即使是以誠信號令大眾，仍不免於有危險。要以告誡的方式來治理自己的城邑，不適合動用武力，如此則利有所往。\n\n【卦旨】夬為決斷之意，也即對決、一決勝負的決，夬卦只有上六為陰爻，其餘皆陽爻，剛決柔也，最終五陽獲勝，陰爻失敗，揭示正義消除邪惡、君子制裁小人之時，應當光明公正、勇決果斷而又堅持中道、以德取勝的道理，同時也告誡人們，雖然正義力量強大，仍須警懼慎重，不可掉以輕心。"
    },
    "yaoInterpretation": {
      "初九":"初九，壯于前趾，往不勝為咎。\n《象》曰：不勝而往，咎也。\n\n意氣剛強，貿然前往，然而無奈地位卑微，無決定能力而且無所依靠，所以雖然仗義而往，仍然為小人所傷。夬卦於卦氣上是繼大壯而來，大壯陽爻繼續增長就是夬，所以夬卦也是比大壯更為大壯的一卦，差別在其最上方的一個陰爻代表的是最難拔除的小人中的小人，也是最後的一個小人。因此夬卦初九也如大壯初九，都說壯於趾。初九是最卑下的一爻，因此曰「往不勝」。",
      "九二":"九二，惕號，莫夜有戎，勿恤。\n《象》曰：有戎勿恤，得中道也。\n\n憂慮地大聲警告戒備，小心夜晚會有盜賊來犯，有所防備就不需擔憂。或讀作「惕號莫夜，有戎勿恤」，意思為：暮夜仍以惕懼呼號而保持警戒，但就算有兵戎之患仍心定而無所憂恤。",
      "九三":"九三，壯于頄，有凶。君子夬夬獨行，遇雨若濡，有慍，无咎。\n《象》曰：君子夬夬，終无咎也。\n\n強壯於臉上，凶。君子心中決斷再決斷，獨自行走，遇到了下雨而全身被淋濕，內心不悅，但沒有罪咎。此爻或讀作「君子夬夬，獨行遇雨，若儒有慍，无咎」。夬卦許多爻辭與大壯卦很像，「壯于頄，有凶」即大壯九三的「小人用壯」，「君子夬夬」為大壯九三的「君子用罔」。就如卦義中所說，得夬卦，面臨事情時內心可以果決剛強，但外表要和悅才是吉道。小人慣於將強盛的氣勢表現於臉上，想以此威赫人，反而得凶。君子則憂心，反覆再三地決定，雖然有猶疑，但最終仍能夠免於罪咎。",
      "九四":"九四，臀无膚，其行次且；牽羊悔亡，聞言不信。\n《象》曰：其行次且，位不當也，聞言不信，聰不明也。\n\n屁股受傷而沒有皮膚，讓人坐立難安，連走路都有困難。如果能夠把羊牽好，不讓羊到處頂撞闖禍，就不會有事，當初這麼告誡就是不相信，今天才會弄成這個樣子。夬九四與大壯九四相互呼應，談的都是公羊到處亂撞而闖禍的事。大壯九四「藩決不羸，壯于大輿之輹」，言公羊撞壞了圍籬之後開始闖禍，而夬卦九四則是描繪有人被羊頂撞傷了屁股，以致於行動不便，坐立難安。",
      "九五":"九五，莧陸夬夬，中行无咎。\n《象》曰：中行无咎，中未光也。\n\n莧陸的根拔了又拔，中庸而行則不會有罪咎。決斷之時，不應溺於私心，失去公正合理，因此曰「中行无咎」，中行不偏袒可得无咎。九三亦云夬夬，言君子決斷又決斷。",
      "上六":"上六，无號，終有凶。\n《象》曰：无號之凶，終不可長也。\n\n無所呼號或號令，最後有凶。有位而無權，孤立而無援，最終將被處決，大凶。上六一陰凌駕於五陽，想要號令五陽卻無從號令起。若想呼喊同伴，又沒有同伴可以相援。此形容孤立無援之貌。此爻有兩種不同的解釋，一是以上六為陰柔小人，「无號終有凶」是以小人陰柔居極在上的處境而言。另是以君子之決上六小人而言，並以號為警惕，言君子若無所警惕，則將有凶。"
    }
  },
  "111110": {
    "name": "姤",
    "pinyin": "gòu",
    "summary": "天風姤，天下有風，意外相遇。(小凶)",
    "detailed": "姤卦象徵突如其來的遭遇，如風起於天，表示變數增多，君子應謹慎應對，避免突發事件帶來衝擊。既然是「邂遘」，如若有什麼好事，也只是一時的運氣，不應當因此做長久之計。又姤卦是屬於女性的卦，男性諸事不宜，或者必需聽命於女子。女子則可掌控局面。",
    "explanations": {
      "運勢": "一時的偶遇，不能長久。女性卜此卦除感情之外，諸事吉，能掌控全局，男性卜此運勢較低，易有突發變數，需審慎應對。",
      "感情": "感情關係可能有意外變化，需冷靜處理。一場邂遘，不能當真。女子不貞或過於強勢，嫁娶不宜。",
      "財運": "財運波動，宜謹慎管理資金。",
      "工作": "工作易遇變動，需隨機應變。偶爾的運氣。女事業大吉，男則聽命於女。",
      "買賣": "交易有變數，需靈活應對。",
      "考試": "考試運一般，臨場表現可能受外界影響。",
      "健康": "健康需注意突發狀況，預防疾病。",
      "訴訟": "訴訟可能有意外發展，需隨時應變。",
      "尋人": "尋人困難，對方可能行蹤飄忽不定。",
      "尋物": "尋物較難，可能被意外遺失。",
      "旅行": "旅行易有突發狀況，需提前規劃。",
      "人際": "人際關係變數大，需慎選交友。",
      "卦辭": "姤，女壯，勿用取女。\n《彖》曰：姤，遇也，柔遇剛也。勿用取女，不可與長也。天地相遇，品物咸章也；剛遇中正，天下大行也，姤之時義大矣哉。\n《象》曰：天下有風，姤，后以施命誥四方。\n\n邂遘偶遇，女人強悍，不能娶女。《彖傳》說：「勿用取女，不可與長也。」因為這只是一場短暫的邂遘偶遇，無法天長地久，所以這個女人不能娶。\n\n【卦旨】姤為遇的意思，為相遇合之意，是一種不期然而遇，姤卦卦象來看是初爻陰爻意外遇到其餘五陽爻，陰氣初現，揭示男女、仕途等的遇合的情況，碰到任何新機會，新事物，都應當堅持中正、順乎自然，而不可輕肆巧佞、強行以求。"
    },
    "yaoInterpretation": {
      "初六":"初六，繫于金柅，貞吉。有攸往，見凶，羸豕孚蹢躅。\n《象》曰：繫于金柅，柔道牽也。\n\n豬被綁在金屬做的阻柅器上，貞定守正為吉。若是有所往，那麼為凶，就如被綁起來的豬只能原地浮躁地亂跳。繫，象徵女子之纏綿。柅，象徵男子。金柅，喻剛健的男子，指包有魚之九二。貞吉，女子繫於剛堅之男子，從正則吉。若女子三心兩意，想前往與遠處的九四相見，則凶。羸豕孚蹢躅，喻指「有攸往見凶」者的處境。",
      "九二":"九二，包有魚，无咎，不利賓。\n《象》曰：包有魚，義不及賓也。\n\n廚房有魚，沒有罪咎，不利於拿來宴請賓客。魚，指初六，但實際放在占筮的情境，為不變之陰，即八。二與初比應，在外包之，故曰包有魚。九四雖與初六相應，但遠之，故曰包無魚。為何包有魚而「不利賓」？歷代說法相當多。易經中「包」都有中看不中用的隱喻，例如泰九二「包荒，用馮河，不遐遺，朋亡」，否九五「其亡其亡，繫于苞桑」，姤九五「以杞包瓜，含章，有隕自天」。此處言「包有魚」，亦有隱喻此魚不可用於賓之義。九四包無魚，《象傳》以「遠民」解釋，那麼魚象徵的是民，民心不與人共有，故不及賓。又姤者媾也，魚象徵女子，當然就不利賓了。",
      "九三":"九三，臀无膚，其行次且，厲无大咎。\n《象》曰：其行次且，行未牽也。\n\n屁股受傷以致於沒有皮膚，讓人坐立難安，連走路都有困難。艱苦則不會有大的罪咎。夬卦九四也說「臀无膚，其行次且」，與大壯九四相互呼應，談的都是公羊到處亂撞而闖禍的事。大壯九四「藩決不羸，壯于大輿之輹」，言公羊撞壞了圍籬之後開始闖禍，而夬卦九四則是描繪有人被羊頂撞傷了屁股，以致於行動不便，坐立難安。姤九三，典故或與大壯的羝羊有關。",
      "九四":"九四，包无魚，起凶。\n《象》曰：无魚之凶，遠民也。\n\n廚房中沒有魚，出征，凶。起凶：應作「征凶」。魚長於水中屬陰，指初六。初六承九二，九二說包有魚，因九二近水樓台先得魚，和初六比鄰相應而相遇在先，因此九四雖然與初六內外相應，但卻無魚可得，因初六已先為九二所據。九四若以此而出征，將是大凶。《象》曰：「无魚之凶，遠民也。」因為不得民，和民心相去太遠。",
      "九五":"九五，以杞包瓜，含章，有隕自天。\n《象》曰：九五含章，中正也。有隕自天，志不舍命也。\n\n我怎能像是個瓠瓜，只能掛著好看而不能食用。藏著一身才華，卻突然上天降下這憂愁。此言懷才不遇，又有壞消息，而心生憂愁。傳統多依王弼注解釋為：有肥沃的土地，但種的是只能觀賞不能食用的匏瓜。君子擁有中庸的美德卻是藏而不露，不為人所了解，但仍不改其志。比言君子不得志，未遇明君，但仍意志堅定，不放棄理想，只有上天能夠毀滅他的意志。",
      "上九":"上九，姤其角，吝，无咎。\n《象》曰：姤其角，上窮吝也。\n\n姤卦的頂點，窮途而無法有所遇，只遇到傷人的尖角。悔吝，沒有罪咎。角會抵觸傷人。姤其角，謀事不成反而因此受傷。與上九相對應的九三言「臀無膚，其行次且」，依大壯卦所提供的故事脈絡來看，「臀無膚」而是被羝羊所傷。九三與上九似乎都有姤角之象。姤上九有「動而不能靜」的陽剛之失，因姤在乾體剛健及姤卦之極，故有過剛之象。"
    }
  },
  "011000": {
    "name": "萃",
    "pinyin": "cuì",
    "summary": "澤地萃，澤上於地，眾人匯聚。(大吉)",
    "detailed": "萃卦象徵聚集與團結，如水澤滋潤大地、萬物薈萃，表示人際匯聚，適合組織團隊、合作發展。萃卦最適於「聚集人氣」一類的事務，凡事可隆重而盛大舉行，集合眾人之力也是解決事情的好方法。",
    "explanations": {
      "運勢": "可以亨通，但適於隆重盛大以表現誠意，不宜吝嗇節儉。運勢大吉，適合團隊合作，共同發展。",
      "感情": "受眾人歡迎，經常被人所包圍。感情關係良好，適合穩固發展。",
      "財運": "財運旺盛，合夥投資可獲得成功。",
      "工作": "適於行銷、廣告活動。工作需團隊合作，互助互惠。",
      "買賣": "交易市場有利，適合擴展事業。",
      "考試": "考試運良好，團體學習可助提升成績。",
      "健康": "健康狀況良好，適合參與社交活動。",
      "訴訟": "訴訟有貴人幫助，可順利解決。",
      "尋人": "尋人順利，對方可能在人群聚集之處。",
      "尋物": "尋物容易，可在公共場所尋找。",
      "旅行": "旅行適宜，適合團體出遊。",
      "人際": "人際關係良好，適合建立合作關係。",
      "卦辭": "萃，亨，王假有廟。利見大人，亨，利貞。用大牲吉，利有攸往。\n《彖》曰：萃，聚也。順以說，剛中而應，故聚也。王假有廟，致孝享也；利見大人，亨，聚以正也；用大牲，吉，利有攸往，順天命也。觀其所聚，而天地萬物之情可見矣。\n《象》曰：澤上於地，萃，君子以除戎器，戒不虞。\n\n聚會，大王來到宗廟。利於見大人，嘉會而合禮，利於貞定。使用大的牲禮為吉，利於遠行。大的牲禮，以表示隆重，慎重其事。利于遠行，或利有所往。攸，遠，或所。利於有所往，利於有遠往，就是利於出行，或者利於遠行的意思。也可解釋為利益有遠往，意指有長遠的利益。「除戎器，戒不虞」為修治兵器，以戒備可能的意外。另一解釋「除」為除去，言當除去兵戎，以修文德。兩種解釋以前者為佳。\n\n【卦旨】萃為聚，會聚之意但並不是簡單的將人聚合在一起，是一種聚的智慧，而是要聚合人心使眾人思想形成統一的共識，避免聚爭分立，也提防聚眾可能帶來的突發事故，揭示社會生活中羣體的結合應當心懷誠信，長守正道，並常存戒心以防這種結合流於邪僻的道理。"
    },
    "yaoInterpretation": {
      "初六":"初六，有孚不終，乃亂乃萃。若號，一握為笑，勿恤，往无咎。\n《象》曰：乃亂乃萃，其志亂也。\n\n誠信不能長久，因為動亂而集會眾人。如果能夠出面號召，與人握手言和，一笑置之，不需憂心，如此前往能免於罪咎。前半段講因為不能信守承諾而引來動亂，以此而集會，可能動輒得咎。後半講，如果能把事情說開，放下身段與人溝通，握手一笑泯恩仇，那麼就可得无咎。",
      "六二":"六二，引吉，无咎。孚乃利用禴。\n《象》曰：引吉无咎，中未變也。\n\n牽引同伴而往，吉，無咎。虔誠者才能夠以簡單的祭祀來祈福。此以禴祭說明誠心之重要，有誠心者，則祭祀不在隆重，簡單如禴祭亦可感動神明，得到保祐。心志若夠堅定，誠心足夠，則自能吉而無咎。反之，若無誠心，那麼怎樣隆重的祭祀都沒有用。所以《象傳》說：「引吉无咎，中未變也。」中即內心，指人之志向。又隱喻六二為中爻，具中庸之美德，此美德不變。六二因柔順中正，又與萃卦主爻九五相應，因此稱吉。卦辭言「王假有廟」、「用大牲吉」，王至太廟，聚眾致祭當隆盛，有大的排場與祭祀規格，因此用大牲吉。六二柔順中正，上應九五，若有孚則亦可以簡約之禴祭行之。",
      "六三":"六三，萃如嗟如，无攸利，往无咎，小吝。\n《象》曰：往无咎，上巽也。\n\n相聚而感歎，無所利。前往，沒有罪咎，小有悔吝。萃如嗟如，相聚而感嘆。因為所聚非人。萃卦應該是利見大人，但六三見不著大人，只能見到小人。",
      "九四":"九四，大吉无咎。\n《象》曰：大吉无咎，位不當也。\n\n大吉才能夠免於罪咎。上近九五之君，近君多憂之位，而下據群眾，不免為君所疑，因此要大吉，求得完滿之後才得以免咎。九四下接下卦之坤，坤為群眾，因此為代九五而據有群眾者。無咎是偏凶的占斷，意思要問筮者努力補過以免除罪咎，免於上天的懲罰。既然說「大吉」，為何還「無咎」？如此吉凶相混，不就自相矛盾了？《易經》的吉凶都是有條件的，此爻的吉凶占斷為「無咎」，「大吉」則是求得無咎的條件，言問筮者當努力讓事情得到最完滿的結果，大吉之後才可免於罪咎。若不能做到大吉，則有罪咎。",
      "九五":"九五，萃有位，无咎。匪孚，元永貞，悔亡。\n《象》曰：萃有位，志未光也。\n\n聚會中有地位，沒有罪咎。如果不受信任，當長保貞定守正，以免於後悔。雖然位尊，但下有九四分化權力。因此難免會有信任的問題，並讓志向無法光大。當此之際只有長期的堅定守正。《象》曰：「萃有位，志未光也。」因擁有九五之尊的位置，所以本來就不會有罪咎。但是所信非人，自己誠信亦因此連帶遭質疑，只有以長遠而堅定的意志才能重建誠信。",
      "上六":"上六，齎咨涕洟，无咎。\n《象》曰：齎咨涕洟，未安上也。\n\n傷心悲嘆，痛哭流涕，沒有罪咎。處萃卦的最上面，近處與九五相逆，沒人能伸援手；與六三無應，遠處無人呼應。往下哀求與人相聚而不可得，只能獨自哀聲嘆息，涕泗縱橫，但若是能反省而改過，應能免於罪咎。"
    }
  },
  "000110": {
    "name": "升",
    "pinyin": "shēng",
    "summary": "地風升，地中生木，步步高升。(大吉)",
    "detailed": "升卦象徵上升與進步，如木在地下，木以土為生，土中之根將逐步成長為大樹，表示事業逐漸成長、發展順利，君子應穩健向前，逐步攀升。成長原本就是緩慢而需要時間的，但只要耐心等候，有朝一日一定可成。若能找到貴人相助，也可加快事情的進展。",
    "explanations": {
      "運勢": "之初進展緩慢，讓人憂心，但只要勇往直前，日久事情自然可成。運勢大吉，發展良好，可逐步提升。",
      "感情": "耐心等待，慢慢培養感情可成。若能找人媒合更佳。感情關係穩定，適合進一步發展。",
      "財運": "財運上升，適合投資與擴展事業。",
      "工作": "腳踏實地可以穩定成長，若找到貴人提攜，則可加快晉升。晉升機會，需努力表現。",
      "買賣": "交易有利，市場趨勢向好。",
      "考試": "考試運勢佳，努力可獲佳績。",
      "健康": "健康狀況良好，適合強健體魄。",
      "訴訟": "訴訟有利，堅持正義可獲勝。",
      "尋人": "尋人順利，對方可能正在向上發展。",
      "尋物": "尋物可得，可能藏於較高處。",
      "旅行": "旅行適宜，可探索新機遇。",
      "人際": "人際關係良好，可獲貴人提攜。",
      "卦辭": "升，元亨，用見大人，勿恤，南征吉。\n《彖》曰：柔以時升，巽而順，剛中而應，是以大亨；用見大人，勿恤，有慶也；南征吉，志行也。\n《象》曰：地中生木，升。君子以順德，積小以高大。\n\n進升，大善而嘉會合禮，以此見大人，不必憂慮。往南出征，吉。南征也可引申為勇敢前進，因古時以南方為前。坤和巽分屬西南和東南方，兩者都屬南方之卦，因此曰南征吉。\n\n【卦旨】升為上升，揭示向上升進之時，好比樹木由幼苗長成參天大樹，升位升德賴於貴人滋養，故升於位，由王公，升於德，由聖賢，應當循其本性、堅持誠信貞正，依靠陽剛尊者的正大力量以求發展的道理。"
    },
    "yaoInterpretation": {
      "初六":"初六，允升大吉。\n《象》曰：允升大吉，上合志也。\n\n必定上升，大吉。《象》曰「上合志也」，與上面志氣相同，因此必然可上升。升卦吉道在有人提攜，初六為有人提攜者，因此可順利上升。升卦「升」的意義來自於下面的巽卦，巽為木，為「漸進」，此木在地中往上生長，逐漸鑽出地面。初六是巽卦的主爻，原本就應當向上生長，因此說「允升」。但初六柔順而謙遜之極，又不當位，因此自己難以上升。因承九二（柔承剛，順），與九二相合，因而能受到九二的提攜而一起上升。",
      "九二":"九二，孚乃利用禴，无咎。\n《象》曰：九二之孚，有喜也。\n\n有誠意然後才宜於用儀式較簡單的禴禮來祭天，沒有罪咎。有誠意自能感動上天，雖然獻禮很薄，儀式簡單，但仍然可以與神明相感應，而得到保祐。《象傳》說「有喜也」，得此爻當有喜事。九二雖不當位，但居中，下有初六相承，外與六五相應，原本應當為吉，何以只能無咎？升卦之吉，貴在有比自己強的人相助，九二本身陽剛，是能夠幫助別人者，卻反而無人能夠提攜九二，因此僅得無咎。初六與九二相鄰，相應的六五居尊亦屬陰柔，兩爻都是得九二相助者。所以初六與六五皆吉，但九二反為無咎，因九二正是助人者，非為人所助者。",
      "九三":"九三，升虛邑。\n《象》曰：升虛邑，无所疑也。\n\n登上山丘上的城邑。坤為土地、邦國，有城邑之象，坤在上，則為高地，丘墟之象。巽為進升主體，九三為巽卦最外的一爻，能夠直升上面的坤地，上又與上六相應，毫無阻礙，此卦有得土之象。由卦辭「南征吉」，九三登虛邑（大丘之邑）以及六四「王用亨于岐山」來看，升卦可能與古公亶父由豳遷徙至岐下建立岐邑有關。",
      "六四":"六四，王用亨于岐山，吉，无咎。\n《象》曰：王用亨于岐山，順事也。\n\n大王在岐山舉行享祀，吉，沒有罪咎。隨卦上六作「王用亨于西山」，岐山即西山，因岐山在西，故稱西山。文王稱西伯。隨上六與升六四的典故，應該是古公亶父從北方的豳遷徙到西南岐下的故事。",
      "六五":"六五，貞吉，升階。\n《象》曰：貞吉升階，大得志也。\n\n貞定為吉，登階而坐上主位。此言祭天之禮，登階而踏上主座，也就是踐阼之禮。",
      "上六":"上六，冥升，利于不息之貞。\n《象》曰：冥升在上，消不富也。\n\n黑暗中登進，有利於不休息而堅定守正的人。上六是升卦的最頂點，一方面已是升無可升之處，另一方面又與九三相應，得九三之助，所以仍有繼續往上升之助力，因此有「升升不息」之象。這種堅持如果用在好事是非常好的，反之，若用在壞事就很糟糕。最忌被權位沖昏了頭，耽溺於榮華富貴而停不下來，因此以「不息之貞」勉之，貞者定也，正也。"
    }
  },
  "011010": {
    "name": "困",
    "pinyin": "kùn",
    "summary": "澤水困，澤下之水，受阻難行。(小凶)",
    "detailed": "困卦象徵受困與阻礙，如水澤無法保留住水而讓水往下漏，為澤無水之象，為窮困之意。君子應耐心應對，尋求突破之道。所謂「窮則變，變則通」，處困卦應當堅守節操，謹言慎行，然後才能夠窮中求通。這時不只言多必失，也很可能引來羞辱。所以凡事應當多做少說。",
    "explanations": {
      "運勢": "山窮水盡，窮困潦倒。運勢低迷，行事受阻，需耐心等待時機。",
      "感情": "感情關係易受阻或困擾，需多加溝通交流。",
      "財運": "財運不佳，易遇經濟困難，有破產甚至負債的危險。宜保守理財，忌投資。",
      "工作": "工作進展受限，需尋求突破點。",
      "買賣": "交易市場低迷，需耐心等待時機。",
      "考試": "考試運勢一般，需更加努力。",
      "健康": "健康狀況不穩，需特別注意。",
      "訴訟": "訴訟不易獲勝，宜謹慎應對。",
      "尋人": "尋人困難，對方可能受環境影響。",
      "尋物": "尋物較難，可能受遮擋。",
      "旅行": "旅行不宜，易遇阻礙、滯留。",
      "人際": "人際關係受限，易有誤會與摩擦。",
      "卦辭": "困亨，貞大人吉，无咎，有言不信。\n《彖》曰：困，剛揜也。險以說，困而不失其所亨，其唯君子乎。貞大人吉，以剛中也；有言不信，尚口乃窮也。\n《象》曰：澤无水，困。君子以致命遂志。\n\n窮困而能嘉會合禮，問於大人則吉而沒有罪咎。這時候所說的話無法讓人相信。傳統註解將貞解釋為正，言窮困中仍有亨通之道，那就是堅守節操，只有君子、大人能夠如此，自求亨通之後方吉而沒有罪咎。反之，小人則凶。窮困的時候，所說的話恐怕讓人無法相信，君子此時言語應當更加謹慎，若只會用嘴巴解決問題，將萬劫不復，那才是真的窮困，所以《彖傳》說「尚口乃窮」。\n\n【卦旨】困為困厄，通常指艱難窘迫的困境，這種困境不單只是物質的窮困，也指精神上的困頓迷茫，比如人生的不如意、郁郁不得志等，人生在世，難免陷入困境，但身處困境中心不能被困境鎖住，換言之就是不能垂頭喪氣，委靡不振，唯有如此才能有脫困的希望，揭示處於困苦窮厄之時，要堅持正理，審慎剛毅，積極進取，必能擺脫困境，獲得亨通的道理。"
    },
    "yaoInterpretation": {
      "初六":"初六，臀困于株木，入于幽谷，三歲不覿。\n《象》曰：入于幽谷，幽不明也。\n\n屁股困於枯木中，進入幽深的山谷裡，歷經三年都無法見到人。初六處於坎之最深處，坎為谷，故曰入于幽谷。",
      "九二":"九二，困于酒食，朱紱方來，利用享祀。征凶，无咎。\n《象》曰：困于酒食，中有慶也。\n\n困於酒肉飲食，祭祀所用的朱色儀服才剛送到，宜於祭祀。若是進取而出征，凶，无咎。困于酒食：有多種解讀。一、處困而能飲食豐盛。二、飲食宴樂，縱慾過度而為所困。三、因窮困而酒食匱乏。四、承上，引申為食祿不足以為用，為飲食所困。",
      "六三":"六三，困于石，據于蒺蔾。入于其宮，不見其妻，凶。\n《象》曰：據于蒺蔾，乘剛也。入于其宮，不見其妻，不祥也。\n\n受困於堅硬的石頭，所賴以據守的是有刺而傷人的蒺蔾。進入他的宮室，但見不到妻子，凶。磐石堅固，可賴以防禦，豫六二「介于石」，言以石為防衛，即據于石。今反為石所困，即孔子說的「非所困而困焉」。蒺蔾為有刺植物，用以困人傷人，反以為據，即孔子說的「非所據而據焉」。此為倒行逆施，太阿倒持，孔子評曰：「既辱且危。」",
      "九四":"九四，來徐徐，困于金車，吝，有終。\n《象》曰：來徐徐，志在下也。雖不當位，有與也。\n\n遲疑而徐緩地來，困於剛堅的金車。悔恨，但總算可以有好的結果。蒺蔾：一種帶刺的植物，或用於防衛，或用於圜土（監獄）圍困犯人。",
      "九五":"九五，劓刖，困于赤紱。乃徐有說，利用祭祀。\n《象》曰：劓刖，志未得也；乃徐有說，以中直也；利用祭祀，受福也。\n\n割鼻又斷腿，紅色祭服無法送達。若能徐緩行之，則能脫困，利於祭祀祈福。赤紱為祭服，困于赤紱則祭祀無法進行，將不受福祐，因此有凶象。前言劓刖，為使用嚴苛的刑罰，越是要下猛藥，卻越無法達到目的，欲速則不達，因此而讓祭服沒有準時送到。後言若是能改變做法，徐緩行之，則能夠讓祭祀順利進行，祈求福祉。九五與九二兩爻上下呼應，九二言朱紱方來，利用享祀；九五言困於赤紱，利用祭祀。朱紱為天子之祭服，赤紱為諸侯祭服。為何九五君位言赤紱，九二臣位言朱紱？九五的赤紱指的可能是其對應的九二，反過來，九二所言的朱紱則是對應的九五。",
      "上六":"上六，困于葛藟，于臲卼，曰動悔有悔，征吉。\n《象》曰：困于葛藟，未當也；動悔有悔，吉行也。\n\n困於藤蔓之纏繞而無法活動，又處於高處而危險之地。然而窮則變，變則通，如果能因此謀慮而後動，化被動為主動，勇敢出征則吉。上六為窮極而變之時，當以主動積極而突圍，出征為吉。葛蕾傳統認為是藤蔓而纏繞之草，比喻人之難以脫困。"
    }
  },
  "010110": {
    "name": "井",
    "pinyin": "jǐng",
    "summary": "水風井，木上有水，資源共享。(中吉)",
    "detailed": "井卦象徵資源與共享，木下於水，又裝水而出，也就是以木桶汲水之象，如井水供眾人使用，代表合作與穩定，君子應珍惜資源，共享利益。井道重在自清，水清則人群至，德善則人心服。因此凡事應多反躬自省，修養自己的內涵。最怕急功近利，往往災害由此而生。",
    "explanations": {
      "運勢": "運勢良好，資源豐富，適合共享發展。未雨綢繆，或可化險為夷；欲速不但不達，還會遭災遇難。",
      "感情": "感情關係穩定，應多修養內涵。適合共同規畫與經營未來。",
      "財運": "財運尚可，適合穩健投資。",
      "工作": "培養好自己的專業能力，日積月累自然可成。工作需團隊合作，共享資源可得成功。",
      "買賣": "交易穩定，市場需求穩固。",
      "考試": "考試運佳，學習可與他人互補成長。",
      "健康": "健康良好，需注意飲水與養生。",
      "訴訟": "訴訟宜尋求和解，避免長期糾紛。",
      "尋人": "尋人順利，對方可能在固定場所。",
      "尋物": "尋物可得，可能遺留於熟悉之地。",
      "旅行": "旅行適宜，可尋訪有歷史文化之地。",
      "人際": "人際關係良好，適合建立長期合作夥伴。",
      "卦辭": "井，改邑不改井，无喪无得，往來井井。汔至，亦未繘井，羸其瓶，凶。\n《彖》曰：巽乎水而上水，井，井養而不窮也。改邑不改井，乃以剛中也；汔至亦未繘井，未有功也；羸其瓶，是以凶也。\n《象》曰：木上有水，井，君子以勞民勸相。\n\n水井，遷移村邑但不遷移水井，井水原本取之不竭，不會變少也不會變多，大家無不來來往往，井然有序地取用井水。但現在水井乾涸無水了，還來不及取得井水，又打破取水的瓶子，凶。井水本來源源不絕，來往取水的人很多。但後來由於維護不良，水井壞了，不再出泉而乾涸，因而凶。前半喻指君子之德，後半喻指修德而不能克終者，《書經．旅獒》所說的：「為山九仞，功虧一簣。」孔穎達：「言亦者，不必之辭，言不必有如此不克終者。計覆一瓶之水，何足言凶？以喻人之修德不成，又云但取喻人之德行不恒，不能慎終如始，故就人言凶也。」\n\n【卦旨】井為水井，卦象來看上坎下巽，坎為水巽為入，下巽，指井底的地下水匯入井中，上水，指地下水匯入井中後向上湧出，以養人的水井為喻，揭示君子應當修養自身美德，無私而恆久地施惠養民的道理。"
    },
    "yaoInterpretation": {
      "初六":"初六，井泥不食，舊井无禽。\n《象》曰：井泥不食，下也；舊井无禽，時舍也。\n\n井裡充滿了爛泥巴，井水因污穢而不能飲用。破舊壞掉的水井，無法聚集鳥獸。這是廢棄已久而不能使用的水井，積滿污泥，無水可喝。比喻君子不修德，則人民就會棄他而去。初六在井底最下的位置，又不能出水養人，故以泥為喻。或曰：井泥不食為水井積泥不可飲用，舊井無禽為破舊的陷阱捕獸無法有所收獲。",
      "九二":"九二，井谷射鮒，甕敝漏。\n《象》曰：井谷射鮒，无與也。\n\n井底射獵小魚，好比裝水的甕破舊而漏水。井以養人為用，今井不為人所用，卻讓人射獵小魚以取樂。這樣的井，和破掉而漏水的甕一樣無用。",
      "九三":"九三，井渫不食，為我心惻。可用汲，王明，並受其福。\n《象》曰：井渫不食，行惻也；求王明，受福也。\n\n井水清澈乾淨，卻沒人飲用，讓人感到傷心。若能夠讓人汲水飲用，有英明的大王，眾人就可以同享福報。",
      "六四":"六四，井甃无咎。\n《象》曰：井甃无咎，修井也。\n\n修築井牆，沒有罪咎。雖然井水早已重新湧出，潔淨可飲，但硬體方面仍需加強，所以現在又要把水井修築好，不只可以吸引人，而且也可以保有水井的完好。目前正在修築時期，不會有罪咎。井卦到九三為井泥已經清除，泉水再次湧出，已經可以飲用。但是硬體還未完成，為長保井水能夠為眾人所用，必需再加強它的硬體修築。",
      "九五":"九五，井冽，寒泉食。\n《象》曰：寒泉之食，中正也。\n\n井水非常甘冽清澈，清涼的寒泉，受大家的喜愛而紛紛來飲用。",
      "上六":"上六，井收勿幕，有孚元吉。\n《象》曰：元吉在上，大成也。\n\n井已完成，不要將它覆蓋。有誠信，大吉。水井已經修好，沒必要將水井蓋起來不讓人知道，而應當誠心開放，供人飲水。此比喻君子修德有成，應當開放自己，兼善天下，讓自己能有益於人。"
    }
  },
  "011101": {
    "name": "革",
    "pinyin": "gé",
    "summary": "澤火革，澤火相息，變革更新。(中吉)",
    "detailed": "革卦「革」的原意為皮革，也就是除毛之後的獸皮，引伸為去舊。火燃則水乾，水決則火滅，又相滅息之勢。象徵變革與創新，五行來說上兌金，下離火，離火炎上而鎔金，兌金因火粹鍊改變而成器。去舊迎新。君子應勇於改革，去除陳舊，迎接新的機遇。若是問人際關係和感情，革是一個大凶之卦，表示與人不但不和，而且到水火不容的地步。",
    "explanations": {
      "運勢": "運勢尚佳，變革帶來新機會，需勇敢前行。變革則吉而無咎，守舊則凶。",
      "感情": "大凶，水火不容之象。感情需調整與改變，避免一成不變。",
      "財運": "財運尚可，適合更新策略或投資方向。",
      "工作": "工作有變動機會，適合迎接新挑戰。",
      "買賣": "交易需轉變方式，方能獲取更大利益。",
      "考試": "考試運勢一般，需改變學習方式。",
      "健康": "健康狀況平穩，宜調整生活習慣。",
      "訴訟": "訴訟可透過新策略取得突破。",
      "尋人": "尋人需變換方法，靈活應對。",
      "尋物": "尋物可能需改變搜尋方式。",
      "旅行": "旅行適宜，適合探索新地點。",
      "人際": "人際關係有變化，適應新環境可獲益。",
      "卦辭": "革，已日乃孚，元亨，利貞，悔亡。\n《彖》曰：革，水火相息，二女同居，其志不相得，曰革。已日乃孚，革而信之，文明以說，大亨以正，革而當，其悔乃亡。天地革而四時成，湯武革命，順乎天而應乎人，革之時大矣哉。\n《象》曰：澤中有火，革，君子以治歷明時。\n\n變革，天命來臨之日，才能取信於民。大亨通，利於貞定，不再後悔。「已日」指「天命已改之日」。周武王九年盟津之會時諸侯皆曰：「紂可伐矣。」武王說：「女未知天命，未可也。」這就是天命未到時。再兩年之後的牧野之誓，風雨大作，群臣皆懼，反而周武王執意伐紂，這才是「已日」，就是天命已到時，也就是可以發動革命的時候。\n\n【卦旨】革為變革、革新，革上一卦為井，井用的時間久了就會沉積淤泥，如果有淤泥而不去除必將堵塞水井，最終導致水井乾涸，同理一個人入世太深也會蒙上世俗的塵埃，所以需要時不時的洗心革面，揭示實行變革、革新去除舊的弊端應當把握時機、取信於人，既要堅決果斷、雷厲風行，又要審時度勢、不可妄行的道理。"
    },
    "yaoInterpretation": {
      "初九":"初九，鞏用黃牛之革。\n《象》曰：鞏用黃牛，不可以有為也。\n\n用黃牛皮革繩將它緊緊繫綁牢固，比喻心志堅定而不為所動。時機未到，尚無法有所改變。此時可以守成而無法革命。地位與權力還不夠，無法有所做為，所以仍應以鞏固原本的志向與基礎為吉，不能妄動。《象》曰：「鞏用黃牛，不可以有為也。」意指不能有所做為。",
      "六二":"六二，已日乃革之，征吉，无咎。\n《象》曰：已日革之，行有嘉也。\n\n天命已來時才革命，出征吉，沒有罪咎。天命已降，變革的時機已到，可以取信於人。此時革命順天應民，吉而後不會有罪咎。六二與九五相應，九五為天，順天命之象。《象》曰：「已日革之，行有嘉也。」此時革命，行動將有嘉賞。",
      "九三":"九三，征凶，貞厲。革言三就，有孚。\n《象》曰：革言三就，又何之矣。\n\n出征為凶，貞定則危險。革命之言必須再三審議，並取得信任。三為多凶之位，不論出征或貞定不動，都有其困難。但革命已是時勢所然，但若過於急躁，直接出征則凶。必需再三審議各方意見。出征之所以凶，過於急躁妄動。堅守之所以危險，處革之時，應當變革，不應當固守、守舊。",
      "九四":"九四，悔亡，有孚，改命吉。\n《象》曰：改命之吉，信志也。\n\n悔恨消失，已確信，改天命吉。有孚，有信、可信的意思。改命，改變天命，或改變命令。",
      "九五":"九五，大人虎變，未占有孚。\n《象》曰：大人虎變，其文炳也。\n\n大人的變革像老虎紋一樣的文理煥發，不需占卜就有信驗。革命之後，有為改制之時，如周公制禮作樂，此時正當大舉建立制度，讓一切步入正軌。此事不待占卜，即有應驗，大吉。虎變比喻大人的變革，有如老虎般威猛而讓人敬畏，而所建立起的文章制度更有如虎皮一樣的條理分明而文采煥發，所以象傳以「其文炳也」來形容。",
      "上六":"上六，君子豹變，小人革面。征凶，居貞吉。\n《象》曰：君子豹變，其文蔚也；小人革面，順以從君也。\n\n君子變革有如豹一樣的敏捷而文章茂盛，小人則開始洗心革面。出征為凶，安居貞定則吉。一切改革都已完成，步入尾聲。君子豹變為繼大人虎變之後，虎變則條理分明，豹變則遍地開花。而一般的老百姓則開始洗心革面，順服於新的統治者。此時不宜再征伐，出征則凶，守成居正則吉。此爻言君子和小人跟隨君王改變的敏捷迅速。"
    }
  },
  "101110": {
    "name": "鼎",
    "pinyin": "dǐng",
    "summary": "火風鼎，木上有火，調整鼎固。(大吉)",
    "detailed": "鼎卦木上有火，以薪柴燒火煮物，烹飪之象。象徵調整與穩定，如鼎穩固而可承載重任，代表轉換與提升，君子應利用新機遇達成大業。鼎卦雖然諸事大吉，但是吉道在於養賢、創新，與耳聰目明，最怕者就是守舊不變。",
    "explanations": {
      "運勢": "運勢大吉，但凡事宜創新不宜守舊。適合改革與提升。以創新為宜，不應墨守成規。",
      "感情": "薪柴燒火之象。女子賢慧而能持家。感情穩定，雙方關係可進一步發展。",
      "財運": "財運旺盛，適合轉換財務計畫。",
      "工作": "工作機遇良好，可望獲得提升。有得權之象。",
      "買賣": "交易有利，適合轉型與優化策略。",
      "考試": "考試運佳，努力可獲成功。",
      "健康": "健康良好，適合改善體質。",
      "訴訟": "訴訟有利，透過調整策略可勝出。",
      "尋人": "尋人順利，對方可能處於轉換階段。",
      "尋物": "尋物可找回，可能放置於固定容器內。",
      "旅行": "旅行適宜，可拜訪文化歷史之地。",
      "人際": "人際關係良好，適合結識貴人。",
      "卦辭": "鼎，元吉亨。\n《彖》曰：鼎，象也。以木巽火，亨飪也。聖人亨以享上帝，而大亨以養聖賢。巽而耳目聰明，柔進而上行，得中而應乎剛，是以元亨。\n《象》曰：木上有火，鼎，君子以正位凝命。\n\n卦辭當作「鼎，元亨」。《彖傳》引作「元亨」，解釋為「大亨」，可見「吉」乃贅字。得鼎卦，以創新為宜，不應墨守成規，而應當採取全新的做法。又鼎為權力之象徵，所以問事業大吉，有得權之義。吉道如其卦德，為巽以明，謙遜柔進而耳聰目明。革是破壞，鼎則是破壞之後的建設，兩者相輔相成，一體兩面。又鼎為權力之象徵，因此鼎卦之後以「主器」的長子震卦續之，代表開國之後承家，世代相襲。\n\n【卦旨】鼎為鼎器，鼎本是用來烹煮食物的器具，但在古代鼎是象徵權力的法器，如果革卦的革旨除去舊的弊端，那麼鼎卦的鼎則在於取新，也即建立新事物或觀念，其主旨一方面從「烹飪器具」的角度，以闡明調和飲食的飴養之義；更重要的是從「革故鼎新」的角度，揭示除舊布新時如何調和各種力量、如何待人處事。"
    },
    "yaoInterpretation": {
      "初六":"初六，鼎顛趾，利出否。得妾以其子，无咎。\n《象》曰：鼎顛趾，未悖也。利出否，以從貴也。\n鼎翻覆，鼎腳朝上，以利於倒出不要的東西。為了生子而納妾，沒有罪咎。鼎顛趾為頭腳顛倒，比喻人與人之間的尊卑失序，但並未違背義理，所以《象》曰「未悖也」。因為這是為了將鼎中的殘渣廢物倒出，將鼎清洗乾淨。就如為了生子而納妾，情有可原，因此不會有罪咎。此比喻君王立制建國必需先清君側。鼎顛趾、得妾以其子，又有權宜之計的意味。言君子成大器不應拘小節，有時應當有所權宜。",
      "九二":"九二，鼎有實，我仇有疾，不我能即，吉。\n《象》曰：鼎有實，慎所之也。我仇有疾，終无尤也。\n鼎中裝滿美食，我的冤家有病，無法來跟我用餐。吉。此言，所來往的人若非正，而有損正義，此即是有疾，那麼不要親近與來往較好，可得吉。告誡君子要謹慎交友，對於不好的朋友敬而遠之則吉。「疾」，託病喻人品行不佳。",
      "九三":"九三，鼎耳革，其行塞，雉膏不食。方雨虧悔，終吉。\n《象》曰：鼎耳革，失其義也。\n鼎耳改變了，無法移動鼎，裡面肥美的雉雞，看得到卻是吃不到。等到下雨，終於不用悔恨，最終為吉。錯誤的創新反而誤了事。鼎耳原本應當在鼎上，當食物煮好時就可以利用鼎鉉移動鼎，將美食送上。但現在鼎耳卻改變了，變成在鼎腹之旁，使得熱鼎無法順利搬動。鼎是靠鼎耳移動，鼎耳位置原本在鼎的上方，於爻位為六五。現在九三為鼎腹腹中的位置，鼎耳位置改變而讓煮熟食物的鼎無法移動。九三變而下體及互體皆成坎，坎為耳，故曰「鼎耳革」。虞翻：「動成兩坎，坎為耳，而革在乾，故鼎耳革。」",
      "九四":"九四，鼎折足，覆公餗，其形渥，凶。\n《象》曰：覆公餗，信如何也。\n鼎的腳折斷，把要獻給王公的肉羹給弄翻了，將遭受剭刑，凶。喻指人無法勝任所負責的重任，將受到嚴厲的刑罰。在各個不同的文獻裡，孔子大致皆以「在下者不勝其任」註解。三足象徵的是三公，鼎之所以立。折足象徵輔佐君權的三公覆敗，則國政將亂。",
      "六五":"六五，鼎黃耳金鉉，利貞。\n《象》曰：鼎黃耳，中以為實也。\n鼎有黃金般的耳與金屬的鉉，利於貞定。六五在鼎卦位居鼎耳的位置，又居離中，黃中之象，故曰「黃耳」。鼎耳的作用在於搬動鼎。鼎有黃耳，又有金鉉，則可順利搬動，象徵君王能納言，不偏聽，而能夠有賢臣的輔佐，因此君權得以行使。",
      "上九":"上九，鼎玉鉉，大吉，无不利。\n《象》曰：玉鉉在上，剛柔節也。\n有如鼎上的玉鉉一樣尊貴，大吉，無往不利。上九為鼎鉉，鉉為舉鼎的工具，現在以玉加以裝飾，更顯鉉的尊貴。玉，取其堅強而溫潤，剛柔有節之義。孔穎達：「玉者，堅剛而有潤者也。」"
    }
  },
  "001001": {
    "name": "震",
    "pinyin": "zhèn",
    "summary": "洊雷震，震為雷，奮發向前。(中吉)",
    "detailed": "震卦為正東之卦，節氣為春分，震序數為三。象徵動盪與行動，如雷震天地，促使萬物甦醒。君子應勇敢迎接挑戰，積極行動以創造未來。面對變動若能因為恐懼而有所警惕，謹慎處事，則有驚無險，因此而得福。反之，若對變動麻木不仁，則可能有後來的災害。",
    "explanations": {
      "運勢": "先恐懼，後喜慶。運勢佳，行動帶來突破，適合主動進取。怠慢、怠惰則凶",
      "感情": "感情發展迅速，可能有突發變化。有情變的危險，若能謹慎小心處理，則能夠化解。",
      "財運": "財運佳，適合積極投資，但需控制風險。",
      "工作": "事情有突然的變動。戒慎恐懼則吉。工作有新機會，行動力強可獲成功。",
      "買賣": "交易適宜，市場變動中可獲利。",
      "考試": "考試運佳，臨場發揮良好。",
      "健康": "健康狀況良好，但需防範突發疾病。",
      "訴訟": "訴訟有變動，宜迅速應對。",
      "尋人": "尋人有望，對方可能正在變動之中。",
      "尋物": "尋物可找回，需迅速行動。",
      "旅行": "旅行適宜，但需做好準備以應對突發狀況。",
      "人際": "人際關係活躍，適合主動建立新聯繫。",
      "卦辭": "震亨，震來虩虩，笑言啞啞。震驚百里，不喪匕鬯。\n《彖》曰：震，亨。震來虩虩，恐致福也；笑言啞啞，後有則也；震驚百里，驚遠而懼邇也，出可以守宗廟社稷，以為祭主也。\n《象》曰：洊雷震，君子以恐懼脩省。\n\n震動而亨通。雷霆之來，讓人驚恐害怕，但後來笑顏逐開。雷霆驚動百里之遠，祭祀的匕匙和香酒等祭器不會喪失。先震驚，後亨通。先恐懼，後喜樂。有所恐懼則吉，權力可保，不會受到威脅。《彖傳》「恐致福也」，恐懼反而可以招來福氣，反之若不恐懼則恐怕有凶災。卦辭的震應有不同的解釋，首震為震動之義。「震來」的震，為雷霆，亦可比喻事情的變動。第三個震也是雷霆，但又有喻指諸侯國君之言行動作。\n\n【卦旨】震為動也，震卦對於我們的修身治事，隱含著高度的警戒作用，震卦的震含震攝的味道，也就是震卦的震旨在惊駭人的懈怠與慢惰，震醒人的心靈，揭示施治當嚴明法令，使天下警惕而久安，立身當戒懼謹慎，使自我修身省過而無危的道理。"
    },
    "yaoInterpretation": {
      "初九":"初九，震來虩虩，後笑言啞啞，吉。\n《象》曰：震來虩虩，恐致福也；笑言啞啞，後有則也。\n\n雷霆之來讓人害怕驚呼，但後來能夠笑顏逐開，吉。也可解釋為拍打瑞麥祈福而虩虩作響，大家一片歡笑，吉。拍打瑞麥為古代的祈福儀式，也是「釐」字的形構，歸藏震卦作釐，可為證。「虩虩」則為拍打瑞麥時的聲音。上古拍打瑞麥祈福或以聲音與震動的大小來判斷吉凶，震動越激烈聲音越大而有力，越是吉，反之為凶。卦辭與初九的「隙隙」為聲音最大者，因此為吉，眾人歡笑。",
      "六二":"六二，震來厲，億喪貝，躋于九陵。勿逐，七日得。\n《象》曰：震來厲，乘剛也。\n\n雷霆來得相當凶猛，讓人想起喪失的貝殼，登上高陵。失去的不必追逐，七日就可復得。傳統以震來為震動之來。震動帶來了危險，喪失了許多的財物。登上高陵，所失去的不必去追逐，七日就可復得。震來或為拍打瑞麥，震來厲為拍得麥子非常凶猛，或因拍打瑞麥而有危險。六二以柔乘初九之剛，初九為震動之主，其勢不可擋，因此六二首當其衝而有危險。六二爻動下體成兌為損失，但互體成離為得，因此有失而復得之象。",
      "六三":"六三，震蘇蘇，震行无眚。\n《象》曰：震蘇蘇，位不當也。\n\n雷停了又來，不斷反覆，有如變動一波未平一波又起。振作前往，不會有災禍。三是多凶之位，雷霆與變動之來，原本就讓人相當驚恐，更何況一直反覆不斷地出現。六三處下震之極，再往前則是外卦上震，因此居於兩震之間，故曰「震蘇蘇」，意謂雷與變動反覆再三的來。震蘇蘇，或意指拍打瑞麥聲音為蘇蘇聲而沒有力氣。故以震行戒之，若能振作一些則可免於災眚。",
      "九四":"九四，震遂泥。\n《象》曰：震遂泥，未光也。\n\n雷擊打入泥中。傳統註解為：震動陷於泥濘之中。《象》曰：「震遂泥，未光也。」事情無法光大，志向無法伸展。九四以剛居柔不當位，又為六五的陰爻所駕乘，上卦震主坎陷之象（互體成坎）。無法震奮，有憂鬱之象。坎為泥，故震遂泥。",
      "六五":"六五，震往來厲，億无喪有事。\n《象》曰：震往來厲，危行也。其事在中，大无喪也。\n\n往外震動而引來危險，若能大有為則不會有所損失於祭祀之事。傳統註解為震動而往來皆危厲，六五以柔乘九四之剛，九四又是上震卦的卦主，因此和六二一樣有危險。但因五為君位，又有中庸之德，因此而億無喪。",
      "上六":"上六，震索索，視矍矍，征凶。震不于其躬，于其鄰，无咎。婚媾有言。\n《象》曰：震索索，中未得也；雖凶无咎，畏鄰戒也。\n\n震動卻意氣消沉，因恐懼而眼神不安，以此出征，凶。震霆未落在自身，而落在鄰居，沒有罪咎。婚媾而引來閒言閒語。上六處震卦的最後，已是強弩之末，故曰「索索」，意氣消沉也。意氣消沉又恐懼，以此行事，必敗無疑，所以說征凶。"
    }
  },
  "100100": {
    "name": "艮",
    "pinyin": "gèn",
    "summary": "兼山艮，艮為山，止步為安。(吉)",
    "detailed": "艮卦為東北之卦，節氣立春，艮序數為八。象徵靜止與穩固，如高山巍峨不動、重山阻擋，表示適宜保持現狀，不宜急進。君子應審時度勢，適時停步，等待更佳時機。應當停止的時候就停止，不變應萬變。守住本份，求得不犯錯，是處艮卦的最佳策略。",
    "explanations": {
      "運勢": "運勢平穩，宜守成不宜妄動。原地打轉，毫無進展，一事無成，建議深居簡出，不要積極做為。",
      "感情": "感情關係穩定，適合深思熟慮後行動。擦身而過，無法見面。阻礙重重。",
      "財運": "財運尚可，適合保守理財，避免冒險投資。",
      "工作": "停頓，發展非常困難。工作宜保持穩定，不宜輕易變動。",
      "買賣": "交易市場較穩，適合長期投資。",
      "考試": "考試運勢一般，需穩定心態應試。",
      "健康": "健康狀況良好，但需保持規律作息。",
      "訴訟": "訴訟不宜急進，需耐心等待機會。",
      "尋人": "尋人順利，對方可能靜居某處。",
      "尋物": "尋物可得，宜尋找固定存放處。",
      "旅行": "旅行不宜，靜養更佳。",
      "人際": "人際關係穩定，宜低調處事。",
      "卦辭": "艮其背，不獲其身。行其庭，不見其人，无咎。\n《彖》曰：艮，止也，時止則止，時行則行，動靜不失其時，其道光明。艮其止，止其所也。上下敵應，不相與也，是以不獲其身。行其庭不見其人，无咎也。\n《象》曰：兼山，艮，君子以思不出其位。\n\n回頭看到他的背，但卻追不到他的人。即使進入了他家庭院，還是見不到人。沒有罪咎。此言尋人不著。雖然瞥見了他的背影，卻還是錯過了他的人，沒能正面遇到。即使到了他家裡，走到庭院了，還是沒能找到。此喻指凡事都會錯身而過，遍尋不著。事情原地空轉而難有進度。艮應當作「反見」，回頭看的意思。「艮其背」為回頭瞥見到他的背影，意謂兩人錯身而過，但又追不到人。意思大致上是，艮其背講的是任事，即擔當責任。不獲其身講的是精白。所謂的精白，是講一個人精誠而廉潔。行其庭不見其人，講的是「以精白長眾」者極為難得而罕見。\n\n【卦旨】艮為抑止，艮卦卦象的止可為兩種止，一種是卦中的陽爻的止，陽爻本性好動，但身處極上的位置前已無路可去，所以不得不停止下來，另一種是卦中的陰爻的止，陰爻本性好靜而不動，因而以靜為止，揭示人的行為應當自我節制，力求做到行其所當行、止其所當止，動靜得宜，適可而止的道理。"
    },
    "yaoInterpretation": {
      "初六":"初六，艮其趾，无咎，利永貞。\n《象》曰：艮其趾，未失正也。\n\n回頭看到他的腳，沒有罪咎。利於長久堅定守正。也可解釋為小心、注意他的腳，因此而无咎。艮卦談的是尋人的過程，後面爻辭談到人墜落受傷，則這裡講的是人好好的站著，確認其為平安，因此說回頭看到他的腳。傳統解釋「艮其趾」為停止於他的腳。腳、趾比喻開始，艮其趾亦可理解作「艮其始」，也就是一開始就能夠知所停止。而初爻亦有初始之義。艮其趾，言一開始就知所止則能免咎。",
      "六二":"六二，艮其腓，不拯其隨，其心不快。\n《象》曰：不拯其隨，未退聽也。\n\n回頭看到他的小腿，看到時已來不及拯救他的失足墜落，因此心中相當不快。六二爻辭傳統解釋相當分歧，但意思大概是指停止其小腿，腳因為不能抬起，所以心中相當不快。",
      "九三":"九三，艮其限，列其夤，厲熏心。\n《象》曰：艮其限，危薰心也。\n\n回頭看他的腰部，背脊受傷而撕裂，痛徹心扉。六二言「不拯其隨」，當看到所要找的人時，已經來不及救人而失足墜落，或許是墜落山崖。九三則是講人墜落後受傷，傷到了背脊而痛苦不堪。傳統解釋為停止在腰部，背脊受傷，心中憂慮害怕到極點。腰為全身運動的樞紐，停在腰部則全身無法伸展，停於不該停的地方，反讓自己的背脊受傷。",
      "六四":"六四，艮其身，无咎。\n《象》曰：艮其身，止諸躬也。\n\n照顧他的身體，沒有罪咎。艮在外卦時取象為照顧、照護，因此艮卦爻辭自六四之後艮解釋為照顧，有別於前三爻的回頭看或狠狠的看。前三爻言找人過程，但是找到人時卻是已經墜落受傷，而後三爻講的則是如何照顧傷患。傳統解釋為停止身體的運動，沒有罪咎。身指上半身，上半身為人身的主體，因此身體停而全身停。既然身體停止，則完全無所做為，當停止而停止，所以無咎。",
      "六五":"六五，艮其輔，言有序，悔亡。\n《象》曰：艮其輔，以中正也。\n\n注意他的口頰，講話很有條理，不用悔恨。繼先前爻辭，由於人已墜落受傷，因此找到人之後關心人身安危，與其言談，發現到並沒有語無倫次或是失去意識的現象。「艮其輔，言有序」講的正是人還有清楚的意識，代表人雖受傷，但並不是太嚴重，因此說「悔亡」。",
      "上九":"上九，敦艮，吉。\n《象》曰：敦艮之吉，以厚終也。\n\n受到很好的照顧，吉。敦為敦厚、篤實的意思。此艮當作照顧解，篤實、厚實的照顧，就是照顧得非常好，因此為吉。此《象傳》說的「以厚終也」。傳統解釋敦艮為敦厚的停止，上九為艮道之極致，同時也是艮卦即將終結之時，停止於敦厚。艮為山，山有敦厚之象，由於敦厚而能有所不為，吉，能以敦厚而終。敦艮意味其艮出自天然之本性，淳樸而天然，並非勉強造作，因此為吉。"
    }
  },
  "110100": {
    "name": "漸",
    "pinyin": "jiàn",
    "summary": "風山漸，山上臨風，循序漸進。(中吉)",
    "detailed": "漸卦象徵逐步發展，如風慢慢吹拂高山，表示事物需循序漸進，風屬木，山上有木，樹木生長於山上，也是適得其所之象，君子應按部就班，不可操之過急。忌取巧走捷逕，不能躁進。依禮法而行，循序漸進，則諸事大吉。",
    "explanations": {
      "運勢": "進取可以有功，但應當循序漸進。運勢穩定，事業與人生需耐心發展。",
      "感情": "感情進展穩定，適合長期規劃。漸卦又有少男與長女婚合之象，女嫁大吉",
      "財運": "財運平穩，宜採取長期投資策略。",
      "工作": "分段擬定目標，按部就班，循序漸進，可以有所獲得。工作需一步步累積，不可求快。",
      "買賣": "交易穩定，長期合作可獲利。",
      "考試": "考試運佳，努力學習可得好成績。",
      "健康": "健康良好，適合漸進式調理。",
      "訴訟": "訴訟進展緩慢，需耐心等待。",
      "尋人": "尋人順利，對方可能緩慢前行。",
      "尋物": "尋物可得，需仔細尋找。",
      "旅行": "旅行適宜，但不宜匆忙行動。",
      "人際": "人際關係和諧，適合穩步經營。",
      "卦辭": "漸，女歸吉，利貞。\n《彖》曰：漸之進也，女歸吉也。進得位，往有功也。進以正，可以正邦也。其位剛得中也。止而巽，動不窮也。\n《象》曰：山上有木，漸，君子以居賢德善俗。\n\n漸進，女子嫁人吉，利於貞定。女子嫁人為歸，因為嫁人為女子的歸宿。漸進不只適於嫁女，也有利於君子的進升。《彖》曰：「漸之進也，女歸吉也。進得位，往有功也，進以正，可以正邦也。其位剛得中也。止而巽，動不窮也。」九五君爻剛得位而得中。停止然後再漸進，前進的力量可以源源不絕。循序漸進則諸事大吉。\n\n【卦旨】漸為漸進，漸就是有次序的、按步驟的行進，也即循序漸進，那就不可能一蹴而就，因而包含緩慢行進之意，漸卦辭以女歸來闡發循序漸進的重要性與合理性，所為女歸就是女子出嫁，在古代女子出嫁必須經過納采、問名、納吉等七個步驟，所以古代的男人想迎娶新娘，將是一個比較漫長的過程，也即循序漸進的過程，從法律的角度來講漸卦與歸妹卦都是講所謂的程序正義，指不過漸卦從正面講述，而歸妹卦從反面講述，揭示任何事物的發展都必須順乎自然，循序漸進，而不能違反規律，急功冒進的道理。"
    },
    "yaoInterpretation": {
      "初六":"初六，鴻漸于干。小子厲，有言，无咎。\n《象》曰：小子之厲，義无咎也。\n大雁逐漸飛到水岸邊，年青的小子有危險，身受流言蜚語，沒有罪咎。「小子厲有言」大致解釋為君子受小人饞言之害。毀於謗言，故曰小子厲有言。小人之言，未傷君子之義，故曰无咎。",
      "六二":"六二，鴻漸于磐，飲食衎衎，吉。\n《象》曰：飲食衎衎，不素飽也。\n大雁飛到了大石頭上，很快樂地在上面享受美食，吉。磐為大石頭，象徵穩定、安穩。鴻鳥在石頭上之所以能夠很快樂地飲食，是因為感覺到安全與穩當。《象》曰：「飲食衎衎，不素飽也。」之所以飲食快樂自得，不是單純的飽腹而已，當中還有安全、得志。",
      "九三":"九三，鴻漸于陸，夫征不復。婦孕不育，凶。利禦寇。\n《象》曰：夫征不復，離群醜也；婦孕不育，失其道也；利用禦寇，順相保也。\n大雁飛到陸地，丈夫出征一去無回。婦人懷孕而無法生養兒女，凶。宜於抵禦賊寇。此言丈夫因為出征而陣亡，在家之妻子因此難以獨立生養小孩，因此為凶。然而《象傳》說「夫征不復，離群醜也」，之所以無法回家，是因為離開了同類。「婦孕不育，失其道也」言婦女不守婦道。歷代注解者皆依此而認為丈夫沉迷於女色而不回家，而女人也跟人私奔而不養育小孩。就卦象來看，九三從六二的山腰坎下，一下飛到山頂坎中，進不循序，因此而凶。得此爻利於守在原處防禦賊寇之來襲，不宜採取攻勢主動出擊。出擊則有「夫征不復」的凶險。",
      "六四":"六四，鴻漸于木，或得其桷，无咎。\n《象》曰：或得其桷，順以巽也。\n大雁飛到了樹上，或許可以找根粗壯的橫木來停歇，沒有罪咎。鴻鳥腳趾太長而相連，無法棲於一般的樹枝上，只有橫而粗的樹枝（桷）才可以棲息。此比喻在漸進的中途中，應當要能夠權宜而順應環境。",
      "九五":"九五，鴻漸于陵，婦三歲不孕，終莫之勝吉。\n《象》曰：終莫之勝吉，得所願也。\n大雁飛到了丘陵上，婦女三年無法懷孕。但終究能得償所願，最後為吉。「婦三歲不孕」是因無法見到丈夫，所以無法懷孕。但是三年過後，終究能得償所願，最後為吉。三年是概略之數，意思是幾年以後，並非一定是三年。",
      "上九":"上九，鴻漸于陸，其羽可用為儀，吉。\n《象》曰：其羽可用為儀，吉，不可亂也。\n大雁飛到天空雲路上，它的羽毛可用於禮儀，吉。鴻雁羽毛用於禮儀，有秩序井然不亂的象徵意義。九三亦云「鴻漸於陸」。漸卦六爻以鴻漸鋪陳，初漸於干，二漸於磐，三漸於陸，四漸於木，五漸於陵。干為岸，仍在水邊；磐為石，陸為高平之地，陵為比陸更高的山陵。"
    }
  },
  "001011": {
    "name": "歸妹",
    "pinyin": "guī mèi",
    "summary": "雷澤歸妹，雷震於澤，陰陽失衡。(小凶)",
    "detailed": "歸妹卦「歸妹」原為出嫁少女的意思，此指女子動情馬上就嫁人，男長女少不符合傳統的禮法。象徵不合時宜的結合，如雷震於澤，雷震於上，澤隨而動，表示事情發展未必穩固，君子應慎重決策，避免倉促行事。凡事要特別注意不要一廂情願、感情用事，注意法律、輿論等風險。",
    "explanations": {
      "運勢": "運勢較低，行事需審慎考慮。談合之事可成。爭論、抗議等行動大凶。",
      "感情": "婚姻可成，但過於感情用事。感情關係不穩，可能出現不適合的結合。",
      "財運": "財運不穩，投資需謹慎，避免短視近利，盲從則凶。",
      "工作": "工作易有變動，需冷靜應對。結盟、合作可以成功，但有法律風險。其餘事務，凶，無利可圖。",
      "買賣": "交易市場波動大，宜保守經營。",
      "考試": "考試運一般，需專注準備。",
      "健康": "健康需特別注意，可能有身心失衡情況。",
      "訴訟": "訴訟易有變數，需慎重處理。",
      "尋人": "尋人困難，對方可能行蹤不定。",
      "尋物": "尋物較難，可能誤放或遺失。",
      "旅行": "旅行不宜，可能有突發變數。",
      "人際": "人際關係需謹慎，避免盲目信任。",
      "卦辭": "歸妹，征凶，无攸利。\n《彖》曰：歸妹，天地之大義也。天地不交，而萬物不興。歸妹，人之終始也，說以動，所歸妹也。征凶，位不當也；无攸利，柔乘剛也。\n《象》曰：澤上有雷，歸妹。君子以永終知敝。\n\n嫁女兒，出征凶，無所利。婚嫁之事可成，但出征則凶，無所利。《彖傳》：「征凶，位不當也；无攸利，柔乘剛也。」指九二、六三、九四，到六五，全部都不當位，長男與少女都不符禮法。柔乘剛指六三乘九二，六五乘九四，為逆，因而無所利。此為商王帝乙將女兒嫁給周文王的故事，當時為安撫周而採取和親政策，既然和親，當然就不能出征，出征則凶。且這畢竟只是緩兵之計，無法長久。\n\n【卦旨】歸妹為少女出嫁，與漸卦的女歸不同，歸妹的少女出嫁是反常理的，因為她沒有經過納采、問名等婚嫁步驟，為少女擅自嫁人，因此既不合乎禮儀，也不合乎情理，對於這種不合理的行為卦辭直接給予征凶的答案，從法律的角度來講漸卦與歸妹卦都是講所謂的程序正義，指不過漸卦從正面講述，而歸妹卦從反面講述，揭示該事物不可不按常理一蹴而就、急為求成，如女子婚嫁不可急就強求，而應當堅持正道，其柔順，幽靜恬淡，順其自然而成之的道理。"
    },
    "yaoInterpretation": {
      "初九":"初九，歸妹以娣，跛能履，征吉。\n《象》曰：歸妹以娣，以恒也；跛能履，吉，相承也。\n\n少女嫁人為女娣，跛腳也能走路，出征吉。古代女子的妹妹作為陪嫁以共事一夫，稱娣。娣並非正室，只能輔助正室，所以其婚姻以「跛能履」為喻。跛腳者也能走路，但行動不便，也難遠行。此事雖吉，但無法有大成就。",
      "九二":"九二，眇能視，利幽人之貞。\n《象》曰：利幽人之貞，未變常也。\n\n一眼盲者也是能看得到，但是所看到的卻是偏斜（邪）而不夠清楚。利於像隱者一樣的貞定。同履卦九二「履道坦坦，幽人貞吉」的「幽人」。有兩種解釋。一是指隱士或名聲未顯之人。二是指被囚禁的人，或是犯人。",
      "六三":"六三，歸妹以須，反歸以娣。\n《象》曰：歸妹以須，未當也。\n\n少女以嬃女身份出嫁，但又返回改以陪嫁女娣身份出嫁。或以「須」為等待，全句意思為嫁的不是時候，所以還必需再等待，再換為娣女的身份則可行。此比喻行事時機不對，身份不適當。",
      "九四":"九四，歸妹愆期，遲歸有時。\n《象》曰：愆期之志，有待而行也。\n\n少女嫁人過了期，遲嫁最後還是會有個時間。《象傳》「愆期之志，有待而行也」似乎意指九四爻與六三之間的關聯，並以六三「歸妹以須」的「須」為待。",
      "六五":"六五，帝乙歸妹，其君之袂不如其娣之袂良，月幾望，吉。\n《象》曰：帝乙歸妹，不如其娣之袂良也。其位在中，以貴行也。\n\n帝乙家中少女出嫁，其夫君的衣袖裝飾不如陪嫁女娣的好。月亮幾乎要滿月，吉。帝乙之女身為皇室，身份之高貴，不可言喻。連陪嫁女的裝飾都把新郎官給比下去，可見新娘裝飾之華貴。此有如既濟九五：「東鄰殺牛，不如西鄰之禴祭，實受其福。」東鄰為殷商，西鄰為周。此喻殷商尚虛容浮華，不尚實；周尚實而不尚虛榮外飾。傳統將「君」解釋為「小君」，即帝乙之女，也就是嫁人的公主，言公主的衣袖不如陪嫁女娣的精美。但這樣的解釋相當奇怪，於文義相當不合理。因此歷代注解者想盡辦法自圓其說，例如解釋說公主本身就極為尊貴不需外在裝飾等諸如此類的。",
      "上六":"上六，女承筐无實，士刲羊无血，无攸利。\n《象》曰：上六无實，承虛筐也。\n\n女子捧著獻禮用的竹框卻是空的，男子殺羊卻殺不出血。此事無法有所利益。此言祭祀過程非常的不順利，狀況連連，很多的不祥之兆，不受鬼神的保佑，因此說無所利。"
    }
  },
  "001101": {
    "name": "豐",
    "pinyin": "fēng",
    "summary": "雷火豐，雷震耀明，富足昌盛。(大吉)",
    "detailed": "豐卦象徵豐盈與昌盛，如雷震火光耀，象徵財富與機會增加。君子應善加利用資源，維持長久之勢。凡事都適宜盛大舉行，讓它眾人皆知。事情可以打鐵趁熱，順勢推舟。",
    "explanations": {
      "運勢": "日正當中為宜。凡事宜盛大，有貴客蒞臨。運勢大吉，機會豐富，適合積極行動。",
      "感情": "情感基礎雖不深，但至少表象亮麗而精彩豐富。感情關係穩定，適合深化發展。",
      "財運": "財運旺盛，適合開創新事業。",
      "工作": "工作前景廣闊，適合積極進取。不需太過擔心，有貴人相助。適於行銷、廣告、活動等之舉行。",
      "買賣": "交易市場有利，獲利機會高。",
      "考試": "考試運佳，準備充足可獲高分。",
      "健康": "健康良好，適合增強體能。",
      "訴訟": "有所進展，訴訟有利，可望勝訴。",
      "尋人": "尋人順利，對方可能狀況良好。",
      "尋物": "尋物容易，可在資源充足處尋找。",
      "旅行": "旅行適宜，可帶來豐富收穫。",
      "人際": "人際關係良好，貴人相助。",
      "卦辭": "豐亨，王假之。勿憂，宜日中。\n《彖》曰：豐，大也。明以動，故豐。王假之，尚大也；勿憂，宜日中，宜照天下也。日中則昃，月盈則食，天地盈虛，與時消息，而況於人乎？況於鬼神乎？\n《象》曰：雷電皆至，豐，君子以折獄致刑。\n\n豐富盛大，亨通，大王親自蒞臨，不要擔憂，事情適於在日正當中的時候進行。《彖傳》說「王假之，尚大也」，得豐卦事情宜盛大舉行。「宜日中，宜照天下也」，宜日中象徵的是這事宜於召告天下讓天下皆知，光明正大地去做。後文又說：「日中則昃，月盈則食，天地盈虛，與時消息，而況於人乎？況於鬼神乎？」太陽過中之後就會西下，月亮滿月之後就會月蝕，天地都會消息盈虛了，更何況於人和鬼神？此一方勉勵人做事當把握最佳時機，也就是日正當中的那一刻。事情要趁著最佳時機順水推舟，需有聰明的判斷力加上雷震般的行動力。另一方面也告誡君子當明盛衰循環的天地消息之理。\n\n【卦旨】豐為豐大、盛大之意，是指事物發展到最鼎盛的時候，它是絕對的、無與倫比的盛大，盛大固然是好事，但以是極盛不可能再上，必然會走下坡，往往意味著衰落的開始，所以如何保持這種盛大就成了豐卦所要探討的首要問題，揭示事物發展處於豐沛盛大之時，應當保持光明誠信的美德，慎行以求豐保泰的道理，同時也揭示了盛極而衰是事物發展的必然規律。"
    },
    "yaoInterpretation": {
      "初九":"初九，遇其配主，雖旬无咎。往有尚。\n《象》曰：雖旬无咎，過旬災也。\n\n遇到匹配的主人，雖然停留一旬，不會有罪咎，前往能得到獎賞。然而若是久留過旬，則會有災難。",
      "六二":"六二，豐其蔀，日中見斗，往得疑疾，有孚發若，吉。\n《象》曰：有孚發若，信以發志也。\n\n日食而豐大其遮蔽的陰影，以至於日正當中時竟然天黑，而可以見到斗星。貿然前往一定會遭到猜疑，但若能以誠信慢慢感化則吉。前段言太陽因日食或被遮蔽而黯淡無光，比喻君王被小人所蒙蔽。後段言君子因被蒙蔽而有了疑心病，為臣者必需以誠信才能夠啟發君王。疑疾：疑心病。",
      "九三":"九三，豐其沛，日中見沬，折其右肱，无咎。\n《象》曰：豐其沛，不可大事也；折其右肱，終不可用也。\n\n天空更暗，以至於日正當中時還能夠見到小小的沬星。折斷他的右臂，沒有罪咎。六二跟九四都說「豐其蔀，日中見斗」，九三說「豐其沛，日中見沬」，沬為斗杓後的小星，遠不如北斗明亮，則太陽被遮蔽的程度更嚴重，天色更暗。喻君王昏昧加重，以至於大臣蒙冤下台，君王失去右輔。右輔喻指輔佐君王的重要大臣。",
      "九四":"九四，豐其蔀，日中見斗，遇其夷主，吉。\n《象》曰：豐其蔀，位不當也；日中見斗，幽不明也；遇其夷主，吉行也。\n\n豐大到日食的陰影，以至於日正當中時竟然天黑，可以見到斗星。遇到昏暗時代中的主人，吉。九四爻變，卦成明夷。初九曰遇其配主，九四曰遇其夷主。通論認為，初九所遇之配主即九四，而九四之夷主為初九。豐卦六二至九四三爻似在講日食之過程。巽似乎有烏雲或蒙蔽之象，故小畜說「密雲不雨」，六二至九四互體為巽。互體兌又為暗昧，下有離日，故六二至九四皆言離日被蒙蔽。此或以烏雲之蔽日在強調日食之過程，六二是日食之開始，所以往得疑心病。而九四是即將結束，意謂日將重明，因此「遇其夷主」。",
      "六五":"六五，來章，有慶譽，吉。\n《象》曰：六五之吉，有慶也。\n\n章美之來，得到慶賀與讚譽，吉。慶譽：福慶，可慶賀的事。譽：名譽，好的名聲。",
      "上六":"上六，豐其屋，蔀其家，闚其戶，闃其无人，三歲不覿，凶。\n《象》曰：豐其屋，天際翔也；闚其戶，闃其无人，自藏也。\n\n盛大其住屋，覆蓋其住家。窺探他家門戶，空空不見人影。三年都看不到人，凶。此言住屋豪華極奢，但將家裡封閉起來，隔絕於外。外人只能偷窺他的門戶，裡面空空不見人影，如此自絕，久當遭禍，三年必將應驗。"
    }
  },
  "101100": {
    "name": "旅",
    "pinyin": "lǚ",
    "summary": "火山旅，山上有火，漂泊不定。(小凶)",
    "detailed": "旅卦象徵流動與不穩，如野火燒山，表示變動與漂泊不定，通常代表事情狀況不穩定，外在形勢與條件不利於己，君子應謹慎行事，避免失去根基。聰明於內，謹慎於外，守靜為宜。小事可以亨通，大事則凶。吉道在於守靜，多看多觀察而少行動。",
    "explanations": {
      "運勢": "小事可亨通，大事凶。事情不穩定。運勢不穩，易有變動，需適應環境。",
      "感情": "感情關係波動，需穩固基礎。對象不固定。",
      "財運": "財運欠佳，避免短線投資。",
      "工作": "工作易變動，需靈活應對。項目與方向不穩定。",
      "買賣": "交易市場不穩，宜保守經營。",
      "考試": "考試運一般，需專心準備。",
      "健康": "健康需注意，可能有過勞跡象。",
      "訴訟": "訴訟進展反覆，需慎重處理。",
      "尋人": "尋人困難，對方可能在遠方。",
      "尋物": "尋物較難，可能遺失於外地。",
      "旅行": "行旅在外行事應低調，旅行易有變數，需做好準備。",
      "人際": "人際關係易變動，需維持誠信。",
      "卦辭": "旅，小亨，旅貞吉。\n《彖》曰：旅，小亨，柔得中乎外而順乎剛，止而麗乎明，是以小亨，旅貞吉也，旅之時義大矣哉。\n《象》曰：山上有火，旅，君子以明慎用刑而不留獄。\n\n旅，小亨通。旅，正定為吉。旅於小事可亨通，大事則不可。《易經》的亨和利偶有加「小」者，除旅小亨外，巽亦言小亨。賁卦「亨，小利有攸往」，遯卦「亨，小利貞」。陽為大，陰為小，以陰爻為主爻者則稱小。因此旅卦主爻應是六五，因此《彖傳》說「小亨，柔得中乎外而順乎剛」。明斷而謹慎地使用刑罰，有獄訟則立即執行。不留，不滯留。獄，罪刑之判決。不留獄，案件之判決不可滯留，應馬上執行。\n\n【卦旨】旅為行旅、羈旅之意，也即居無定處、四處漂泊，往往存在不確定性，有人在飄泊的羈旅中發展興盛起來，而有的人漂泊一生，最後還是一事無成，揭示無所安居，羈旅在外之時，應當堅持貞正、柔順守中，既不可過卑而自辱，亦不能過亢而見嫉的道理。"
    },
    "yaoInterpretation": {
      "初六":"初六，旅瑣瑣，斯其所取災。\n《象》曰：旅瑣瑣，志窮災也。\n\n行旅在外而用心瑣碎，因此而引來災難。象曰：「旅瑣瑣，志窮災也。」人窮志短，以至於太過淺狹，過於斤斤計較而引禍上身。",
      "六二":"六二，旅即次，懷其資，得童僕貞。\n《象》曰：得童僕貞，終无尤也。\n\n行旅在外而找到旅舍，懷藏其財物，得到的童僕很忠心。",
      "九三":"九三，旅焚其次，喪其童僕，貞厲。\n《象》曰：旅焚其次，亦以傷矣。以旅與下，其義喪也。\n\n旅行中所住的旅舍被焚毀，喪失了童僕。堅持則危險。九三處互體巽中，為前進不果。互體兌下，為毀折、損傷。近於上卦離火，故遭焚。艮為童僕，兌毀之，故喪其童僕。《象》曰：「旅焚其次，亦以傷矣。以旅與下，其義喪也。」失去暫時的安居之所與僕人，損傷很大。以「旅人」對待下屬（把下屬當作旅人），得此傷害乃是應得的。與九三對應的上九「鳥焚其巢」，亦曰「焚」。",
      "九四":"九四，旅于處，得其資斧，我心不快。\n《象》曰：旅于處，未得位也；得其資斧，心未快也。\n\n旅途中找到歇腳的地方，雖然得到財物與防身及劈荊斬棘之用的斧頭，然而畢竟缺乏棲居之所，因此心中相當不悅。或以旅為行軍，資斧為代表軍權的斧鉞。得資斧則握有軍權，旅於處則軍旅居而不行。有軍權而不能行軍，因此我心不快。資斧有多種說法。1 .資，為物資或財物。斧，斧頭，可以防身，又可開路。2. 或以資斧為齊斧，利斧也。 3. 資斧為古代的貨幣。為行商所攜的貨幣",
      "六五":"六五，射雉，一矢亡，終以譽命。\n《象》曰：終以譽命，上逮也。\n\n射雉雞，雖然損失一支箭，但最終得到獎賞的命令。言所喪失的東西不多，但所得到的名聲卻很高。所損失者小，所獲得者多，朱子所說：「雖不无亡矢之費，而所喪不多，終有譽命也。」此塞翁失馬，焉知非福也。",
      "上九":"上九，鳥焚其巢，旅人先笑後號咷，喪牛于易，凶。\n《象》曰：以旅在上，其義焚也；喪牛于易，終莫之聞也。\n\n鳥巢被焚毀，旅人先是大笑，而後號咷大哭。喪失牛於狄人，凶。此爻講的則是周太王時，周人被狄人侵迫，從邠遷於岐山下的周原，全族變成旅人，遷移時逃跑的狼狽情況。九三「旅焚其次」，離九四「焚如死如棄如」。"
    }
  },
  "110110": {
    "name": "巽",
    "pinyin": "xùn",
    "summary": "隨風巽，巽為風，柔順入世。(中吉)",
    "detailed": "巽卦為東南之卦，節氣為立夏，巽序數為四，象徵柔順與滲透，如風連續吹拂，代表順應環境而行，君子應低調行事，以靈活變通取勝。事緩則圓，凡事柔順以對，慢慢進行，都可成功。但小事可成，大事凶。宜找貴人。做任何事都要記得不厭其煩的再三叮嚀。",
    "explanations": {
      "運勢": "柔順而慢慢地來，都可成功。運勢良好，適合順勢而行。",
      "感情": "可以漸入佳境。感情關係和諧，彼此理解為要。",
      "財運": "財運穩定，適合靈活經營。市利三倍，大吉。",
      "工作": "工作適合低調推進，逐步發展。",
      "買賣": "交易有利，靈活應對可得好處。",
      "考試": "考試運一般，需保持耐心與細心。",
      "健康": "健康良好，適合柔和養生法。",
      "訴訟": "訴訟有利，宜循序漸進處理。",
      "尋人": "尋人順利，對方可能隱身某地。",
      "尋物": "尋物可得，可能藏於隱密處。",
      "旅行": "旅行適宜，順應環境可有收穫。",
      "人際": "人際關係良好，宜圓融處世。",
      "卦辭": "巽，小亨，利有攸往，利見大人。\n《彖》曰：重巽以申命，剛巽乎中正而志行，柔皆順乎剛，是以小亨，利有攸往，利見大人。\n《象》曰：隨風，巽，君子以申命行事。\n\n於小事可亨通，大事則不可。陽為大，陰為小，以陰爻為主爻者則稱小。巽卦主爻應是初六與六四，因此《彖傳》說「柔皆順乎剛，是以小亨」。巽為命令，重巽為申命之象。以巽為重巽之象，因此將申解釋為重，重複，引申為反覆不斷。\n\n【卦旨】巽為入也，巽卦的入不是一般的入，是進入道事物的內裡核心，從根本上解決問題，揭示為人處世應當謙順以致亨通的道理，但也反對盲目順從，優柔寡斷和過於自卑畏縮，主張以謙順而達到有所為。"
    },
    "yaoInterpretation": {
      "初六":"初六，進退，利武人之貞。\n《象》曰：進退，志疑也；利武人之貞，志治也。\n\n進退不果，宜於武人的堅定。意志不堅，心生懷疑，不夠果斷。反之對於武人等意志較剛強的人而言則非常有利，因為這類型的人做事不會有猶疑不定的弊病。巽為進退不果，意志不堅定，對事情猶疑。陽剛不足，陰柔有餘。而具有陽剛之氣的人，特別是武夫、軍人，秉性剛毅而果決，沒有進退猶疑的缺失。因此為吉。貞，堅定的意思。",
      "九二":"九二，巽在床下，用史巫紛若，吉，无咎。\n《象》曰：紛若之吉，得中也。\n\n拜伏於牀下，有如史巫一樣的祭禱，吉則可以免除罪咎。謙卑而誠心的禱告，將得保祐而吉。史巫，通鬼神者，類似今之靈媒、法師。紛若，繽紛、紛紛，形容史巫祭禱手足舞蹈的樣子。荀爽則認為，「用史巫紛若」是將軍征伐勝利之後，以史官書寫功勳，請巫祭祀告訴於宗廟。",
      "九三":"九三，頻巽，吝。\n《象》曰：頻巽之吝，志窮也。\n\n憂愁的跪伏，吝。志短而心生憂戚，有志難伸。頻，同顰，皺眉、憂愁的樣子。巽為伏。",
      "六四":"六四，悔亡，田獲三品。\n《象》曰：田獲三品，有功也。\n\n不再後悔，打獵捕獲的獵物很多，足以做為三種品類的用途。打獵捕獲三品的獵物，收穫非常豐盛。下足以宴請賓客，上足以奉獻君上、敬鬼神。田，畋獵，打獵。品，品類。三品，三種品類的用途。品類並不是指獵物之種類，而是指用途。",
      "九五":"九五，貞吉悔亡，无不利。无初有終，先庚三日，後庚三日，吉。\n\n《象》曰：九五之吉，位正中也。\n貞定則吉而不再後悔，無不利。沒有開始，卻有結果。庚日之前三天（丁日，丁寧的意思），庚日之後三天（癸日，揆度的意思），都是吉日。或言命令的變更施行，一定要審慎，前三天要就要開始準備與試行，施行之後三天還要持續追蹤與了解其施行的狀況。",
      "上九":"上九，巽在床下，喪其資斧，貞凶。\n《象》曰：巽在床下，上窮也；喪其資斧，正乎凶也。\n\n拜伏於牀下，喪失了財產與斧頭，堅定為凶。資斧象徵的是權力、權位，決斷的工具。喪失決斷工具，則不足以申命行權。資斧有多種說法。1 .資，為物資或財物。斧，斧頭，可以防身，又可開路。2. 或以資斧為齊斧，利斧也。 3. 資斧為古代的貨幣。為行商所攜的貨幣"
    }
  },
  "011011": {
    "name": "兌",
    "pinyin": "duì",
    "summary": "麗澤兌，兌為澤，喜悅溝通。(中吉)",
    "detailed": "兌卦為正西之卦，節氣秋分，兌序數為七，象徵愉悅與溝通，如雙澤相連，表示言語與交流的重要性。君子應善於溝通，以和氣待人，促成美好關係。兌另表「悅」，喜悅是趨動人前進的很大力量，利於守正，忌於偏邪。施比受者有福，施惠於人則自己也將受益。兌卦又有「說」既講習之象，能夠與人相互切磋，當有所得。",
    "explanations": {
      "運勢": "小事可亨通。若能以喜悅來驅動人，則無往不利。運勢良好，適合社交與表達。",
      "感情": "感情關係和諧融洽，宜多加交流。",
      "財運": "財運穩定，口才佳者可得財。",
      "工作": "小亨通。工作適合協商談判，可獲成功。適於娛樂事業。",
      "買賣": "交易順利，語言能力可帶來優勢。",
      "考試": "考試運佳，適合口試或論述型考試。",
      "健康": "健康良好，宜多與人交流舒緩壓力。",
      "訴訟": "訴訟有利，溝通可化解紛爭。",
      "尋人": "尋人順利，對方可能願意回應。",
      "尋物": "尋物可得，可能遺落於交流場所。",
      "旅行": "旅行適宜，可帶來愉快體驗。",
      "人際": "人際關係良好，宜多參與社交活動。",
      "卦辭": "兌，亨，利貞。\n《彖》曰：兌，說也。剛中而柔外，說以利貞，是以順乎天而應乎人。說以先民，民忘其勞，說以犯難，民忘其死，說之大，民勸矣哉。\n《象》曰：麗澤，兌。君子以朋友講習。\n\n面對面溝通以說服他，亨通，利於正定。《彖傳》談的是「說服」溝通的重要性。《彖傳》言，在勞動人民之前先溝通說服之，人民可以忘記辛勞。說服他犯難，人民可以忘記生死。說服力量之大，人民可以因此就得到勉勵。傳統注解以兌為悅，卦辭言，喜悅而有亨道，但其要亦在於守正。\n\n【卦旨】兌為欣悅，悅有兩種，一種是悅己，一種悅人，兌卦的悅主要指在悅己的基礎上悅人，何謂悅己基礎悅人？簡言之就是自己愉悅的同時，也能使別人感到愉悅，或者取悅別人時，自身內心也是愉悅的，讓別人感到愉悅必須有度，不能失了底線，如果過度取悅別人，那就變成了諂媚，揭示人與人之間應當和悅相處的道理，但也反對諂媚取悅，曲意逢迎，而主張動機純正，誠信為本，力求內剛外柔，和而不同。"
    },
    "yaoInterpretation": {
      "初九":"初九，和兌，吉。\n《象》曰：和兌之吉，行未疑也。\n\n內心相應的談話，吉。和兌類似於「相談甚歡」的意思，言兩人對話彼此相應，非常和諧，所以為吉。《象》曰：「和兌之吉，行未疑也。」有所相應的對談之所以吉，因為行為不會有任何懷疑。傳統以和兌為和悅。",
      "九二":"九二，孚兌，吉，悔亡。\n《象》曰：孚兌之吉，信志也。\n\n誠信交心的對話，吉，不會有後悔。孚為信，誠信、信實、相感，也有交心之意。孚兌，彼此相信、交心的談話。《象》曰：「孚兌之吉，信志也。」所以吉，因為可以伸展志向。傳統注解為有孚信而悅，乃能得吉而悔亡。",
      "六三":"六三，來兌，凶。\n《象》曰：來兌之凶，位不當也。\n\n招來他人的言說，凶。或：前來遊說，凶。易經中講「來」是指從外到內，六三往內就是指比鄰的九二。三為多凶之位，六三又以陰柔居陽剛之位，不當位，又乘九二，為逆，凶。兌為口舌，來兌，為招來口舌。傳統以兌為悅，來兌為反來求悅。",
      "九四":"九四，商兌未寧，介疾有喜。\n《象》曰：九四之喜，有慶也。\n\n商量討論一直不定，大病將可痊癒。或以介疾有喜為，與惡畫清界限則有喜。此言與人商討事情一直不順遂，無法有結果。若行事公正不偏，與不義畫清界線，則終有喜慶，表示商討可以有結果。反之，若有偏頗則有罪咎。傳統以兌為悅，此言：商度自己之所悅，心有不安。若能介然守正則有喜。",
      "九五":"九五，孚于剝，有厲。\n《象》曰：孚于剝，位正當也。\n\n相信於小人的剝爛之道，有危險。剝在易學上為陽氣被陰氣所剝除，小人道長，君子道消的意思。孚于僕，相信親近的僕人，此為危厲之道。",
      "上六":"上六，引兌。\n《象》曰：上六引兌，未光也。\n\n冗長的言談。爻辭未言吉凶，但《象傳》以「未光」形容之。言談冗長則吉凶難定，故不言吉凶。上六已到兌的極點，理應退而居靜，不輕說於人。但仍力求說服，顯然不是很好的說服方式。"
    }
  },
  "110010": {
    "name": "渙",
    "pinyin": "huàn",
    "summary": "風水渙，風起波瀾，分散重組。(小凶)",
    "detailed": "渙卦象徵分散與流動，風行水上如風吹水面，表示局勢變化大，卦象又有散亂不整，意志鬆懈，離散之意，因此渙卦也有散心，心結解開的意謂。君子應善於適應變局，重新整合資源。風屬木也可視作水上浮木，巽木則為舟楫，能夠幫人渡河、濟險，化解危險，危險可化解。但凡事若要成功，則較為困難，問題在於人心過於渙散。如果能夠對此對症下藥，得以小有成就。",
    "explanations": {
      "運勢": "可以化險為夷，但諸事難成。運勢不穩，需調整方向，應變力強者較有利。",
      "感情": "感情關係變動，需重新審視。分離之象。",
      "財運": "財運起伏，避免投資過於分散。",
      "工作": "工作有變動，需重新規劃方向。危險可除，但難有成就。",
      "買賣": "交易市場變化快，宜審慎應對。",
      "考試": "考試運一般，需調整學習策略。",
      "健康": "健康需注意，可能有消耗過多精力的狀況。",
      "訴訟": "訴訟進展反覆，宜慎重處理。",
      "尋人": "尋人困難，對方可能行蹤不定。",
      "尋物": "尋物較難，可能已遺失。",
      "旅行": "旅行不宜，可能行程變動大。",
      "人際": "人際關係變化快，需審慎交友。",
      "卦辭": "渙，亨，王假有廟，利涉大川，利貞。\n《彖》曰：渙亨，剛來而不窮，柔得位乎外而上同。王假有廟，王乃在中也。利涉大川，乘木有功也。\n《象》曰：風行水上，渙，先王以享于帝，立廟。\n\n君王到宗廟意謂有大事，集合眾人以敬告於鬼神，有凝聚人心的效用。利涉大川，有利於涉險行事的意思。渙亨，傳統註解為離散解難而得亨通，王假于廟則是會聚離散之人心。\n\n【卦旨】渙為渙散，是散除、散除險難的意思，渙卦坎上巽下，坎為難，巽為入，險坎為內卦所以險難為內部，所以渙卦所要散除的是自身內部的險難，揭示事物發展過程中當散則散、當聚則聚，力求散而不亂聚而有序，聚散均循理而行的道理。"
    },
    "yaoInterpretation": {
      "初六":"初六，用拯馬壯，吉。\n《象》曰：初六之吉，順也。\n整備的馬很強壯，吉。傳統解釋為：以強壯的馬來拯救，吉。或：用以拯救馬傷，吉。初爻，還有壯馬，都有「馬上」、「快速」的隱喻，言盡早、盡快拯救為吉。壯古文通傷，因此亦可解釋為拯救馬傷。",
      "九二":"九二，渙奔其机，悔亡。\n《象》曰：渙奔其机，得願也。\n盛大地裝飾其憑几，悔亡。傳統注解言：渙散逃到一個可以倚身安歇的地方。",
      "六三":"六三，渙其躬，无悔。\n《象》曰：渙其躬，志在外也。\n大美其身，無悔。傳統注解為渙散其躬身，至於什麼是渙散其躬身？其渙散危難只及自身，言其渙散之功很小。",
      "六四":"六四，渙其群，元吉。渙有丘，匪夷所思。\n《象》曰：渙其群，元吉，光大也。\n大美其群眾，大善而吉。大美於丘園，不是一般人所能想到的。若渙解釋為渙散，此爻意思大致為：渙散群眾之險難，大吉。將群眾渙散至山丘，不是一般人所能想到的。渙卦講的是乘舟濟險之事，丘為高地可避水之患。",
      "九五":"九五，渙其汗，大號。渙王居，无咎。\n《象》曰：王居无咎，正位也。\n舞樂用的干盾裝飾美麗而盛大，音樂大作。大王的居所煥然一新，沒有罪咎。依傳統注解，「渙其汗大號」意思大致為：危險的解除有如發汗，君王大舉號令天下。",
      "上九":"上九，渙其血，去逖出，无咎。\n《象》曰：渙其血，遠害也。\n盛大其血祭，遠去而出，沒有罪咎。傳統註解以渙為離散，此爻意思為：流了血，災難遠去，憂慮不在，沒有罪咎。亦可進一步引申，比喻為危險、險難。"
    }
  },
  "010011": {
    "name": "節",
    "pinyin": "jié",
    "summary": "水澤節，澤上有水，節制自守。(中吉)",
    "detailed": "節卦象徵節制與規範，如水在澤中有序流動，澤是儲存水的地方，澤上有水，過滿則險，表示適當的節約與克制能帶來穩定，因此有為節制、調節之意。君子應懂得適可而止。節制不夠會散亂，節制太過則成苦節、吝嗇，而走向窮困。因此要注意如何取得平衡與中庸，而長遠來說，最好的節制方法還是建立制度。",
    "explanations": {
      "運勢": "適當節制可小亨通。不節制則凶，節制太過則窮困而難行。運勢良好，適合規劃長遠目標。",
      "感情": "很辛苦。感情需保持節制，不宜過於放縱。",
      "財運": "適當節制可求得小亨通。財運穩定，宜保持節約，不宜奢侈。",
      "工作": "工作適合遵守規範，穩健發展。",
      "買賣": "交易順利，應避免貪心過度擴張。",
      "考試": "考試運佳，適合穩步提升。",
      "健康": "健康良好，需控制飲食與生活習慣。",
      "訴訟": "訴訟有利，理性處理可達成和解。",
      "尋人": "尋人順利，對方可能生活規律。",
      "尋物": "尋物可得，可能存放於固定處。",
      "旅行": "旅行適宜，需做好規劃與準備。",
      "人際": "人際關係穩定，宜維持適當距離。",
      "卦辭": "節，亨。苦節不可貞。\n《彖》曰：節亨，剛柔分而剛得中。苦節不可貞，其道窮也。說以行險，當位以節，中正以通。天地節而四時成，節以制度，不傷財，不害民。\n《象》曰：澤上有水，節。君子以制數度，議德行。\n\n節制要能亨通，辛苦的節制不可以為正。節制應當適可而止，不要太嚴苛。《彖》曰：「苦節不可貞，其道窮也。」苦節節制太過會變成吝嗇，吝嗇則其道不可行、不可通，是窮困之道。節制太過，反而傷財、害民。\n\n【卦旨】節為節制，合理調控和約束，使事物發展有度，要適可而止，比如水庫中的水，水量超過最高警戒線，那就需放水否則氾濫，而如果水量低於最低警戒線，那就要儲水避免乾涸，揭示恰當適中的節制有利於事物的發展，節制不當或過度則將導致凶禍，因而必須順乎自然，行之有度，洽如其分的道理。"
    },
    "yaoInterpretation": {
      "初九":"初九，不出戶庭，无咎。\n《象》曰：不出戶庭，知通塞也。\n\n不出家裡的戶庭，沒有罪咎。外有水險，與水險之間的互體有艮山阻隔，艮為門闕，所以門闕之內的初九說不出戶庭，九二則說不出門庭。兩爻都是不出門之象。初九處潛龍之時，與六四相應，若是出門則坎險及身，所以不出門正是避險之道，《象》曰：「不出戶庭，知通塞也。」不出戶庭而無咎，是因為明白亨通與否塞的時機。",
      "九二":"九二，不出門庭，凶。\n《象》曰：不出門庭凶，失時極也。\n\n不出家中的門庭，凶。九二居見龍之位，仍深居簡出，不出門庭，節制太過，所以失其時而凶。初九說不出戶庭，九二則說不出門庭。為何初九无咎而九二卻是凶？初九居潛龍之位，當不出戶庭，慎密不出。九二．處見龍在田之位，與外之水險不相應，所以水險不及身。內卦則六三乘九二，九二又處兌中，因此九二當以出門為宜，不出門則所以為凶。",
      "六三":"六三，不節若，則嗟若，无咎。\n《象》曰：不節之嗟，又誰咎也。\n\n不節制，則哀嘆，沒有罪咎。不知節制，則要後悔感嘆。此時處於應當節制的時候，若反而縱情肆欲，毫不節制，將會走入窮困，後悔莫及。六三處兌悅的極處，又以陰處陽，不當位，為不守本份，乘九二之剛，為逆。處節之時，卻完全不知節制，所以樂極生悲。",
      "六四":"六四，安節，亨。\n《象》曰：安節之亨，承上道也。\n\n安於節制，可以亨通。六四當位而以柔承陽，雖然四為多懼之位，但是能夠安於節制，所以亨通。《象》曰：「安節之亨，承上道也。」言六四能夠順承於九五之君。",
      "九五":"九五，甘節，吉。往有尚。\n《象》曰：甘節之吉，居位中也。\n\n甘於節制，對於節制甘之如飴，吉，前往可以有賞。九五為節卦之主，其他爻都是被節制的對象，而此爻則是節制他人的主動者，所以前往可以有功。",
      "上六":"上六，苦節，貞凶，悔亡。\n《象》曰：苦節貞凶，其道窮也。\n\n辛苦的節制，堅持則凶。不需後悔。上六處節卦的頂點，是最為節制的一爻，但是節制過猶不及，又乘九五之君，所以為凶。《象》曰：「苦節貞凶，其道窮也。」苦節節制過度，所以將走上窮困。"
    }
  },
  "110011": {
    "name": "中孚",
    "pinyin": "zhōng fú",
    "summary": "風澤中孚，澤上迎風，誠信為本。(吉)",
    "detailed": "中孚卦，其表一是忠孚，忠為誠，孚為信，即誠信，二是衷孚，意謂誠信發乎內心。象徵誠信與內在真誠，如風吹澤面，內外相應，表示信守承諾可帶來成功。君子應堅守誠信，以信立業。中孚也是一個化險為夷之卦，吉道在於虛心、誠實，信譽。只有誠信才能真的感動人、說服人，而助你渡過危險。",
    "explanations": {
      "運勢": "雖然暗藏危機，諸事不順，但以虛心、誠實，信譽來說服他人，老實地做事，能渡過危險。誠信可帶來好運，說謊取巧則招凶險。",
      "感情": "感情關係真誠，彼此互相信賴。早生貴子之象。",
      "財運": "財運穩定，誠信經營可得長久之財。",
      "工作": "工作適合建立信譽，合作可成功。有財務虛空之象，為長遠計，此時商譽、信用格外的重要。",
      "買賣": "交易順利，誠信為本可獲客戶信賴。",
      "考試": "考試運佳，憑實力可得好成績。",
      "健康": "健康良好，心理平衡有助於身體健康。",
      "訴訟": "訴訟有利，憑誠信可得公平裁決。",
      "尋人": "尋人順利，對方可能信守承諾。",
      "尋物": "尋物可得，可能因誠實者歸還。",
      "旅行": "旅行適宜，可遇善良之人。",
      "人際": "人際關係佳，誠信待人可得貴人相助。",
      "卦辭": "中孚，豚魚吉，利涉大川，利貞。\n《彖》曰：中孚，柔在內而剛得中，說而巽，孚，乃化邦也。豚魚吉，信及豚魚也；利涉大川，乘木舟虛也；中孚以利貞，乃應乎天也。\n《象》曰：澤上有風，中孚，君子以議獄緩死。\n\n內心虔誠，即使以簡單的豬和魚當牲禮亦可得吉。利於涉水渡大河，利於貞定。豚與魚分別指豬肉和魚，是祭祀所用的牲禮中最為簡薄的。雖然簡薄，但是祭祀重在虔誠。因為虔誠，所以為吉。利涉大川，利於涉險。中孚有舟楫行水之象，所以能夠渡險。渙卦與中孚卦皆曰「利涉大川，利貞」，蓋因兩卦都有行舟濟險之象，渙所濟者為坎險，中孚所濟者兌澤之毀折。此與需「貞吉，利涉大川」，大畜「利貞，不家食，吉，利涉大川」，求貞吉之後再涉大川者不同，需者待也，大畜者蘊畜，所待所畜者貞吉。\n\n【卦旨】中孚為心懷誠信，何謂心懷誠信？論語有言：「言必信，行必果，硜硜然小人栽。」言意上等的誠信並不是一定要言必信，行必果，而應為義所在，無論做何事「義」都應為優的考量，也就是義不在，言就不必信，行就不必果，如果一個人一昧堅持言必信，行必果的信條，不知變通、迂腐而又固執，那這種誠信就只是小人的誠信而已，當然這裡指的小人並非道德意義上的小人，而是泛指識量淺狹的普通人，揭示立身治事應心懷中正之誠信，廣施於人，而不可居心不誠，虛情假意。"
    },
    "yaoInterpretation": {
      "初九":"初九，虞吉，有它不燕。\n《象》曰：初九虞吉，志未變也。\n\n深思為之預防則吉，因為有蛇會讓人不安。中孚有中孵之義，畜養禽鳥最怕蛇來吃蛋，蛋被吃則無以孵化。有大蛇當然讓人不安，因此能有虞慮豫防為吉。註解為：用心專一則吉，心不專一、旁騖於他則不安。《象傳》「志未變也」，用心專一，所以志向不變。",
      "九二":"九二，鳴鶴在陰，其子和之；我有好爵，吾與爾靡之。\n《象》曰：其子和之，中心願也。\n\n母鶴在看不到的陰暗之處鳴叫，小鶴與其相呼應。我有好的酒杯，和你一起共飲美酒。此比喻人立心誠篤，就會得到感應與共鳴，就如母鶴與小鶴心靈自然可以相通。「我有好爵，吾與爾靡之」，比喻人德不孤，必有鄰。",
      "六三":"六三，得敵，或鼓或罷，或泣或歌。\n《象》曰：或鼓或罷，位不當也。\n\n得到了敵人，讓人不知要鳴鼓進攻還是要停戰作罷；不知要悲哀地哭泣還是高歌一曲。言進退失據，不知如何是好。",
      "六四":"六四，月幾望，馬匹亡，无咎。\n《象》曰：馬匹亡，絕類上也。\n\n月亮就要變滿月了，馬匹卻丟失不見，沒有罪咎。馬匹亡，馬匹走失，或者馬無法匹配。月幾望為未近圓而未圓，為不利出征之象。",
      "九五":"九五，有孚攣如，无咎。\n《象》曰：有孚攣如，位正當也。\n\n以誠信相互牽繫，沒有罪咎。或：有俘擄，繫綁一起，沒有罪咎。此言彼此誠信相待，互相信任，能夠心手相連。",
      "上九":"上九，翰音登于天，貞凶。\n《象》曰：翰音登于天，何可長也。\n\n祭祀用的雞飛上了天，堅定則凶。此言不要把反常的現象當做常態，以此為堅持當然為凶。上九處中孚的頂點，過中而不當位，為孚不由衷，言過其實者。雞並不會飛，現在竟然飛上天，這是反常的現象，不可長久，所以《象傳》說「何可長也」。如果以此為正，當然為凶。或曰：雞鳴之聲高飛而登於天，以此正定則凶。諷刺人唱高調，言過於實，虛浮而不可信。雞在古代被視為知時之物，其報時可信。今其音高飛而登於天，失其時而不可信矣。"
    }
  },
  "001100": {
    "name": "小過",
    "pinyin": "xiǎo guò",
    "summary": "雷山小過，山上雷震，慎行謹慎。(小凶)",
    "detailed": "小過卦象徵過度與謹慎，如雷動於山，表示行事易有過度之處，君子應低調行事，避免過於激進。得小過卦有如在躲獵人的小鳥，靜靜不動反而是最安全的，若要動，則往樹底下、草叢中躲為吉，如果想要往上飛以逃脫獵人的追補，反而大凶。",
    "explanations": {
      "運勢": "運勢不穩，退守、以靜制動為宜。需謹慎處理事務。退讓吉、進取則大凶。",
      "感情": "感情關係易因小事爭執，需克制情緒。求緣者放棄為宜。",
      "財運": "財運欠佳，投資需特別謹慎。",
      "工作": "工作易有小錯誤，需仔細檢查。凡事退一步為吉，進一步、往上爬則凶。",
      "買賣": "交易有波動，宜防範細節錯誤。",
      "考試": "考試運普通，細節決定成敗。",
      "健康": "健康需注意，避免小病拖成大病。",
      "訴訟": "訴訟需小心處理，不宜衝動。",
      "尋人": "尋人較難，對方可能刻意低調。",
      "尋物": "尋物困難，可能因小事遺失。",
      "旅行": "旅行不宜，須保持低調行事，易遇小阻礙。",
      "人際": "人際關係易生誤會，需慎言慎行保持低調。",
      "卦辭": "小過，亨，利貞，可小事，不可大事。飛鳥遺之音，不宜上，宜下，大吉。\n《彖》曰：小過，小者過而亨也，過以利貞，與時行也。柔得中，是以小事吉也；剛失位而不中，是以不可大事也。有飛鳥之象焉，飛鳥遺之音，不宜上，宜下，大吉，上逆而下順也。\n《象》曰：山上有雷，小過。君子以行過乎恭，喪過乎哀，用過乎儉。\n\n小事要做得超過，至於亨通，利於貞定。可以做小事，不可以做大事。傳來飛鳥遺留的聲音，不適宜往上飛，適於往下找棲息之所，往下則大吉。\n\n【卦旨】小過為小有過度，就是超過、超越、超出等意，在《周易》裡，陽為大、陰為小，所以小過卦的小指的是陰的過，與大過卦的大過恰好相反，從小過卦的六爻來看四條陰爻在外，兩條陽爻在內，陰強陽衰，也即陰柔過盛，揭示在某些特定的情況下，在一些小事上必須稍有過度，但又不能太為過甚，而應當守正謙恭的道理。"
    },
    "yaoInterpretation": {
      "初六":"初六，飛鳥以凶。\n《象》曰：飛鳥以凶，不可如何也。\n\n小過卦宜下不宜上，宜靜不宜動，若振翅高飛則凶。六動則成離，故為「飛鳥以凶」，即上六的「飛鳥離之，凶」。離就是擒獲、捕獲的意思。初六居全卦及艮體之下，又柔靜而能安，為何說飛鳥以凶？一、此為告誡之辭，就其爻象來看，初六乃柔靜而止之象，若能守此柔靜之德，並無飛鳥之凶。不能守此德而躁動，將致災眚。二、若以六爻為一象來看，小過全卦為飛鳥之象，三四兩爻為小鳥之身體，初二與五上則是拍動的翅膀，初上兩爻都有動極之象，因此兩爻皆有飛鳥以凶之象。",
      "六二":"六二，過其祖，遇其妣。不及其君，遇其臣，无咎。\n《象》曰：不及其君，臣不可過也。\n\n越過了祖父，遇到了祖母。追不上君王，而遇到了臣子。沒有罪咎。此言做事將受阻，或者與重要人物擦身而過，無法找到想找的人。",
      "九三":"九三，弗過，防之，從或戕之，凶。\n《象》曰：從或戕之，凶如何也。\n\n未能通過，防備於他。接著可能傷害於他，凶。小過大象為坎，二陽坎陷於四陰之中。又小過為陰勝於陽，九三與九四二陽坎陷而無法越過陰，因此兩爻都稱「弗過」。既知無法勝陰，那麼理應防之，以免於凶災。九四與九三的差別在於，九三當位又為艮止之上爻，當位而知止。九四則是不當位，又處上卦震之初，因此不知止而往，前往當遇到危險（厲為危險）。傳統將「弗過防之」連讀，意指未能嚴加防備。。小過卦吉道在於小心情願要有些過度，就是小心再小心的意思。「過防之」也是謹慎再謹慎的防備他。",
      "九四":"九四，无咎，弗過，遇之，往厲必戒，勿用永貞。\n《象》曰：弗過遇之，位不當也；往厲必戒，終不可長也。\n\n沒有罪咎。未能通過而與其相遇，動身前往則必危險，應當警誡之。不當永遠堅持於此。陽與陰互相靠近，但陽仍無法超過陰（喻指小人、女子），而與其相遇；前往必有危險，一定要心存戒心。傳統將「弗過遇之」連讀，文義不順，相關論證見九三爻。",
      "六五":"六五，密雲不雨，自我西郊，公弋取彼在穴。\n《象》曰：密雲不雨，已上也。\n\n烏雲密布卻不下雨，一直從西方的郊外聚集而來。王公射擊捕獲躲在洞中的小鳥。密雲不雨比喻心中疑惑很深。睽卦上九「遇雨則吉」，《象》曰：「遇雨之吉，群疑亡也。」鼎九三「方雨虧悔，終吉」。遇雨則吉，密雲不雨則心中疑慮。此段也是意指小事可成，大事不可；不宜上，宜下。密雲不雨是不宜上，不可大事；取彼在穴是宜下，小事吉。",
      "上六":"上六，弗遇，過之，飛鳥離之，凶，是謂災眚。\n《象》曰：弗遇過之，已亢也。\n\n無法相遇而超過，高飛的小鳥遭網捕獲。凶，會有災難。六五和上六都是過於陽之陰，也是真正的「小過」（陰勝於陽）之爻。六五與陽有遇，上六比六五則又過陽更遠，和陽爻無所遇，所以說「弗遇，過之」。《象》曰：「弗遇過之，已亢也。」已過於高亢。上六與初六在大象中同為飛鳥振翅的兩端，上六處小過之極，為高飛之小鳥，又爻動為離，所以說「小鳥離之」，小鳥遭網所捕獲。小過卦宜下不宜上，上六過高，所以大凶。卦辭說「凶，是謂災眚」。眚，音同「節省」的省。離，字義原指以網捕獲小鳥。"
    }
  },
  "010101": {
    "name": "既濟",
    "pinyin": "jì jì",
    "summary": "水火既濟，水火相濟，成功穩定。(大吉)",
    "detailed": "既濟卦象徵完成與穩定，如水火既調和，表示事業已達成目標，君子應珍惜成果，穩定發展。萬事俱備，條件已成，既濟卦的危險就在於它的過於完美，因為這意謂著未來只有走下坡，而沒有走上坡的道理，人無遠慮，必有近憂；若只沉浸於眼前的完美狀態，則凶險不遠。正所謂「守成不易」，如何讓最佳狀態保持更久，是既濟卦的挑戰。",
    "explanations": {
      "運勢": "運勢大吉，事業與生活已趨穩定。先吉後凶。事可成，但應提防後勢走下坡。",
      "感情": "感情圓滿，彼此信任，關係穩固。求緣者天造地設的絕配。",
      "財運": "財運旺盛，可長期穩定經營。投資利於短期操作，發展穩定，但須堤防未來勢高走低。",
      "工作": "工作發展良好，適合穩健經營。",
      "買賣": "交易順利，市場需求穩固。",
      "考試": "考試運佳，實力發揮穩定。",
      "健康": "健康良好，適合保持現有的生活習慣。",
      "訴訟": "訴訟有利，可得圓滿解決。",
      "尋人": "尋人順利，對方狀況穩定。",
      "尋物": "尋物可得，可能放置於固定之地。",
      "旅行": "旅行適宜，可享安穩旅程。",
      "人際": "人際關係良好，適合鞏固現有關係。",
      "卦辭": "既濟，亨小利貞，初吉終亂。\n《彖》曰：既濟亨，小者亨也。利貞，剛柔正而位當也。初吉，柔得中也，終止則亂，其道窮也。\n《象》曰：水在火上，既濟，君子以思患而豫防之。\n\n既濟，開始為吉，最終將亂。物極必反，既濟卦為一切事情的條件都到位，完美到無以復加，但緊接著的則是開始情況逐漸走下坡，走到極點則是既濟成未濟，未濟則亂矣。因此說「初吉終亂」。《大象傳》警告要「思患而豫防之」。既濟之所以僅得小亨，戒占者當謹小慎微以善終。初吉指下卦離明，終亂為上卦坎險。\n\n【卦旨】既濟為事已成，既指動作已完成，濟為渡河，所以既濟就是指已經渡過的河流，象徵事情已經完成，六三卦既濟卦象徵事情完成，但為何六四卦最後一卦未濟卦象徵事情未完呢？其實這體現「物不可窮」的發展規律，也就是說事物的發展無窮無盡，事物某的發展過程的結束同時也意味著一個新的過程將開始，既濟與未濟的區別在於，既濟卦代表舊過程的結束，而未濟卦代表新過程的開始，這種舊的結束、新的開始，不是簡單意義上的循環往復，而是「更上一層樓」式的階段發展，也即哲學上的否定之否定規律，揭示事業已成之時，必須持中守正、節制戒懼，不可忘形驕縱的道理，其中亦流露出盛極必衰、守成艱難的憂。"
    },
    "yaoInterpretation": {
      "初九":"初九，曳其輪，濡其尾，无咎。\n《象》曰：曳其輪，義无咎也。\n\n牽制其車輪，沾溼牠的尾巴，沒有罪咎。車輪受到牽引拖累，難以前進。狐狸的尾巴被水沾濕，使其行動不便。曳輪濡尾都在比喻濟渡之困難。將曳輪濡尾解讀為謹慎小心而不躁進。",
      "六二":"六二，婦喪其茀，勿逐，七日得。\n《象》曰：七日得，以中道也。\n\n婦人喪失了飾品，不必去追逐，失物七日自然回來。七日在《易經》中有特殊的象徵，因易卦有六爻，經過七次的陰陽推移則產生消息變化。例如，乾卦六爻剝盡，則一陽復生於下，從陽退陰進變為陽進陰退，故復卦言七日來復。",
      "九三":"九三，高宗伐鬼方，三年克之，小人勿用。\n《象》曰：三年克之，憊也。\n\n高宗為有才德有能力的殷商君主，征伐鬼方尚且如此困難，如果是一般凡夫俗子，恐怕完全無法勝任，因此曰小人勿用。此比喻事情困難，只有有才德的君子，才堪此重任。即使如此，也要多年時間才得以完成。有多種不同的解讀。一、若問筮者為小人，那麼不宜有所作為。二、勿用小人之義。三、勿與小人謀畫。",
      "六四":"六四，繻有衣袽，終日戒。\n《象》曰：終日戒，有所疑也。\n\n高貴華麗的布帛裡有破衣的敗絮，整日警戒。金玉其外，敗絮其內之義。或暗指有內鬼。因此當終日警戒。傳統多依王弼註，而將繻借為濡，濡原義為沾濕。既濟講的既然是渡河之事，因此濡又演繹為船有破洞。衣袽則為當抹布的破衣。繻有衣袽，船有破洞時，有破布可以塞破洞。",
      "九五":"九五，東鄰殺牛，不如西鄰之禴祭，實受其福。\n《象》曰：東鄰殺牛，不如西鄰之時也。實受其福，吉大來也。\n\n東邊的鄰居殺牛大肆祭祀，鋪張浪費但不合時宜，缺乏虔誠，反而不如西邊的鄰居，以最簡單而符合時節的方式祭祀來得實惠。鄭玄認為，東鄰西鄰分別喻指商紂和周文王，因周在西，殷在東。文王稱西伯。告戒君子，除謹守簡約之道，凡事都要順應時機，誠心誠意。",
      "上六":"上六，濡其首，厲。\n《象》曰：濡其首厲，何可久也。\n\n沾濕了頭，危險。已到既濟的盡頭，時局將轉為不濟。不知深淵在前，而暴虎馮河，所以有濡首之象。注意有滅頂的危險。濡為濕的意思，濡其首為弄濕頭。渡水而弄濕頭，此有滅頂之危險，所以說「厲」。坎為水為濡。例如需卦的需即古濡字，濡象由上之坎而來。六爻中初為尾，上為首。因此初九說濡其尾，上六說濡其首。濡首似乎意指飲酒過渡，耽溺之義。實則一語雙關。就濟渡來說，濡首則未濟而危厲。"
    }
  },
  "101010": {
    "name": "未濟",
    "pinyin": "wèi jì",
    "summary": "火水未濟，水火不濟，未竟之業。(小凶)",
    "detailed": "未濟卦象徵尚未完成，如火在水上，冷熱不調、陰陽未合。表示事物未達圓滿，仍需努力。君子應謹慎行事，克服挑戰，以求圓滿。做任何事情之前都要小心觀察之後再做判斷，絕對不可輕舉妄為，也要慎防被欺騙。",
    "explanations": {
      "運勢": "運勢不穩，計畫未完全成熟，需再努力。無利可圖，小心被外表所欺騙，不得其利，反受其害。",
      "感情": "感情關係未定，需進一步培養感情基礎。小心被表象所欺騙，受到傷害。",
      "財運": "財運一般，投資應謹慎，避免半途而廢。",
      "工作": "工作尚未完成，需耐心推進，避免急功近利。若不用心明辨真相，可能受到二次傷害。無利可圖。",
      "買賣": "交易進展緩慢，需適當調整策略。",
      "考試": "考試運普通，需全力以赴才能達標。",
      "健康": "健康需注意，身體狀況可能有隱患。",
      "訴訟": "訴訟未決，需等待進一步發展。",
      "尋人": "尋人較難，對方行蹤不定，需多方查找。",
      "尋物": "尋物尚未找回，需耐心尋找。",
      "旅行": "旅行不宜，途中可能有變數。",
      "人際": "人際關係未明朗，需時間驗證信任。",
      "卦辭": "未濟，亨。小狐汔濟，濡其尾，无攸利。\n《彖》曰：未濟亨，柔得中也；小狐汔濟，未出中也；濡其尾，无攸利，不續終也。雖不當位，剛柔應也。\n《象》曰：火在水上，未濟，君子以慎辨物居方。\n\n未濟也有亨通之道，在於柔順而得中庸，指六五爻，《彖傳》說的「柔得中也」。小狐狸因為沒有仔細審查情況而貿然下水，不得其利，反受其害，因此卦辭後面說「无攸利」。\n\n【卦旨】未濟為事未成，未指動作未完成，濟為渡河，所以未濟就是指還未渡過的河流，象徵事情還未完成，六三卦既濟卦象徵事情完成，但為何六四卦最後一卦未濟卦象徵事情未完呢？其實這體現「物不可窮」的發展規律，也就是說事物的發展無窮無盡，事物某的發展過程的結束同時也意味著一個新的過程將開始，既濟與未濟的區別在於，既濟卦代表舊過程的結束，而未濟卦代表新過程的開始，這種舊的結束、新的開始，不是簡單意義上的循環往復，而是「更上一層樓」式的階段發展，也即哲學上的否定之否定規律，揭示事業未成之時，應當堅循中正、審慎進取，以逐步促使事物邁向成功的道理。"
    },
    "yaoInterpretation": {
      "初六":"初六，濡其尾，吝。\n《象》曰：「濡其尾，亦不知極也。」\n\n不知自己的極限、能耐，而遭此濡。未濟之時，未謹慎審察情勢，不自量力而冒險行事，不蒙其利，反受其害。六位中上為首，下為尾。初六說濡其尾，上九說濡其首。",
      "九二":"九二，曳其輪，貞吉。\n《象》曰：「九二貞吉，中以行正也。」\n\n車輪受牽制，難以前進，貞定為吉。",
      "六三":"六三，未濟，征凶，利涉大川。\n《象》曰：「未濟征凶，位不當也。」\n\n未得救濟，出征凶，利於涉險渡河。爻辭講「未濟，征凶」，又言「利涉大川」，前後矛盾。因未濟就是未能渡河，那怎麼會利於涉大川？李光地則以「時」來解釋：「既濟、未濟兩卦爻辭，未有舉卦名者，獨此爻曰未濟。蓋他爻之既濟未濟者時也，順時以處之而已。此爻時可濟矣，而未能濟，是未濟在己而不在時，故言未濟，見其失時也。無濟之才，故於征則凶，有畏愼之心，故於涉大川則利。」",
      "九四":"九四，貞吉，悔亡。震用伐鬼方，三年有賞于大國。\n《象》曰：「貞吉悔亡，志行也。」\n\n貞定則吉，不再悔恨。四原本就是多懼的位置，九四又不當位，所以本當有悔。貞吉悔亡，言貞定則吉，悔也當亡。若不貞定而大舉行動，那麼必需經過三年（長時間）的征討才會有功。",
      "六五":"六五，貞吉，无悔。君子之光，有孚，吉。\n《象》曰：「君子之光，其暉吉也。」\n\n貞定則吉，無所後悔。君子的德性光暉，能夠打動人心而讓人信服，吉。",
      "上九":"上九，有孚于飲酒，无咎。濡其首，有孚失是。\n《象》曰：「飲酒濡首，亦不知節也。」\n\n相信於飲食喝酒之宴樂，沒有罪咎。但若喝酒喝到濕了頭，那麼相信也將會失去這一切。未濟已過，將轉既濟。信於既濟（有孚），適度的飲酒逸樂無傷大雅，但告戒君子當有所節制，不能耽溺。"
    }
  }
}